{
    "subject": "CFP :: DEIS 2013",
    "from": "deis conference <deisconference@gmail.com>",
    "to": "manar@sdiwc.info",
    "cc": null,
    "bcc": null,
    "date": "Wed, 05 Sep 2012 04:11:27 -0700",
    "body": "The Second International Conference on Digital Enterprise and Information\nSystems (DEIS 2013)\nAsia Pacific University of Technology and Innovation (APU), Kuala Lumpur,\nMalaysia\n                                        March 4-6, 2013\n                         http://sdiwc.net/conferences/2013/Malaysia1/\n========================================================================\n\nThe proposed conference on the above theme will be held at Asia Pacific\nUniversity of Technology and Innovation (APU), Kuala Lumpur, Malaysia, From\nMarch 4-6, 2013 which aims to enable researchers build connections between\ndifferent digital applications.\n\nThe conference welcomes papers on the following (but not limited to)\nresearch topics:\n\n- Information Ethics\n- Information Content Security\n- Data Compression\n- E-Technology\n- E-Government\n- E-Learning\n- Cloud Computing\n- Grid Computing\n- Green Computing\n- Access Controls\n- Data Mining\n- Social Search\n- Computer Forensics\n- Computer Security\n- Peer-to-Peer Social Networks\n- Information and Data Management\n- Peer-to-Peer Networks\n- Network Security\n- Social Networks\n- Real-Time Systems\n- Internet Modeling\n- Assurance of Service\n- Image Processing\n- Web Services Security\n- Multimedia Computing\n- Software Engineeing\n- Biometrics Technologies\n- Wireless Communications\n- Semantic Web, Ontologies\n- Mobile Social Networks\n- Anti cyberterrorism\n- XML-Based Languages\n- Soft Computing Techniques\n- Computational Intelligence\n- Mobile Networking, Mobility and Nomadicity\n- Ubiquitous Computing, Services and Applications\n- Forensics, Recognition Technologies and Applications\n- Fuzzy and Neural Network Systems\n- Signal Processing, Pattern Recognition and Applications\n- Distributed and Parallel Applications\n- User Interfaces,Visualization and Modeling\n- Mobile, Ad Hoc and Sensor Network Management\n- Web Services Architecture, Modeling and Design\n- Quality of Service, Scalability and Performance\n- Self-Organizing Networks and Networked Systems\n- Data Management in Mobile\n- Data Stream Processing in Mobile/Sensor Networks\n- Indexing and Query Processing for Moving Objects\n- User Interfaces and Usability Issues form Mobile Applications\n- Sensor Networks and Social Sensing\n- Embedded Systems and Software\n- Information Propagation on Social Networks\n- Resource and Knowledge Discovery Using Social Networks\n- Computer Crime Prevention and Detection\n- Confidentiality Protection\n- Critical Infrastructure Management\n- Critical Computing and Storage\n- Cryptography and Data Protection\n\n\nResearchers are encouraged to submit their work electronically. All papers\nwill be fully refereed by a minimum of two specialized referees. Before\nfinal acceptance, all referees comments must be considered.\n\n\nImportant Dates\n==============\n\nSubmission Date           : Dec. 15, 2012\nNotification of acceptance: Jan. 1, 2013\nCamera Ready submission   : Jan. 20, 2013\nRegistration              : Jan. 20, 2013\nConference dates          : March 4-6, 2013\n\nThe Second International Conference on Digital Enterprise and Information Systems (DEIS 2013)Asia Pacific University of Technology and Innovation (APU), Kuala Lumpur, Malaysia                                        March 4-6, 2013\n                         http://sdiwc.net/conferences/2013/Malaysia1/========================================================================The proposed conference on the above theme will be held at Asia Pacific University of Technology and Innovation (APU), Kuala Lumpur, Malaysia, From March 4-6, 2013 which aims to enable researchers build connections between different digital applications.\nThe conference welcomes papers on the following (but not limited to) research topics:- Information Ethics- Information Content Security  - Data Compression- E-Technology  - E-Government  - E-Learning\n- Cloud Computing- Grid Computing- Green Computing- Access Controls  - Data Mining  - Social Search  - Computer Forensics- Computer Security- Peer-to-Peer Social Networks  - Information and Data Management\n- Peer-to-Peer Networks- Network Security- Social Networks- Real-Time Systems- Internet Modeling- Assurance of Service  - Image Processing- Web Services Security- Multimedia Computing  \n- Software Engineeing- Biometrics Technologies- Wireless Communications- Semantic Web, Ontologies- Mobile Social Networks- Anti cyberterrorism- XML-Based Languages- Soft Computing Techniques\n- Computational Intelligence- Mobile Networking, Mobility and Nomadicity- Ubiquitous Computing, Services and Applications- Forensics, Recognition Technologies and Applications- Fuzzy and Neural Network Systems\n- Signal Processing, Pattern Recognition and Applications- Distributed and Parallel Applications- User Interfaces,Visualization and Modeling- Mobile, Ad Hoc and Sensor Network Management- Web Services Architecture, Modeling and Design\n- Quality of Service, Scalability and Performance- Self-Organizing Networks and Networked Systems- Data Management in Mobile- Data Stream Processing in Mobile/Sensor Networks- Indexing and Query Processing for Moving Objects\n- User Interfaces and Usability Issues form Mobile Applications- Sensor Networks and Social Sensing- Embedded Systems and Software- Information Propagation on Social Networks- Resource and Knowledge Discovery Using Social Networks\n- Computer Crime Prevention and Detection- Confidentiality Protection- Critical Infrastructure Management- Critical Computing and Storage- Cryptography and Data Protection    Researchers are encouraged to submit their work electronically. All papers will be fully refereed by a minimum of two specialized referees. Before final acceptance, all referees comments must be considered.\nImportant Dates==============Submission Date           : Dec. 15, 2012Notification of acceptance: Jan. 1, 2013Camera Ready submission   : Jan. 20, 2013 Registration              : Jan. 20, 2013\nConference dates          : March 4-6, 2013\n",
    "attachments": []
}