{
    "subject": "CFP : International Journal of Education (IJE)",
    "from": "mia jack <MIAliyan123@hotmail.com>",
    "to": "Undisclosed recipients:;",
    "cc": null,
    "bcc": null,
    "date": "Thu, 19 Dec 2019 08:01:05 +0000",
    "body": "International Journal of Education (IJE)\n\nISSN : 1839-519N 2974-5962 (Print)\nhttp://flyccs.com/jounals/IJEMS/Home.html\n\n\n\nScope\n\nInternational Journal of Education (IJE) is a Quarterly peer-reviewed and refereed open access journal that publishes articles which contribute new results in all areas of Education. The journal is devoted to the publication of high quality papers on theoretical and practical aspects of Educational research. The goal of this journal is to bring together researchers and practitioners from academia and industry to focus on Educational advancements, and establishing new collaborations in these areas. Original research papers, state-of-the-art reviews are invited for publication in all areas of Education.\n\nTopics of interest include, but are not limited to, the following\n\n  *   Education Policy and Leadership\n  *   Business Education\n  *   Educating the educators\n  *   Professional Development for teachers in ICT\n  *   Teacher Evaluation\n  *   Virtual and remote laboratories\n  *   Pedagogy Enhancement with E-Learning\n  *   Course Management Systems\n  *   Web-based tools for education\n  *   Games and simulations in Education\n  *   Learning / Teaching Methodologies and Assessment\n  *   Curriculum, Research and Development\n  *   Counselor Education\n  *   Integrating technology in curriculum: Challenges & Strategies\n  *   Collaborative & Interactive Learning\n  *   Tools for 21st Century learning\n  *   Learning Analysis\n  *   Student Selection Criteria in Interdisciplinary Studies\n  *   Global Issues in Education and Research\n  *   Technology Support for Pervasive Learning\n  *   Artificial Intelligence, Robotics and Human computer Interaction in Education\n  *   Mobile/ubiquitous computing in education\n  *   Web 2.0, Social Networking, Blogs and Wikis\n  *   Multimedia in Education\n\nPaper Submission\n\nAuthors are invited to submit papers for this journal through Submission System. Submissions must be original and should not have been published previously or be under consideration for publication while being evaluated for this Journal.\n\nImportant Dates\n\n  *   Submission Deadline :December 21, 2019\n  *   Notification :December 27, 2019\n  *   Final Manuscript Due :Janaury 30, 2020\n  *   Publication Date : Determined by the Editor-in-Chief\n\n\n\nTO SUBMIT YOUR PAPER, PLEASE CLICK THE FOLLOWING LINK Submit\n\n\n\n\n\n\n\nInternational Journal of Education (IJE)\n\n\nISSN : 1839-519N 2974-5962 (Print)\n\nhttp://flyccs.com/jounals/IJEMS/Home.html\n \n\n \n\nScope                                                                                                 \n\n\nInternational Journal of Education (IJE)\nis a Quarterly peer-reviewed and refereed open access journal that publishes articles which contribute new results in all areas of Education. The\n journal is devoted to the publication of high quality papers on theoretical and practical aspects of Educational research. The goal of this journal is to bring together researchers and practitioners from academia and industry to focus on Educational advancements,\n and establishing new collaborations in these areas. Original research papers, state-of-the-art reviews are invited for publication in all areas of Education.\n\n\nTopics of interest include, but are not limited to, the following\n\nEducation Policy and LeadershipBusiness EducationEducating the educatorsProfessional Development for teachers in ICTTeacher EvaluationVirtual and remote laboratoriesPedagogy Enhancement with E-LearningCourse Management SystemsWeb-based tools for educationGames and simulations in EducationLearning / Teaching Methodologies and AssessmentCurriculum, Research and DevelopmentCounselor EducationIntegrating technology in curriculum: Challenges & StrategiesCollaborative & Interactive LearningTools for 21st Century learningLearning AnalysisStudent Selection Criteria in Interdisciplinary StudiesGlobal Issues in Education and ResearchTechnology Support for Pervasive LearningArtificial Intelligence, Robotics and Human computer Interaction in EducationMobile/ubiquitous computing in educationWeb 2.0, Social Networking, Blogs and WikisMultimedia in Education\n\nPaper Submission\n\nAuthors are invited to submit papers for this journal through\nSubmission System.\n Submissions must be original and should not have been published previously or be under consideration for publication while being evaluated for this Journal.\n\n\nImportant Dates\n\nSubmission Deadline :December 21, 2019Notification :December 27, 2019Final Manuscript Due :Janaury 30, 2020Publication Date : Determined by the Editor-in-Chief\n\n \n\nTO SUBMIT YOUR PAPER, PLEASE CLICK THE FOLLOWING LINK\nSubmit\n\n \n\n \n\n \n\n \n\n \n\n \n\n\n\n\n",
    "attachments": []
}