{
    "subject": "CFP ~ Innovation-Entrepreneurship and Cybernetics-Informatics",
    "from": "SIE 2015 <cfp-summer@mail.2015iiisconferences.org>",
    "to": "FOAAD@CALPOLY.EDU",
    "cc": null,
    "bcc": null,
    "date": "Mon, 06 Oct 2014 20:39:02 -0400",
    "body": "Dear  Foaad Khosmood,\n\nWe would like to invite you to participate in the Symposium on Innovation-Entrepreneurship and their relationships with Cybernetics and Informatics: (SIE 2015, http://www.2015iiisconferences.org/sie), being organized in the context of The 6th International Multi-Conference on Complexity, Informatics and Cybernetics: IMCIC 2015, to be held) in Orlando, Florida, USA, on March 10 - 13, 2015.\n\nThe submissions deadline is October 28, 2014. Other deadlines are listed at the Symposium web site. Deadlines for collocated events are listed at the General CFP posted at http://www.2015iiisconferences.org/cfp-spring2015.asp\n-------------------------------------------------------------\nWorkshop\nA workshop on Educational Innovation and Entrepreneurship will be delivered, in the context of the event by Professor T. Grandon Gill, Founding Director of the Doctorate on Business Administration in the University of South Florida.\n-------------------------------------------------------------\nKeynote Speakers:\nTechnical and Plenary Keynote Speakers will be selected from early submissions because this selection requires an additional evaluation (besides to the quality of the paper assessed by its reviewers) related to the authors' CV and the paper's topic.\n-------------------------------------------------------------\nSubmissions for face-to-face and virtual presentations are both accepted. Details about the following issues have also been included at the URLs given above:\n   Pre- and post-conference virtual session\n   Virtual participation\n   Two-tier reviewing combining double-blind and non-blind methods.\n   Access to reviewers comments and evaluation average.\n   Waiving the registration fee of effective invited session organizers.\n   Best papers awards\n   Publication of best papers in the Journal of Systemics, Cybernetics, and Informatics (JSCI), which indexed in EBSCO, Cabell, DOAJ (Directory of Open Access Journals), and Google Scholar and Listed in Cabell Directory of Publishing Opportunities and in Ulrichs Periodical Directory. (All papers to be presented at the conference will be included in the conference printed and electronic proceedings)\n\nPlease consider to contribute to and/or forward to the appropriate groups who might be interested in submitting contribution to the above mentioned collocated events. New information and deadlines are posted on the conference and the IIIS web site (especially at the URL provided above).\n\nBest regards,\n\nSIE 2015 Organizing Committee.\n\nIf you wish to be removed from this mailing list, please send an email to remove@mail.2015iiisconferences.org REMOVE MLCONFERENCES in the subject line. Address: C.C. El Placer II, Office 5, Caracas, Venezuela.\n",
    "attachments": []
}