{
    "subject": "CFP: Bioinformatics, Health Informatics, AI, HPC conferences (July 29 - August 1, 2019; Las Vegas); Deadline: June 20",
    "from": "sc@world-comp.org",
    "to": "foaad@calpoly.edu",
    "cc": null,
    "bcc": null,
    "date": "Wed, 19 Jun 2019 01:57:08 -0400",
    "body": "\n                         CALL  FOR  PAPERS\n         Paper Submission Deadline (EXTENDED): June 20, 2019\n\n        July 29 - August 1, 2019, Luxor (MGM), Las Vegas, USA\n               https://americancse.org/events/csce2019 \n\nIn order to leverage synergy between various CS & CE fields, the program\ncommittee of the following conferences have their 2019 events held at\none venue (same location and dates). One registration covers access to\nall sessions of all conferences.\n\nBIOCOMP'19:\n   20th International Conference on Bioinformatics & Computational Biology\n   https://americancse.org/events/csce2019/conferences/biocomp19 \n\nHIMS'19:\n   5th International Conference on Health Informatics & Medical Systems\n   https://americancse.org/events/csce2019/conferences/hims19 \n\nBIOENG'19:\n   5th International Conference on Biomedical Engineering & Sciences\n   https://americancse.org/events/csce2019/conferences/bioeng19 \n\nIKE'19:\n   18th International Conference on Information & Knowledge Engineering\n   https://americancse.org/events/csce2019/conferences/ike19 \n\nICAI'19:\n   21st International Conference on Artificial Intelligence\n   https://americancse.org/events/csce2019/conferences/icai19 \n\nPDPTA'19:\n   25th International Conference on Parallel & Distributed Processing\n   Techniques & Applications\n   https://americancse.org/events/csce2019/conferences/pdpta19 \n\nCSC'19:\n   17th International Conference on Scientific Computing\n   https://americancse.org/events/csce2019/conferences/csc19 \n\nAll accepted papers will be published in printed conference books\n(proceedings) - with unique international ISBN number and will also be\nmade available online. Extended papers of all accepted papers will also\nbe considered for publicaton in journals (indexed by Scopus, ACM DL, Ei\nCompendex, SCI, ISI, ...; publishers include: Springer, Elsevier,\nIEEE, ...).\n\nThe detailed topical scope of each conference can be found in the\nconference URLs (shown above). To get a feeling about the conferences'\natmosphere, see some delegates photos available at (over 2,000 photos):\nhttps://photos.ucmss.com/ \n\n\nINTRODUCTION:\n\n   We anticipate having between 1,000 and 2,000 participants in the\n   Congress. The congress includes 20 major tracks\n   ( https://www.americancse.org/events/csce2019 ) composed of: 122\n   technical, research, and panel sessions as well as a number of\n   keynote lectures and tutorials; all will be held simultaneously,\n   same location and dates: July 29 - August 1, 2019. Last year,\n   the Congress had attracted speakers/authors and participants\n   affiliated with over 169 different universities (including many\n   from the top 50 ranked institutions), major IT corporations\n   (including: Microsoft, Google, Apple, SAP, Facebook, Oracle, Amazon,\n   Yahoo, Samsung, IBM, Ebay, GE, Siemens, Philips, Ericsson, BAE\n   Systems, Hitachi, NTT, ...), major corporations (including: Exxon\n   Mobil, Johnson & Johnson, JPMorgan Chase, PetroChina, GlaxoSmithKline,\n   HSBC, Airbus, Boeing, Hyundai, ...), government research agencies\n   (NSF, NIH, DoE, US Air Force, NSA National Security Agency, ...), US\n   national laboratories (including, NASA, ANL, LLNL, Sandia, ORNL,\n   Lawrence Berkeley National Lab, Los Alamos National Lab, National\n   Cancer Institute, NIST, ...), and a number of Venture Capitalists as\n   well as distinguished speakers discussing Intellectual Property\n   issues. Last year, 55% of attendees were from academia, 24% from\n   industry; 20% from government and funding agencies; and 1% unknown.\n   About half of the attendees were from outside USA; from 72 nations.\n   The event is among the top five largest international annual gathering\n   of researchers in computer science, computer engineering and applied\n   computing. To get a feeling about the conferences' atmosphere, see\n   some delegates photos available at (over 2,000 photos):\n   http://photos.ucmss.com/ \n\n\nKEYNOTE LECTURES AND TUTORIALS:\n\n   There will be between 10 and 15 Keynote lectures and Invited Talks;\n   speakers include world-renowned scientists and educators. Featured\n   Keynote Speakers in recent years have included:\n\n   - Prof. David A. Patterson (pioneer, architecture, UC Berkeley)\n   - Prof. Ian Foster (known as Father of Grid Computing; U. of Chicago & ANL)\n   - The Late Prof. John H. Holland (known as Father of Genetic Algorithms;\n     U. of Michigan)\n   - Prof. Barry Vercoe (Founding member of MIT Media Lab, MIT)\n   - Prof. John Koza (known as Father of Genetic Programming; Stanford U.)\n   - Prof. Lotfi A. Zadeh (Father of Fuzzy Logic, UC Berkeley)\n   - Dr. Firouz Naderi (former Head of NASA Mars Exploration Program;\n     former Administrator and/or Director of Jet Propulsion Lab,\n     CalTech/NASA; NASA's JPL Solar System Exploration\n   - Dr. K. Eric Drexler (known as Father of Nanotechnology)\n   - Prof. Ruzena Bajcsy (pioneer, VR, UC Berkeley)\n   - Prof. Viktor K. Prasanna (pioneer, U. of Southern California)\n   - Dr. Jose L. Munoz (NSF Program Director and CTO of NSF Office of\n     Cyberinfrastructure)\n   - Prof. David Lorge Parnas (pioneer of software engineering)\n   - Prof. Eugene H. Spafford (Executive Director, CERIAS and Professor,\n     Purdue University)\n   - Prof. Haym Hirsh (Dean, Cornell University & former NSF admin)\n   - Prof. Alfred Inselberg (Tel Aviv U, Israel; Senior Fellow, San Diego\n     Supercomputing Center; Inventor of the multidimensional system of\n     Parallel Coordinates and author of textbook)\n   - Prof. H. J. Siegel (Abell Endowed Chair Distinguished Professor of ECE\n     and Professor of CS; Director, CSU Information Science and Technology\n     Center (ISTeC), Colorado State University, Colorado, USA)\n   - Prof. Amit Sheth (LexisNexis Eminent Scholar; Founder/Executive Director,\n     Ohio Center of Excellence in Knowledge-enabled Computing (Kno.e.sis))\n   - Dr. Leonid I. Perlovsky (Harvard University and CEO LP Information Tech)\n   - Dr. James A. Crowder (Chief Engineer, Raytheon Intelligence)\n   - Prof. Diego Galar (Director & Pro-Vice-Chancellor, Lulea University of\n     Technology, Sweden)\n   - Prof. Michael J. Flynn (Stanford U.; known for Flynn's taxonomy)\n   - and over 190 other distinguished speakers.\n\n\nINVITATION:\n\n   You are invited to submit a \"LATE BREAKING PAPER\", \"POSITION PAPER\", or\n   \"ABSTRACT/POSTER PAPER\" for consideration. All accepted papers will be\n   published in printed conference books/proceedings (with unique\n   international ISBN number) and will also be made available online. The\n   proceedings will be imprinted by the American Council on Science and\n   Education, and distributed/published by CSREA (Computer Science Research,\n   Education, and Applications Press). The books will be processed for\n   indexation in science databases, including EBSCO (www.ebsco.com), one\n   of the largest subject index systems, and all other EBSCO affiliated\n   science indexation databases. ACM Digital Library is also including the\n   titles into its databases as well as ProQuest indexing databases and\n   others. In addition, like prior years, extended versions of selected\n   papers (about 40%) of the conference will appear in journals and edited\n   research books; publishers include, Springer, Elsevier, BMC, and others.\n   Each book in each series will be subject to Elsevier and Springer\n   science indexing products (which includes: Scopus, www.info.scopus.com;\n   SCI Compendex, Engineering Village, www.ei.org; EMBASE, www.info.embase.com;\n   and others). See the web link below for a small subset of such\n   publications: (some of these books and journal special issues have\n   already received the top 25% downloads in their respective fields and/or\n   identified as \"Highly Accessed\" by publishers and/or science citation\n   index trackers.)\n\n   https://americancse.org/events/csce2019/books-journal-special-issues \n   https://americancse.org/events/csce2019/publication \n\nSUBMISSION OF PAPERS:\n\n   In response to this announcement, authors are given the opportunity to\n   submit their papers for evaluation in one of the following three paper\n   categories:\n\n   1. LATE BREAKING PAPERS: describe late-breaking/recent developments in\n      the field. The maximum number of pages is 7. Please write the\n      following on the first page of your submission \"name of conference:\n      LATE BREAKING PAPER\". If accepted, The length of the final/Camera-\n      Ready paper will be limited to 7 (two-column IEEE style) pages and\n      the author will be given the opportunity to present the paper in a\n      formal session.\n\n   2. POSITION PAPERS: enable discussions on emerging topics without the\n      experimentation normally present in an academic paper. Commonly,\n      such papers will substantiate the opinions or positions put forward\n      with evidence from an extensive objective discussion of the topic.\n      The maximum number of pages is 4. Please write the following on the\n      first page of your submission \"name of conference: POSITION PAPER\".\n      If accepted, The length of the final/Camera-Ready paper will be\n      limited to 4 (two-column IEEE style) pages and the author will be\n      given the opportunity to present the paper in a formal session.\n\n   3. ABSTRACT/POSTER PAPERS: describe research roadmaps (similar to PhD\n      plan or PhD prospectus). The maximum number of pages is 2. Please\n      write the following on the first page of your submission \"name of\n      conference: ABSTRACT/POSTER PAPER\". If accepted, The length of the\n      final/Camera-Ready paper will be limited to 2 (two-column IEEE\n      style) pages and the author will be given the opportunity to\n      present the paper in a discussion/poster session.\n\n   Prospective authors are invited to submit their papers by uploading\n   them to the evaluation web site at:  https://american-cse.org/ \n   Submissions must be uploaded by the due date (see IMPORTANT DATES) and\n   must be in either MS doc or pdf formats. All reasonable typesetting\n   formats are acceptable. Later, the authors of accepted papers will be\n   asked to follow a particular typesetting format to prepare their final\n   papers for publication which conform to the two-column IEEE style\n   format - see:\n   https://www.ieee.org/conferences_events/conferences/publishing/templates.html \n   The first page of the paper should include:\n\n   - Title of the paper\n   - Name, affiliation, postal address, and email address of each author\n     (identify the name of the Contact Author)\n   - Abstract (between 100 and 120 words)\n   - A maximum of 5 topical keywords that would best represent the work\n     described in the paper\n   - Write the type of the submission as \"LATE BREAKING PAPERS\",\n     \"POSITION PAPERS\", or \"ABSTRACT/POSTER PAPERS\".\n   - The actual text of the paper can start from the first page (space\n     permitting).\n   Submissions are to be uploaded to the submission/evaluation web site\n   portal at http://american-cse.org/ \n\n   Each paper will be peer-reviewed by at least two experts in the field\n   for originality, significance, clarity, impact, and soundness.\n\n\nIMPORTANT DATES:\n\n   June 20, 2019:   Submission of papers: https://american-cse.org/ \n                    - LATE BREAKING PAPERS (maximum of 7 pages);\n                    - POSITION PAPERS (maximum of 4 pages);\n                    - ABSTRACT/POSTER PAPERS (maximum of 2 pages)\n                    The sooner, a submission is received, the earlier,\n                    the status report (notification) will be sent out.\n\n   June 27, 2019:   Notification of acceptance (+/- two days)\n\n   July 07, 2019:   Registration due\n                    https://americancse.org/events/csce2019/registration \n\n   July 20, 2019:   Final Camera-Ready paper due\n                    The final papers should be uploaded to the publication\n                    portal - the url of Publication Portal appears in the\n                    notification of acceptance that such authors will receive.\n\n   July 29 - August 1, 2019:\n                    The 2019 World Congress in Computer Science, Computer\n                    Engineering, and Applied Computing (CSCE'19: USA);\n                    Including affiliated federated/joint conferences\n                    https://www.americancse.org/events/csce2019 \n\n\nLOCATION:\n   Luxor in Las Vegas (renovated)\n   https://www.luxor.com/en/entertainment.html \n\nCONTACT:\n   Questions and inquiries should be sent to:\n   CSCE'19 Conference Secretariat: cs@american-cse.org \n\nUnsubscribe Instructions:\n   To opt-out, please reply with \"unsubscribe\" & provide the email address\n   you wish to be excluded from the listserv.\n",
    "attachments": []
}