{
    "subject": "CFP: IEEE CPS: Conf on AI, Data Science, Social Networks, Smart Cities (Dec. 5-7, 2019, USA); Deadline: October 21",
    "from": "sc@world-comp.org",
    "to": "foaad@calpoly.edu",
    "cc": null,
    "bcc": null,
    "date": "Fri, 11 Oct 2019 01:58:16 -0400",
    "body": "\n                          CALL  FOR  PAPERS\n          Paper Submission (Extended Deadline): October 21, 2019\n               https://americancse.org/events/csci2019 \n\nCSCI-ISAI: International Symposium on ARTIFICIAL INTELLIGENCE\n           https://americancse.org/events/csci2019/Symposiums/csci_isai \n                                 +\nCSCI-ISBD: International Symposium on BIG DATA & DATA SCIENCE\n           https://americancse.org/events/csci2019/Symposiums/csci_isbd \n                                 +\nCSCI-ISNA: International Symposium on SOCIAL NETWORK ANALYSIS, SOCIAL\n           MEDIA, & MINING\n           https://americancse.org/events/csci2019/Symposiums/csci_isna \n                                 +\nCSCI-ISSC: International Symposium on SMART CITIES & SMART MOBILITY\n           https://americancse.org/events/csci2019/Symposiums/csci_issc \n\n\n                  December 5-7, 2019, Las Vegas, USA\n\n                          IEEE Xplore entry:\n   https://ieeexplore.ieee.org/xpl/conhome/1803739/all-proceedings \n\n\n\n\nAll accepted papers will be included in the proceedings of The 2019\nInternational Conference on Computational Science and Computational\nIntelligence (CSCI), to be published by IEEE CPS. The main objective\nof the CSCI Conference is to facilitate increased opportunities for\ncross-fertilization across research topics that overlap.\n\nPUBLISHER:\n\n   IEEE CPS: https://www.computer.org/conferences/cps \n\n   Past conference proceedings can be accessed via IEEE Xplore\n   Digital Library at (each year, indexation was finalized during\n   the month of October):\n   https://ieeexplore.ieee.org/xpl/conhome/1803739/all-proceedings \n\n   Since its inception, all CSCI proceedings have always been approved\n   and included into IEEE Xplore indexation/digital-library citation\n   index databases (including all papers of its symposiums.)\n\n\nINVITATION:\n\n   You are invited to submit a paper for consideration. All accepted\n   papers will be published by IEEE CPS in the proceedings of The\n   2019 International Conference on Computational Science and\n   Computational Intelligence (CSCI). Extended versions of selected\n   papers of the conference will also appear in journals and edited\n   research books (Springer, Elsevier, BMC, ...) The published\n   proceedings can be accessed via web portals, IEEE CPS, other\n   Digital libraries.\n\n   CSCI'19 International Conference is composed of a number of\n   symposiums, sessions, workshops, posters and panel discussions;\n   all will be held simultaneously, same location and dates:\n   December 5-7, 2019.\n\n\nSCOPE AND LIST OF TOPICS:\n\n   For a detailed topical scope for each research track, refer to\n   the web sites that appear at the begining of this announcement.\n\n\nINSTRUCTIONS FOR SUBMISSION OF PAPERS FOR EVALUATION:\n\n   Type of Submissions/Papers:\n   https://americancse.org/events/csci2019/paper_categories \n\n   Submission Instructions:\n   https://americancse.org/events/csci2019/paper_submission \n\n\nDEADLINES - DATES:\n\n   October 21, 2019:     EXTENDED deadline for Submission of Papers\n                         https://american-cse.org/ \n   October 28, 2019:     Notification of acceptance (+/- 2 days)\n   November 8, 2019:     Final papers & Author Registrations\n\n   December 5-7, 2019:   The 2019 International Conference on Computational\n                         Science and Computational Intelligence\n                         (CSCI'19: Las Vegas, USA)\n                         Including all its affiliated symposiums:\n                         https://americancse.org/events/csci2019 \n\n\nDEMOGRAPHY HISTORY (based on 2014 through 2019 participation data):\n\n   In the past, about 42% of the attendees have been from outside\n   USA; from 59 nations. 56% of registrants have been from academia,\n   32% from industry; 11% from government agencies and research labs;\n   and 1% unknown. The conference has had participants, speakers,\n   authors affiliated with over 154 different universities; including\n   many from the top 40 ranked institutions; major IT corporations,\n   including, Microsoft, Accenture, Google, Apple, Facebook, Oracle,\n   Amazon, Samsung Electronics, IBM, GE, BAE Systems, Hitachi, NTT,\n   Intel Corp, BTS Software Solutions, NetApp, Algorkorea Co.,\n   Paris Saclay, ElderSafe Technologies Inc., METRON (France),\n   Fraunhofer IKTS (Germany), Wipro Technologies, VNIIEF (Russia),\n   BTU Cottbus-Senftenberg (Germany), Synchrone Technologies (France),\n   Bosch Software Systems (Germany), Tata Consultancy Services, ...;\n   major corporations, including, Exxon Mobil, JPMorgan Chase,\n   Raytheon, PetroChina, GlaxoSmithKline, BCL Technologies, CERENA\n   Petroleum Group, Aerospace Electronic Technology (China), Max\n   Planck - Genetics (Germany), Tigard Research Institute, ENGIE\n   (France), Forschungszentrum Juelich (Germany), Secured Smart\n   Electric Vehicle (Korea), ...; government research agencies and\n   national laboratories, including, NSF, NIH National Institutes of\n   Health, US Air Force (multiple research labs), NSA National Security\n   Agency, Pacific Northwest National Lab, NASA, LLNL, Lawrence\n   Berkeley National Lab, Los Alamos National Lab, Cold Spring Harbor\n   Lab, US National Cancer Institute, Swedish Defence Research Agency,\n   NIST US National Institute of Standards and Technology, U.S.\n   Geological Survey, US National Library of Medicine, US Air Force\n   (multiple research labs), SPAWAR Systems Center Pacific, China NSF,\n   Russian Academy of Sciences, US Navy, Hasso Plattner Institute, US\n   Army, Korea Internet & Security Agency, Suez Canal Research Center,\n   Okinawa Bureau (Japan), Canadian Medical Protective Association,\n   Osong Medical Innovation Foundation (Korea), National Institute of\n   Informatics (Japan), ...; and three Venture Capitalists and nine\n   Intellectual Property attorneys.\n\n\nCONTACT:\n\n   Questions and inquiries should be sent to:\n   CSCI 2019 Conference Secretariat: cs@american-cse.org \n\nUnsubscribe Instructions:\n   To opt-out, please reply with \"unsubscribe\" & provide the email address\n   you wish to be excluded from the listserv.\n",
    "attachments": []
}