{
    "subject": "CFP: IEEE CPS: Conf on Cyber Warfare, Cyber Defense, & Cyber Security (CSCI-ISCW'19: Dec. 5-7, 2019, USA); Deadline: Nov 5",
    "from": "sc@world-comp.org",
    "to": "foaad@calpoly.edu",
    "cc": null,
    "bcc": null,
    "date": "Mon, 28 Oct 2019 13:55:01 -0400",
    "body": "\n                   CALL FOR LATE BREAKING PAPERS\n            Paper Submission Deadline: November 5, 2019\n\nInternational Symposium on Cyber Warfare, Cyber Defense, & Cyber Security\n\n          (CSCI-ISCW: December 5-7, 2019, Las Vegas, USA)\n    https://americancse.org/events/csci2019/Symposiums/csci_iscw \n\n                        IEEE Xplore entry\n  https://ieeexplore.ieee.org/xpl/conhome/1803739/all-proceedings \n\nAll accepted papers will be published in the proceedings of the 2019\nInternational Conference on Computational Science & Computational\nIntelligence ( CSCI: https://americancse.org/events/csci2019 ).\n\nSCOPE AND LIST OF TOPICS:\n\n   PROLOGUE:\n   Cyber Warfare adds an additional dimension to warfare. Generally, it\n   involves the battlespace use and targeting of computers and networks in\n   warfare. Cyber Warfare strategies include both offensive and defensive\n   operations pertaining to the threat of cyberattacks, espionage, sabotage,\n   disruptions to infrastructures, theft of critical information, and\n   publishing deliberate misinformation (fake news and fabricated news)\n   spread via traditional media and online social media with the intend to\n   mislead in order to disrupt the political processes of nations. The\n   methods and technologies utilized in Cyber Warfare can be countered\n   using Cyber Defense strategies. Cyber Defense strategies involve the\n   heavy and targeted use of Cyber Security. Topics of interest include:\n\n   - Cyber Warfare Technologies and Strategies\n   - Cyber Defense Technologies and Strategies\n   - Authorization Infrastructures\n   - Autonomous Security Methods\n   - Novel Biometric Methods\n   - Cloud Security\n   - Forensic Technologies\n   - Cryptography and Formal Methods\n   - Trapping Technologies\n   - Data Protection Methods\n   - Security and Reverse Engineering\n   - Vulnerability Analysis\n   - Steganography and Steganalysis\n   - Identity Management\n   - Security Policies\n   - Legislation and Regulatory Approaches for Enhancing Security\n   - Safe Computing\n   - Identification and Prevention of Online Scams\n   - Mobile Protection Techniques\n   - Security Risk Analysis, Management and Trade-offs\n   - Identity, Privacy and Trust Management\n   - Security by Design\n   - Incident Response Methods\n   - Cybercrime and Underground Economy - Identification and Prevention\n   - Detection of Malicious Software\n   - Novel Security Tools\n   - Lifecycle Security Management and Identification of the Weakest Links\n   - Internet Security\n   - Network Security\n   - Computer Security\n   - Prevention of Cyber Attacks on Critical Infrastructures\n   - Methodologies in Reducing National Vulnerability to Cyber Attacks\n   - Methods for Minimizing Damage and Recovery Time from Cyber Attacks\n   - Prevention of Fake and Fabricated News - Media Trust Management\n   - Cyber Warfare and Attack Prevention during Elections\n   - Secure Voting Systems\n   - Securing Electric Power Grids + Smart Grids\n   - Securing Communication Systems\n   - Cyber Counter-intelligence\n   - Tools in Cyber Warfare and Cyber Defense Arsenal\n   - Innovative Tools for Cyber Defense Technologies\n   - Cyber Weapons\n   - Cyber Space and Security\n   - Threats from Social Media\n   - Crime and Terrorism\n   - IT and Countering Violent Extremism\n   - Global Security\n   - Data Analytics and Cyber Warfare\n   - Prevention of Bad Data Injection\n   - Advanced Persistent Threat (APT) and Prevention\n   - Data Exfiltration\n   - Tools for Countering Attacks by Viruses, Worms, Malware, Phishing,\n     SQL Injection Attack, Cross-Site Scripting, Session Hijacking,\n     Trojan Horses, Rootkits, Botnets, ...\n   - Security and Social Engineering\n   - Tools for Countering Logic Bomb, Time Bomb, Distributed\n     Denial-of-Service Attack, ...\n   - Methodologies to Address System and Data Vulnerabilities\n   - Novel Patching Techniques\n   - Next Generation Firewalls\n   - Intrusion Detection Techniques\n   - Terrorism Databases and Resources\n   - Terrorist Networks\n   - Threat Assessment\n   - Cyber Vandalism and Defense\n   - Cyber Security and Terrorism\n   - Counter-terrorism\n   - Cyber Tools and Identification of Propaganda\n   - Security Education and Training\n\nPUBLISHER:\n\n   IEEE CPS: https://www.computer.org/conferences/cps \n   All accepted papers will be published in the proceedings of the 2019\n   International Conference on Computational Science & Computational\n   Intelligence ( CSCI: https://americancse.org/events/csci2019 ).\n   Since its inception, all CSCI proceedings have always been approved\n   and included into IEEE Xplore indexation/digital-library citation\n   index databases. Past conference proceedings can be accessed via\n   IEEE Xplore Digital Library at:\n   Volume I (2014):  https://ieeexplore.ieee.org/xpl/tocresult.jsp?isnumber=6822065 \n   Volume II (2014): https://ieeexplore.ieee.org/xpl/tocresult.jsp?isnumber=6822285 \n   Volume (2015):    https://ieeexplore.ieee.org/xpl/conhome/7420813/proceeding \n   Volume (2016):    https://ieeexplore.ieee.org/xpl/conhome/7879541/proceeding \n   Volume (2017):    https://ieeexplore.ieee.org/xpl/conhome/8554238/proceeding \n   Volune (2018):    Approved & Confirmed for indexation/publication in IEEE Xplore\n                     (will appear in IEEE Xplore in October/November, 2019)\n\n   Since the proceedings will be published soon after the conference\n   by IEEE CPS, we are quite FLEXIBLE with paper submission deadline.\n   WE HAVE A REVOLVING DEADLINE: ie, papers will be refereed within\n   48 hours from the date of submission using our fast-track evaluation\n   system (FTE) where referees receive a small honorarium pay for their\n   services.\n\nTYPE OF SUBMISSIONS/PAPERS (Late Breaking Papers):\n\n - Full/Regular Research Papers (maximum of 6 pages):\n   Regular Research Papers should provide detail original research\n   contributions. They must report new research results that represent\n   a contribution to the field; sufficient details and support for\n   the results and conclusions should also be provided. The work\n   presented in regular papers are expected to be at a stage of\n   maturity that with some additional work can be published as journal\n   papers.\n\n - Short Papers (maximum of 4 pages):\n   Short papers report on ongoing research projects. They should provide\n   overall research methodologies with some results. The work presented\n   in short papers are expected to be at a stage of maturity that with\n   some additional work can be published as regular papers.\n\n - Poster Papers (maximum of 2 pages):\n   Poster papers report on ongoing research projects that are still in\n   their infancy (i.e., at very early stages). Such papers tend to\n   provide research methodologies without yet concrete results.\n\nREVIEW PROCESS\n\n   Each paper will be peer-reviewed by 2 to 4 peers (except for papers that\n   are philosophical in nature - such papers would be considered for panel\n   discussions.) Confidentiality of submitted material will be maintained.\n   Papers will be evaluated on the basis of originality, impact, significance,\n   quality of research, quality of writing, and contribution to conference\n   program and diversity. Papers whose authors include one or more members\n   of the program committee will be evaluated using the double-blinded\n   review process. Authors whose papers are not selected for publication\n   can submit a rebuttal letter; rebuttals will be evaluated by 4 members\n   of the Program Committee.\n\n\nINSTRUCTIONS FOR SUBMISSION OF PAPERS FOR EVALUATION:\n\n   https://americancse.org/events/csci2019/paper_submission \n\n\nDEADLINES - DATES:\n\n   November 5, 2019:     Submission of Late Breaking Papers\n                         https://american-cse.org/ \n   November 7, 2019:     Notification of acceptance/rejection\n                         Two days after the date of submission but by\n                         no later than November 7, 2019\n   November 20, 2019:    Final papers & Author Registrations\n\n   December 5-7, 2019:   International Symposium on Cyber Warfare,\n                         Cyber Defense, & Cyber Security\n                         (CSCI-ISCW: December 5-7, 2019, USA)\n           https://americancse.org/events/csci2019/Symposiums/csci_iscw \n                         CSCI-ISCW will be held in conjunction with other\n                         affiliated research events; for more information,\n                         see https://americancse.org/events/csci2019 \n\n\nDEMOGRAPHY HISTORY (based on 2014 through 2019 participation data):\n\n   In the past, about 42% of the attendees have been from outside\n   USA; from 59 nations. 56% of registrants have been from academia,\n   32% from industry; 11% from government agencies and research labs;\n   and 1% unknown. The conference has had participants, speakers,\n   authors affiliated with over 154 different universities; including\n   many from the top 40 ranked institutions; major IT corporations,\n   including, Microsoft, Accenture, Google, Apple, Facebook, Oracle,\n   Amazon, Samsung Electronics, IBM, GE, BAE Systems, Hitachi, NTT,\n   Intel Corp, BTS Software Solutions, NetApp, Algorkorea Co.,\n   Paris Saclay, ElderSafe Technologies Inc., METRON (France),\n   Fraunhofer IKTS (Germany), Wipro Technologies, VNIIEF (Russia),\n   BTU Cottbus-Senftenberg (Germany), Synchrone Technologies (France),\n   Bosch Software Systems (Germany), Tata Consultancy Services, ...;\n   major corporations, including, Exxon Mobil, JPMorgan Chase,\n   Raytheon, PetroChina, GlaxoSmithKline, BCL Technologies, CERENA\n   Petroleum Group, Aerospace Electronic Technology (China), Max\n   Planck - Genetics (Germany), Tigard Research Institute, ENGIE\n   (France), Forschungszentrum Juelich (Germany), Secured Smart\n   Electric Vehicle (Korea), ...; government research agencies and\n   national laboratories, including, NSF, NIH National Institutes of\n   Health, US Air Force (multiple research labs), NSA National Security\n   Agency, Pacific Northwest National Lab, NASA, LLNL, Lawrence\n   Berkeley National Lab, Los Alamos National Lab, Cold Spring Harbor\n   Lab, US National Cancer Institute, Swedish Defence Research Agency,\n   NIST US National Institute of Standards and Technology, U.S.\n   Geological Survey, US National Library of Medicine, US Air Force\n   (multiple research labs), SPAWAR Systems Center Pacific, China NSF,\n   Russian Academy of Sciences, US Navy, Hasso Plattner Institute, US\n   Army, Korea Internet & Security Agency, Suez Canal Research Center,\n   Okinawa Bureau (Japan), Canadian Medical Protective Association,\n   Osong Medical Innovation Foundation (Korea), National Institute of\n   Informatics (Japan), ...; and three Venture Capitalists and nine\n   Intellectual Property attorneys.\n\nCONTACT:\n\n   Questions and inquiries should be sent to:\n   Conference Secretariat: cs@american-cse.org \n\nUnsubscribe Instructions:\n   To opt-out, please reply with \"unsubscribe\" & provide the email address\n   you wish to be excluded from the listserv.\n\n",
    "attachments": []
}