{
    "subject": "CFP: Int'l Conf. on Image Processing, Computer Vision, & Pattern Recognition (IPCV'15: July 27-30, 2015, Las Vegas, USA); Submission Deadline (Extended): April 15",
    "from": "Computer Vision <wcom@world-comp.org>",
    "to": "foaad@calpoly.edu",
    "cc": null,
    "bcc": null,
    "date": "Thu, 02 Apr 2015 03:32:58 -0400",
    "body": "\nSince the original deadline for submission of papers coincided with the Spring\nbreak of many US and Far East institutions, the Steering Committee decided to\nextend the deadlines in response to numerous requests. Those authors who met\nthe original deadlines, will receive the decision on their papers based on\nthe original dates; i.e., notifications will not be delayed for those authors.\nWe anticipate having between 1,800 and 2,000 participants in the federated\nevent that this conference is part of.\nThank you, Steering Committee\n++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++\n                         CALL  FOR  PAPERS\n\n        The 2015 International Conference on Image Processing,\n               Computer Vision, and Pattern Recognition\n                              IPCV'15\n\n         July 27-30, 2015, Monte Carlo Resort, Las Vegas, USA\nhttp://www.worldacademyofscience.org/worldcomp15/ws/conferences/ipcv15 \n\nPaper Submission Deadline (EXTENDED): April 15, 2015\n                                      11:59pm US Eastern Time zone (EDT)\n++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++\n\nLast year, the federated meeting that this conference is part of had\nattracted speakers/authors affiliated with over 180 different universities\n(including many from the top 50 ranked institutions), many major IT\ncorporations (including, Microsoft, Google, SAP, Oracle, Amazon, Yahoo,\nSamsung, IBM, Ebay, GE, Siemens, and others), government research agencies\n(NSF, NIH, DoE, AirForce, ...), and national laboratories (including,\nNASA, ANL, LLNL, Sandia, ORNL, Lawrence Berkeley National Lab, Los Alamos\nNational Lab, ...) This year, we also plan to have representatives of\nvarious Venture Capitalists as well as speakers discussing Intellectual\nProperty issues.\n\nThe conference is composed of a number of tracks, tutorials, sessions,\nworkshops, poster and panel discussions; all will be held simultaneously,\nsame location and dates: July 27-30, 2015.\n\nSCOPE: TOPICS OF INTEREST INCLUDE, BUT ARE NOT LIMITED TO, THE FOLLOWING:\n\n    Prologue: The broad area of Imaging Science is a field that is\n    mainly concerned with the generation, collection, analysis,\n    modification, and visualization of images. The field is multidisciplinary\n    in that it includes topics that are traditionally covered in computer\n    science, physics, mathematics, electrical engineering, AI, psychology\n    and information theory where computer science acts as the topical\n    bridge between all such diverse areas (for a formal definition of\n    Imaging Science, refer to relevant wiki pages.) From the computer\n    science perspective, the core of Imaging Science includes the following\n    three intertwined computer science fields, namely: Image Processing,\n    Computer Vision, and Pattern Recognition. This conference will cover\n    the research trends in these three important areas. The list of topics\n    of interest that appears below is not meant to be exhaustive.\n\no  IMAGE PROCESSING:\n   (Addresses ow-level processing as well as imaging fundamentals.)\n   - Software Tools for Imaging\n   - Image Generation, Acquisition, and Processing\n   - Image-based Modeling and Algorithms\n   - Mathematical Morphology\n   - Image Geometry and Multi-view Geometry\n   - 3D Imaging\n   - Novel Noise Reduction Algorithms\n   - Image Restoration\n   - Enhancement Techniques\n   - Segmentation Techniques\n   - Motion and Tracking Algorithms and Applications\n   - Watermarking Methods and Protection + Wavelet Methods\n   - Image Data Structures and Databases\n   - Image Compression, Coding, and Encryption\n   - Video Analysis\n   - Multi-resolution Imaging Techniques\n   - Performance Analysis and Evaluation\n   - Multimedia Systems and Applications\n   - Novel Image Processing Applications\n\no  COMPUTER VISION:\n   (Addresses mid- to high-level processing as well as vision\n   fundamentals.)\n   - Camera Networks and Vision\n   - Sensors and Early Vision\n   - Machine Learning Technologies for Vision\n   - Image Feature Extraction\n   - Cognitive and Biologically Inspired Vision\n   - Object Recognition\n   - Soft Computing Methods in Image Processing and Vision\n   - Stereo Vision\n   - Active and Robot Vision\n   - Face and Gesture Recognition\n   - Fuzzy and Neural Techniques in Vision\n   - Medical Image Processing and Analysis\n   - Novel Document Image Understanding Techniques\n   - Special-purpose Machine Architectures for Vision\n   - Biometric Authentication\n   - Novel Vision Application and Case Studies\n\no  PATTERN RECOGNITION:\n   (Addresses pattern recognition algorithms and methodologies\n   that are of value to the image processing and computer vision\n   research communities.)\n   - Supervised and Un-supervised Classification Algorithms\n   - Clustering Techniques\n   - Dimensionality Reduction Methods in Pattern Recognition\n   - Symbolic Learning\n   - Ensemble Learning Algorithms\n   - Parsing Algorithms\n   - Bayesian Methods in Pattern Recognition and Matching\n   - Statistical Pattern Recognition\n   - Invariance in Pattern Recognition\n   - Knowledge-based Recognition\n   - Structural and Syntactic Pattern Recognition\n   - Applications Including: Security, Medicine, Robotic, GIS,\n     Remote Sensing, Industrial Inspection, Nondestructive\n     Evaluation (or NDE), ...\n   - Case studies and Emerging technologies\n\n\nINVITATION:\n\nYou are invited to submit a paper for consideration. All accepted papers\nwill be published in printed conference books/proceedings (ISBN) and will\nalso be made available online. The proceedings will be indexed in science\ncitation databases that track citation frequency/data. In addition, like\nprior years, extended versions of selected papers (about 35%) of the\nconference will appear in journals and edited research books (publishers\ninclude: Springer, Elsevier, BMC, and others); some of these books and\njournal special issues have already received the top 25% downloads in\ntheir respective fields. See the link below for a very small subset of\nthe books published mostly based on extended versions of the accepted\npapers of this congress:\nhttp://www.worldacademyofscience.org/worldcomp15/ws/publications \nThe titles of proceedings of the federated congress have been indexed into\nthe ACM Digital Library ( http://dl.acm.org/ ) which includes bibliographic\ncitations from major publishers in computing.\n\n\nIMPORTANT DATES:\n\nApril 15, 2015:    Submission of full papers (about 7 pages)\n                   11:59pm US Eastern Time zone (EDT)\nApril 30, 2015:    Notification of acceptance (+/- two days)\nMay 15, 2015:      Final papers + Copyright + Registration\nJuly 27-30, 2015:  The 2015 International Conference on Image Processing,\n                   Computer Vision, and Pattern Recognition (IPCV'15)\n\n\nSUBMISSION OF DRAFT PAPERS FOR EVALUATION:\n\nProspective authors are invited to submit their papers by uploading them\nto the evaluation web site at:  http://world-comp.org . Submissions must\nbe uploaded by the due date (see IMPORTANT DATES) and must be in either\nMS doc or pdf formats (about 7 pages including all figures, tables, and\nreferences.) All reasonable typesetting formats are acceptable (later,\nthe authors of accepted papers will be asked to follow a particular\ntypesetting format to prepare their final papers for publication; these\nformatting instructions appear at: http://world-comp.org and they\nconform to the two-column IEEE style format). Papers must not have been\npreviously published or currently submitted for publication elsewhere.\nThe first page of the paper should include: title of the paper, name,\naffiliation, postal address, and email address for each author as well\nas a maximum of 5 topical keywords that would best represent the content\nof the paper. The first page should also identify the name of the\nContact/Corresponding author together with his/her professional email\naddress. A 100 to 150-word abstract should appear on the first page.\nAuthors are to conform to the common CODE OF ETHICS FOR AUTHORS (The\ndocument for the Code of Ethics is available on the submission web site.)\n\nEach paper will be peer-reviewed by two experts in the field for\noriginality, significance, clarity, impact, and soundness. In cases of\ncontradictory recommendations, a member of the conference program\ncommittee would be charged to make the final decision (accept/reject);\noften, this would involve seeking help from additional referees. Papers\nwhose authors include a member of the conference program committee will\nbe evaluated using the double-blinded review process. (Essay/philosophical\npapers will not be refereed but may be considered for discussion/panels).\n\nThe proceedings will be published in printed conference books (ISBN) and\nwill also be made available online. The printed proceedings/books will\nbe available for distribution on site at the conference. The proceedings\nwill be indexed in science citation databases that track citation\nfrequency/data. The proceedings/books of the federated congress that\nthis conference is part of have been evaluated for inclusion into major\nscience citation index databases. We are happy to report that so far,\nthe evaluation board of science citation index databases have approved\nthe indexing, integrating, and inclusion of the following conference\ntracks into relevant indexing databases (indexing databases include,\namong others: Scopus, Engineering Village, EMBASE, and others):\nBIOCOMP, DMIN, GCA, ICAI, ICOMP, ICWN, IKE, IPCV, PDPTA, and SAM. All\nproceedings are also approved for inclusion into EBSCO ( www.ebsco.com ),\none of the largest subject index systems. The titles of proceedings of the\nfederated congress have been indexed into the ACM Digital Library\n( http://dl.acm.org/ ) which includes bibliographic citations from major\npublishers in computing.\n\nIn addition to the above, we have arranged two new book series (multiple\nbooks in each series); one with Elsevier publishers (Emerging Trends in\nComputer Science and Applied Computing) and another with Springer\npublishers (Transactions of Computational Science and Computational\nIntelligence). After the conference (the process may take 12 to 18\nmonths), a significant number of authors of accepted papers of our\ncongress, will be given the opportunity to submit the extended version\nof their papers for publication consideration in these books. We\nanticipate having between 10 and 20 books a year in each of these\nbook series projects. Each book in each series will be subject to\nElsevier and Springer science indexing products (which includes:\nScopus, www.info.scopus.com ; SCI Compendex, Engineering Village,\nwww.ei.org ; EMBASE, www.info.embase.com ; and others). For a recent and\na very small subset of the books (and journal special issues) that have\nbeen published based on the extended versions of our congress papers,\nsee below:\n\nhttp://www.worldacademyofscience.org/worldcomp15/ws/books_journals \n\nSome of these books and journal special issues have already received\nthe top 25% downloads in their respective fields - we already have a\nnumber of Elsevier and Springer books in the pipeline.\n\nSUBMISSION OF POSTER PAPERS:\n\nPoster papers can be 2 pages long. Authors are to follow the same\ninstructions that appear in section SUBMISSION OF DRAFT PAPERS FOR\nEVALUATION - except that the submission is limited to 2 pages. On the\nfirst page, the author should state that \"This paper is being submitted\nas a poster\". Poster papers (if accepted) will be published as such, if\nand only if the author of the accepted poster wishes to do so.\n\n\nMEMBERS OF PROGRAM AND ORGANIZING COMMITTEES:\n\nCurrently being finalized. The members of the Steering Committee of the\nfederated congress that this conference is part of included:\nDr. Selim Aissi, (formerly: Chief Strategist - Security, Intel Corporation,\nUSA) Vice President, Global Information Security, Visa Inc., USA;\nProf. Nizar Al-Holou, Professor and Department Chair, and Vice Chair of\nIEEE/SEM-Computer Chapter, University of Detroit Mercy, Detroit, Michigan,\nUSA; Prof. Hamid R. Arabnia, Professor of Computer Science, Elected Fellow\nof ISIBM, Editor-in-Chief of Journal of Supercomputing (Springer),\nUniversity of Georgia, USA; Prof. Mary Mehrnoosh Eshaghian-Wilner,\nProfessor of Engineering Practice, University of Southern California,\nUSA (and Adjunct Professor, University of California Los Angeles, UCLA,\nUSA); Prof. Shiuh-Jeng Wang, Department of Information Management, Central\nPolice University, Taiwan and Program Chair, Security & Forensics, Taiwan\nand Director, Information Crypto and Construction Lab (ICCL) & ICCL-FROG;\nProf. Michael Panayiotis Bekakos, Professor of Computer Systems and\nDirector of Laboratory of Digital Systems and Head of Parallel Algorithms\nand architectures Research Group, Democritus University of Thrace, Greece;\nProf. Kevin Daimi, Professor of Computer Science and Director of Computer\nScience and Software Engineering Programs, University of Detroit Mercy,\nDetroit, Michigan, USA; Prof. Patrick S. P. Wang, Fellow of IAPR, ISIBM,\nWASE and Professor of Computer and Information Science, Northeastern\nUniversity, Boston, Massachusetts, USA and Otto-von-Guericke Distinguished\nGuest Professor, University Magdeburg, Germany; Prof. George Jandieri,\nGeorgian Technical University, Tbilisi, Georgia and Chief Scientist at\nThe Institute of Cybernetics, Georgian Academy of Science, Georgia;\nProf. D. V. Kodavade, Head of Computer Science and Engineering, DKTE\nInstitute, India; Prof. George Markowsky, Professor and Associate Director,\nSchool of Computing and Information Science, Chair Int'l Advisory Board\nof IEEE IDAACS, Director 2013 Northeast Collegiate Cyber Defense\nCompetition, University of Maine, Orono, Maine, USA; Prof. G. N. Pandey,\nVice-Chancellor, Arunachal University of Studies, India (and Adjunct\nProfessor, Indian Institute of Information Technology, India);\nProf. James J. (Jong Hyuk) Park, Professor of Computer Science and\nEngineering, Seoul, Korea and President of KITCS, President of FTRA,\nEditor-in-Chief of HCIS, JoC and IJITCC Journals; Prof. Fernando G.\nTinetti, Universidad Nacional de La Plata, Argentina, Co-editor, Journal\nof CS and Technology (JCS&T); Dr. Predrag Tosic, Microsoft, Washington,\nUSA; Prof. Vladimir Volkov, The Bonch-Bruevich State University of\nTelecommunications, Saint-Petersburg, Russia; Dr. Michael R. Grimaila,\nAir Force Institute of Technology, Fellow of ISSA, CISM, CISSP, IAM/IEM,\nAir Force Center of Cyberspace Research, Advisor to the Prince of Wales\nFellows & Prince Edward Fellows at MIT and Harvard Universities and PC\nmember of NATO Cooperative Cyber Defence Centre of Excellence (CCD COE);\nProf. Victor Malyshkin, Head of Supercomputer Software Department,\nRussian Academy of Sciences, Russia; Prof. Andy Marsh, Director of HoIP,\nDirector of HoIP Telecom, UK, and Secretary-General of WABT and\nVice-president of ICET, Visiting Professor, University of Westminster,\nUK; Ashu M. G. Solo, Fellow of British Computer Society, Principal R&D\nEngineer, Maverick Technologies America; Prof. Sang C. Suh, Head and\nProfessor of Computer Science, Vice President, of Society for Design\nand Process Science (SDPS), Director of Intelligent Cyberspace\nEngineering (ICEL), Texas A&M University, Com., Texas, USA; Prof. Layne\nT. Watson, IEEE Fellow, NIA Fellow, ISIBM Fellow, Fellow of The National\nInstitute of Aerospace, Virginia Polytechnic Institute & State University,\nVirginia, USA; Prof. Mary Q. Yang, Director, Mid-South Bioinformatics\nCenter and Joint Bioinformatics Ph.D. Program, University of Arkansas,\nUSA; Prof. Byung-Gyu Kim, Multimedia Processing Communications Lab.(MPCL),\nSunMoon University, South Korea; Prof. Young-Sik Jeong, Editor-in-Chief\nof Journal of Information Processing Systems (JIPS), Dongguk University,\nSeoul, South Korea; and others.\n\nThe 2015 Program Committee for individual conferences are currently being\ncompiled. Many who have already joined the committees are renowned leaders,\nscholars, researchers, scientists and practitioners of the highest ranks;\nmany are directors of research labs., fellows of various societies, heads/\nchairs of departments, program directors of research funding agencies, as\nwell as deans and provosts.\n\n\nGENERAL INFORMATION:\n\nThe federated Congress ( http://www.world-academy-of-science.org/ ) that\nthis conference is part of is composed of research presentations, keynote\nlectures, invited presentations, tutorials, panel discussions, and poster\npresentations. In recent past, keynote/tutorial/panel speakers have included:\nProf. David A. Patterson (pioneer, architecture, U. of California,\nBerkeley), Dr. K. Eric Drexler (known as Father of Nanotechnology),\nProf. John H. Holland (known as Father of Genetic Algorithms; U. of\nMichigan), Prof. Ian Foster (known as Father of Grid Computing; U. of\nChicago & ANL), Prof. Ruzena Bajcsy (pioneer, VR, U. of California,\nBerkeley), Prof. Barry Vercoe (Founding member of MIT Media Lab, MIT),\nDr. Jim Gettys (known as X-man, developer of X Window System, xhost;\nOLPC), Prof. John Koza (known as Father of Genetic Programming, Stanford\nU.), Prof. Brian D. Athey (NIH Program Director, U. of Michigan),\nProf. Viktor K. Prasanna (pioneer, U. of Southern California), Dr. Jose\nL. Munoz (NSF Program Director and Consultant), Prof. Jun Liu (pioneer,\nBroad Institute of MIT & Harvard U.), Prof. Lotfi A. Zadeh (Father of\nFuzzy Logic), Dr. Firouz Naderi (Head, NASA Mars Exploration Program/\n2000-2005 and Associate Director, Project Formulation & Strategy, Jet\nPropulsion Lab, CalTech/NASA; Director, NASA's JPL Solar System\nExploration), Prof. David Lorge Parnas (Fellow of IEEE, ACM, RSC, CAE, GI;\nDr.h.c.: ETH Zurich, Prof. Emeritus, McMaster U. and U. of Limerick),\nProf. Eugene H. Spafford (Executive Director, CERIAS and Professor, Purdue\nUniversity), Dr. Sandeep Chatterjee (Vice President & Chief Technology\nOfficer, SourceTrace Systems, Inc.), Prof. Haym Hirsh (Dean, Cornell\nUniversity - formerly at Rutgers University, New Jersey, USA and former\ndirector of Division of Information and Intelligent Systems, National\nScience Foundation, USA), Dr. Flavio Villanustre (Vice-President, HPCC\nSystems), Prof. Victor Raskin (Distinguished Professor, Purdue University,\nUSA); Prof. Alfred Inselberg (School of Mathematical Sciences, Tel Aviv\nUniversity, Israel; Senior Fellow, San Diego Supercomputing Center;\nInventor of the multidimensional system of Parallel Coordinates and\nauthor of textbook); Prof. H. J. Siegel (Abell Endowed Chair Distinguished\nProfessor of ECE and Professor of CS; Director, CSU Information Science\nand Technology Center (ISTeC), Colorado State University, Colorado, USA);\nProf. Amit Sheth (Fellow of IEEE and LexisNexis Eminent Scholar;\nFounder/Executive Director, Ohio Center of Excellence in Knowledge-enabled\nComputing (Kno.e.sis) and Professor of Computer Science, Wright State\nUniversity, Ohio, USA); Dr. Leonid I. Perlovsky (Harvard University,\nCambridge, Massachusetts, USA and School of Engineering and Applied\nSciences and Medical School Athinoula Martinos Brain Imaging Center; and\nThe US Air Force Research Lab., USA; CEO, LP Information Technology, USA\nand Chair of IEEE Task Force on The Mind and Brain; Recipient of John\nMcLucas Award, the highest US Air Force Award for basic research);\nand many other distinguished speakers. The Congress is among the top five\nlargest annual gathering of researchers in computer science, computer\nengineering and applied computing. We anticipate to have attendees from\nabout 85 countries/territories. To get a feeling about the conferences'\natmosphere, see some delegates photos available at:\n\nhttp://worldcomp.phanfare.com/ \nhttp://worldcomp.phanfare.com/6626396 (to see a slide show, click on\n\"Start SlideShow\" tab at the url above.)\n\nAn important mission of The Congress is \"Providing a unique platform for\na diverse community of constituents composed of scholars, researchers,\ndevelopers, educators, and practitioners. The Congress makes concerted\neffort to reach out to participants affiliated with diverse entities\n(such as: universities, institutions, corporations, government agencies,\nand research centers/labs) from all over the world. The congress also\nattempts to connect participants from institutions that have teaching as\ntheir main mission with those who are affiliated with institutions that\nhave research as their main mission. The congress uses a quota system to\nachieve its institution and geography diversity objectives.\"\n\nOne main goal of the congress is to assemble a spectrum of affiliated\nresearch conferences, workshops, and symposiums into a coordinated\nresearch meeting held in a common place at a common time. This model\nfacilitates communication among researchers in different fields of computer\nscience, computer engineering, and applied computing. The Congress also\nencourages multi-disciplinary and inter-disciplinary research initiatives;\ni.e., facilitating increased opportunities for cross-fertilization across\nsub-disciplines. 138939\n\n\nMEASURABLE SCIENTIFIC IMPACT OF CONGRESS:\n\nAs of December 14, 2014, proceedings of the federated congress that this\nconference is part of, have received over 27,914 citations (includes 3,346\nself-citations). Citation data is obtained from Microsoft Academic Search.\nThe citation data does not even include more than 15,000 other citations\nto papers published by conferences whose first offerings were initiated\nby the congress. Individual proceedings/books (2013 & 2014) of the\nfederated congress can be purchased from major science book distributors:\n(such as: EBSCO and others):\nhttp://www.worldacademyofscience.org/worldcomp14/ws/proceedings \nhttp://www.worldacademyofscience.org/worldcomp13/ws/proceedings \n\nMISCELLANEOUS:\nThe information that appears in this announcement is correct as of\nJanuary 1, 2015.\n\nCONTACT:\nInquiries should be sent to: sc@world-comp.org\n\n=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=\n\nThis email was sent to:  foaad@calpoly.edu \n\nTo opt out of this email list: (Please allow up to 24 hours for any changes to be reflected) \nhttp://world-comp.org/cgi-bin/rm/full.cgi?08696a75-4b61-49a8-bc69-dce167aa057d \n\n",
    "attachments": []
}