{
    "subject": "CFP: Special Issue on Energy-Aware Resource Management and Scheduling in SUSCOM journal",
    "from": "Worldcomp Conferences <wcom@world-comp.org>",
    "to": "foaad@calpoly.edu",
    "cc": null,
    "bcc": null,
    "date": "Wed, 22 Jan 2014 16:27:26 -0500",
    "body": "\nManuscript Due Date Extended to March 1, 2014, for the Special Issue on\nEnergy-Aware Resource Management and Scheduling (EARMS) in the Elsevier\njournal Sustainable Computing: Informatics and Systems (SUSCOM).\n\nCALL FOR PAPERS - Special Issue of Sustainable Computing: Informatics and\nSystems (SUSCOM) on Energy-Aware Resource Management and Scheduling (EARMS).\n\nScope: The growing scale of High Performance Computing (HPC) systems and\ndata centers has made issues related to power consumption, air conditioning,\nand cooling infrastructures critical concerns in terms of efficiency,\noperational cost, reliability, energy conservation, and environmental impact.\nHigh-end HPC systems today consume several megawatts of power, enough to\npower small towns, and are, in fact, soon approaching the limits of the\npower available to them. Furthermore, the costs of powering these HPC systems\nruns into millions of dollars per year, and are increasing as these systems\ntarget sustained petascale and plan for exascale. Adding to the concerns\ndue to power and cooling requirements and associated costs, empirical data\nshow that every 10 degree Celsius increase in temperature results in a\ndoubling of the system failure rate, which reduces the reliability of these\nexpensive systems. At the same time, the increasing proliferation of\nvirtualization technologies and the consolidation of computing platforms for\ndata- and compute-intensive applications are providing new opportunities to\nuse advanced scheduling and resource management techniques for higher\nutilization and energy savings. As a result, resource management policies\nthat consider the tradeoffs between energy usage and performance, throughput,\nand other QoS requirements, have become important research challenges that\nmust be addressed.\nIn this special issue, we seek original work focused on addressing new\nresearch and development challenges, consisting of developing new scheduling\ntechniques and advanced resource management solutions in green computing\nfor HPC systems.\n\nSpecific topics include, but not limited to, the following:\n*              Energy-aware task scheduling heuristics\n*              Energy-aware resource management infrastructures\n*              Thermal-aware task scheduling heuristics\n*              Thermal-aware resource management infrastructures\n*              Energy and thermal-aware scheduling for fault-tolerance\n*              Enhanced performance, energy, and thermal models for energy-\n                 aware schedulers\n*              Resource management in power/energy constrained systems\n*              Energy efficiency and virtualization\n*              Energy, performance, quality of service, and other resource\n              tradeoffs\n*              Energy-aware scheduling for heterogeneous systems\n*              Energy-aware scheduling for parallel and distributed systems\n*              Energy-efficient scheduling of hardware accelerators (FPGAs,\n              GPUs, etc.)\n*              Energy-aware scheduling for different computing paradigms:\n              cluster, grid, cloud, and datacenters\n\nSubmission Details:\nGeneral information for submitting papers to SUSCOM can be found at\nhttp://ees.elsevier.com/suscom/ (please note the \"Guide for Authors\" link).\nSubmissions to this Special Issue (SI) should be made using Elsevier's\neditorial system at the journal website\n(http://ees.elsevier.com/suscom/ , under the \"submit paper\" link). Please\nmake sure to select the \"SI: En. Aware Sched.\" option for the type of the\npaper during the submission process. All submissions must be original and\nmay not be under review. A submission based on one or more papers that\nappeared elsewhere has to include major value-added extensions over what\nappeared previously (at least 30% new conceptual material). Authors are\nrequested to attach to the submitted paper such earlier articles and a\nsummary document explaining the enhancements made in the journal version.\nAll submitted papers will be peer reviewed using the normal standards of\nSUSCOM. By submitting a paper to this special issue, the authors agree to\nreview at least one paper within the time frame of the SI.\n\nImportant Dates:\n*              Title and keywords due date\n              (by email to EARMS@colostate.edu: February 15, 2014\n*              Manuscript due date\n              (on http://ees.elsevier.com/suscom/): March 01, 2014\n*              First decision notification: June 01, 2014\n*              Revised manuscript due date: July 01, 2014\n*              Final decision notification: August 01, 2014\n*              Tentative publication schedule: November 2014\n\nSpecial Issue Guest Editors:\n               Anne Benoit, ENS-Lyon, France\n               Ryan Friese, Colorado State University, U.S.A\n               H.J. Siegel, Colorado State University, U.S.A\n\nQuestions may be sent to EARMS@colostate.edu\n\n=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=\n\nThis email was sent to:  foaad@calpoly.edu \n\nTo opt out of this email list: \nhttp://world-comp.org/cgi-bin/rm/full.cgi?08696a75-4b61-49a8-bc69-dce167aa057d \n\n",
    "attachments": []
}