{
    "subject": "CFP: Springer LNAI, 15th International Conference on Artificial Intelligence and Soft Computing, June 12-16, 2016, Zakopane",
    "from": "icaisc <icaisc@kik.pcz.pl>",
    "to": "foaad@calpoly.edu",
    "cc": null,
    "bcc": null,
    "date": "Thu, 14 May 2015 01:24:42 +0200",
    "body": "The 15th International Conference on Artificial Intelligence and Soft \r\n\t\tComputing \n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n(Apologies if you receive multiple copies of this announcement) \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\r\n\tThe 15th International Conference on Artificial Intelligence and Soft \r\n\tComputing ICAISC 2016 will be held in Zakopane (situated in the High Tatra \r\n\tmountains), Poland on June 12-16, 2016 in \r\n\t\nHotel Mercure Kasprowy\n. With the \r\n\tadvent of big data analysis we are facing new challenges to make the \r\n\tinformation transparent and understandable. The conference will provide an \r\n\texcellent opportunity for scientists and engineers to present and discuss \r\n\tthe latest scientific results and methods on intelligent data analysis and \r\n\tmodelling. The technical program will cover all artificial intelligence and \r\n\tsoft computing methods such as neural networks, fuzzy systems or \r\n\tevolutionary computation applied to all fields of computer vision, speech \r\n\tprocessing, data mining, robotics, game theory, hardware implementations, \r\n\tdatabases etc.            \r\n\n\n\n\n\nPublication\n        The working language of the conference is \r\n\tEnglish. Only original, unpublished papers in the aforementioned fields are \r\n\tinvited. Authors should submit an electronic version of papers by the \r\n\tconference web page. The papers should be organized in accordance with a \r\n\tcommon scientific structure (abstract, state of the art in the field, \r\n\tintention, used methodology, obtained results and references). Papers will \r\n\tbe refereed by an international committee, and accepted on the basis of \r\n\ttheir scientific merit and relevance to the conference topics. After the \r\n\tnotification of acceptance, authors will be allowed to make a correction in \r\n\taccordance with the suggestions of the reviewers and submit final \r\n\tcamera-ready papers in Latex format only. The conference proceedings will be \r\n\tpublished by Springer in the Lecture Notes in Artificial Intelligence series \r\n\t(to be approved) and distributed among the participants during the \r\n\tconference. Accepted papers must be presented by author(s) personally to be \r\n\tpublished in the conference proceedings. \t\t \n\n\n\r\nPrevious conferences were honoured by talks of \r\ninternationally recognized speakers: Lotfi A. Zadeh, Hojjat Adeli, Rafal Angryk, Igor Aizenberg, Shun-ichi Amari, Daniel Amit, Piero P. Bonissone, Jim Bezdek, Zdzislaw Bubnicki, Andrzej Cichocki, Wlodzislaw Duch, Pablo A. Estevez, Jerzy Grzymala-Busse, Martin Hagan, Yoichi Hayashi, Akira Hirose, Kaoru Hirota, Hisao Ishibuchi, Er Meng Joo, Janusz Kacprzyk, Jim Keller, Laszlo T. Koczy, Adam Krzyzak, Soo-Young Lee, Derong Liu, Robert Marks, Evangelia Micheli-Tzanakou, Kaisa Miettinen, Henning Muller, Ngoc Thanh Nguyen, Erkki Oja, Witold Pedrycz, Marios M. Polycarpou, Jose C. Principe, Jagath C. Rajapakse, Sarunas Raudys, Enrique Ruspini, Jorg Siekmann, Roman S?owi?ski, Igor Spiridonov, Boris Stilman, Ponnuthurai Nagaratnam Suganthan, Ryszard Tadeusiewicz, Ah-Hwee Tan, Shiro Usui, Fei-Yue Wang, Jun Wang, Bogdan M. Wilamowski, Ronald Y. Yager, Syozo Yasui, Gary Yen and Jacek Zurada. \n\r\n\t\t\r\n\t\tWe invite internationally recognized experts to organize special sessions focused on novel and challenging topics. \n\n\n\n\n\n\n\n\nFor more info, please visit\r\n\t\nhttp://www.icaisc.eu/\n\n\n\n\n\n\nWe look forward to welcoming you in Zakopane! \n\n\n\r\n\t\tGeneral Conference Chair: Leszek Rutkowski \n\r\n\t\tSecretary: Rafal Scherer \n\r\n\t\tHonorary chairs\n\r\n\t\tLotfi Zadeh \n\r\n\t\tHojjat Adeli \n\r\n\t\tJacek Zurada \n\n\n\n\nCo-Chairs\n\r\n\t\tWlodzislaw Duch\n\r\n\t\tJanusz Kacprzyk \n\r\n\t\tJozef Korbicz \n\r\n\t\tRyszard Tadeusiewicz",
    "attachments": []
}