{
    "subject": "Call For Papers - Deadline: April 19 (CSC'14: July 21-24, 2014, Las Vegas, USA) - Int'l Conf. on Scientific Computing",
    "from": "Scientific Computing <wcom@world-comp.org>",
    "to": "foaad@calpoly.edu",
    "cc": null,
    "bcc": null,
    "date": "Wed, 09 Apr 2014 23:00:36 -0400",
    "body": "\n                          CALL  FOR  PAPERS\n\n         Paper Submission Deadline (EXTENDED): April 19, 2014\n\n                               CSC'14\n      The 2014 International Conference on Scientific Computing\n\n         July 21-24, 2014, Monte Carlo Resort, Las Vegas, USA\nhttp://www.worldacademyofscience.org/worldcomp14/ws/conferences/csc14 \n\nXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXX\n\nYou are invited to submit a paper for consideration. All accepted papers\nwill be published in printed conference books/proceedings (ISBN) and will\nalso be made available online. The proceedings will be indexed in science\ncitation databases that track citation frequency/data for each paper. In\naddition, like prior years, extended versions of selected papers (about\n35%) will appear in journals and edited research books (publishers include:\nSpringer, Elsevier, BMC, and others); some of these books and journal\nspecial issues have already received the top 25% downloads in their\nrespective fields. To get a feeling about the conferences' atmosphere, see\nsome delegates photos available at:\nhttp://worldcomp.phanfare.com/ \nhttp://infinitydempsey.smugmug.com/WorldComp \n\nCSC'14 is composed of a number of tracks, including: tutorials, sessions,\nworkshops, posters, and panel discussions. The conference will be held\nJuly 21-24, 2014, Las Vegas, USA.\n\nSCOPE: Topics of interest include, but are not limited to, the following:\n\no  Supercomputing and scientific computing\no  Inversion problems\no  Big Data and scientific computing\no  Monte Carlo methods\no  Mathematical software tools\no  Scientific visualization\no  Computational models\no  Computational fluid dynamics\no  Computational physics\no  Computational chemistry\no  Computational biology\no  Computational electromagnetics & computational electrodynamics\no  Cellular automata\no  Numerical methods and simulation\no  Molecular dynamics\no  Stochastic differential equations\no  Optimization and optimal control\no  Finite element methods\no  Software architectures for scientific computing\no  domain decomposition methods\no  Multi-level and Multi-grid methods\no  Atmospheric science\no  Integral equations\no  Operational research\no  Dynamical systems\no  Coupled problems\no  Nonsymmetric solvers\no  Nonlinear systems & eigenvalue solvers\no  Constraint programming\no  Numerical linear algebra\no  Approximation theory and methods\no  Mathematics and circuit simulation\no  Splines and wavelets and applications\no  Engineering problems and emerging applications\no  Applications of scientific computing in physics, mechanics,\n   chemistry, biology, environmental and hydrology problems,\n   production scheduling, automotive industry, ...\n\n\nIMPORTANT DATES:\n\nApril 19, 2014:    Submission of full/regular papers (about 7 pages)\nMay 10, 2014:      Notification of acceptance (+/- two days)\nMay 24, 2014:      Final papers + Copyright + Registration\nJuly 21-24, 2014:  The 2014 International Conference on Scientific Computing\n                   (CSC'14)\n\n\nSUBMISSION OF REGULAR PAPERS:\n\nProspective authors are invited to submit their papers by uploading them\nto the evaluation web site at:  http://world-comp.org . Submissions must\nbe uploaded by April 19, 2014 and must be in either MS doc or pdf\nformats (about 7 pages including all figures, tables, and references -\nsingle space, font size of 10 to 12). All reasonable typesetting formats\nare acceptable (later, the authors of accepted papers will be asked to\nfollow a particular typesetting format to prepare their final papers for\npublication.) Papers must not have been previously published or currently\nsubmitted for publication elsewhere. The first page of the paper should\ninclude: title of the paper, name, affiliation, postal address, and email\naddress for each author. The first page should also identify the name of\nthe Contact Author and a maximum of 5 topical keywords that would best\nrepresent the content of the paper. The name of the conference that the\npaper is being submitted for consideration (i.e., CSC) must also be\nstated on the first page of the paper as well as a 100 to 150-word\nabstract. The length of the final/Camera-Ready papers (if accepted) will\nbe limited to 7 (two-column IEEE style) pages.\n\nEach paper will be peer-reviewed by two experts in the field for\noriginality, significance, clarity, impact, and soundness. In cases of\ncontradictory recommendations, a member of the conference program\ncommittee would be charged to make the final decision (accept/reject);\noften, this would involve seeking help from additional referees. Papers\nwhose authors include a member of the conference program committee will\nbe evaluated using the double-blinded review process. (Essay/philosophical\npapers will not be refereed but may be considered for discussion/panels).\n\nThe CSC'14 proceedings will be published in printed conference books\n(ISBN) and will also be made available online. The printed proceedings/\nbooks will be available for distribution on site at the conference. The\nproceedings will be indexed in science citation databases that track\ncitation frequency/data for each published paper. Science citation\ndatabases include: Inspec / IET / The Institute for Engineering &\nTechnology; The French National Center for Scientific Research, CNRS,\nINIST databases, PASCAL (accessable from INIST, Datastar, Dialog, EBSCO,\nOVID, Questel.Orbit, Qwam, & STN International); and others. Though,\nthere is no guarantee that the proceedings will also be included in\nSCI EI Compendex/Elsevier indexings; in the past, many of the proceedings\nof the federated congress that CSC is part of were included in these\ndatabases. Therefore, we will also be sending the proceedings for\nindexing procedures to SCI EI Compendex/Elsevier.\n\nIn addition to the above, we have arranged two new book series (multiple\nbooks in each series); one with Elsevier publishers (Emerging Trends in\nComputer Science and Applied Computing) and another with Springer publishers\n(Transactions of Computational Science and Computational Intelligence).\nAfter the conference (the whole process takes 12 months), a significant\nnumber of authors of accepted papers of CSC, will be given the\nopportunity to submit the extended version of their papers for publication\nconsideration in these books. We anticipate having between 10 to 20 books\na year in each of these book series projects. Each book in each series\nwill be subject to Elsevier and Springer science indexing products (which\nincludes: Scopus, www.info.scopus.com; SCI Compendex, Engineering Village,\nwww.ei.org; EMBASE, www.info.embase.com; and others). See below for recent\nexamples of books/journals based on extended versions of accepted papers\nof the federated congress that CSC is part of:\n\nhttp://www.springer.com/life+sciences/bioinformatics/book/978-1-4419-7045-9\nhttp://www.springer.com/life+sciences/bioinformatics/book/978-1-4419-5912-6\nhttp://store.elsevier.com/Emerging-Trends-in-ICT-Security/isbn-9780124114746/\nhttp://www.biomedcentral.com/bmcmedgenomics/supplements/6/S1\nhttp://pubmedcentralcanada.ca/pmcc/articles/PMC3287490/\nhttp://pubmedcentralcanada.ca/pmcc/articles/PMC2709251/\nhttp://pubmedcentralcanada.ca/pmcc/articles/PMC2999338/\nhttp://www.biomedcentral.com/1471-2164/9/S1/I1\nhttp://www.springer.com/series/11769\nhttp://www.biomedcentral.com/1752-0509/5?issue=S3\n\n\nSUBMISSION OF POSTER PAPERS:\n\nPoster papers can be 2 pages long. Authors are to follow the same\ninstructions that appear above (see, SUBMISSION OF REGULAR PAPERS) except\nfor the submission is limited to 2 pages. On the first page, the author\nshould state that \"This paper is being submitted as a poster\". Poster\npapers (if accepted) will be published if and only the author of the\naccepted paper wishes to do so.\n\n\nMEMBERS OF PROGRAM AND ORGANIZING COMMITTEES:\n\nCurrently being finalized. The members of the Steering Committee of the last\nofferings of the congress that CSC was held jointly with, included:\nDr. Selim Aissi, (formerly: Chief Strategist - Security, Intel Corporation,\nUSA) Senior Business Leader & Chief Architect, Visa Corporation, USA;\nProf. Babak Akhgar, PhD, FBCS, CITP, Professor of Informatics, Co-Director\nof CENTRIC (Centre of Excellence in Terrorism, Resilience, Intelligence &\norganised Crime research), Sheffield Hallam University, Sheffield, UK;\nProf. Nizar Al-Holou, Professor and Chair, Vice Chair, IEEE/SEM-Computer\nChapter; University of Detroit Mercy, Detroit, Michigan, USA; Prof. Hamid R.\nArabnia, Professor of Computer Science, Elected Fellow of ISIBM,\nEditor-in-Chief of Journal of Supercomputing (Springer), University of\nGeorgia, USA; Prof. Kevin Daimi, Professor of Computer Science, Director of\nComputer Science and Software Engineering Programs, University of Detroit\nMercy, Detroit, Michigan, USA; Prof. George Jandieri, Georgian Technical\nUniversity, Tbilisi, Georgia and Chief Scientist at The Institute of\nCybernetics, Georgian Academy of Science, Georgia; Prof. D. V. Kodavade, Head\nof Computer Science and Engineering, DKTE Institute, India; Prof. Kun Chang\nLee, Professor of MIS and WCU Professor of Creativity Science, Sungkyunkwan\nUniversity, Korea; Prof. George Markowsky, Professor and Associate Director,\nSchool of Computing and Information Science, Chair Int'l Advisory Board of\nIEEE IDAACS, Director 2013 Northeast Collegiate Cyber Defense Competition,\nUniversity of Maine, Orono, Maine, USA; Prof. G.N. Pandey, Vice-Chancellor,\nArunachal University of Studies, India; Prof. James J. (Jong Hyuk) Park,\nProfessor of Computer Science and Engineering, Seoul, Korea and President of\nKITCS, President of FTRA, Editor-in-Chiefs: HCIS, JoC and IJITCC Journals;\nProf. Fernando G. Tinetti, Universidad Nacional de La Plata, Argentina,\nCo-editor, Journal of CS and Technology (JCS&T); Dr. Predrag Tosic, Microsoft,\nWashington, USA; Prof. Vladimir Volkov, The Bonch-Bruevich State University of\nTelecommunications, Saint-Petersburg, Russia; Dr. Michael R. Grimaila, Air\nForce Institute of Technology, Fellow of ISSA, CISM, CISSP, IAM/IEM, Air Force\nCenter of Cyberspace Research, Advisor to the Prince of Wales Fellows & Prince\nEdward Fellows at MIT and Harvard Universities and PC member of NATO\nCooperative Cyber Defence Centre of Excellence (CCD COE); Prof. Victor\nMalyshkin, Head of Supercomputer Software Department, Russian Academy of\nSciences, Russia; Prof. Andy Marsh, Director of HoIP, Director of HoIP\nTelecom, UK, Secretary-General of WABT, Vice-president of ICET, Visiting\nProfessor, University of Westminster, UK; Ashu M. G. Solo (Publicity Chair),\nFellow of British Computer Society, Principal R&D Engineer, Maverick\nTechnologies America; Prof. Sang C. Suh, Head and Professor of Computer\nScience, Vice President, of Society for Design and Process Science (SDPS),\nDirector of Intelligent Cyberspace Engineering (ICEL), Texas A&M University,\nCom., Texas, USA; Prof. Layne T. Watson, IEEE Fellow, NIA Fellow, ISIBM Fellow,\nFellow of The National Institute of Aerospace, Virginia Polytechnic Institute &\nState University, Virginia, USA; and others.\n\nThe 2014 Program Committee for CSC is currently being compiled. Many who\nhave already joined the committee are renowned leaders, scholars, researchers,\nscientists and practitioners of the highest ranks.\n\nProgram Committee members are expected to have established a strong and\ndocumented research track record. Those interested in joining the Program\nCommittee should email editor@world-comp.org  the following information\nfor consideration: Name, affiliation and position, complete mailing address,\nemail address, a one-page biography that includes research expertise & the\nname of the conference (i.e., CSC).\n\n\nGENERAL INFORMATION:\n\nCSC is an international conference that serves researchers, scholars,\nprofessionals, students, and academicians who are looking to both foster\nworking relationships and gain access to the latest research results. It is\nbeing held jointly (same location and dates) with a number of other research\nconferences; namely, The 2014 World Congress in Computer Science, Computer\nEngineering, and Applied Computing. The Congress is among the top five\nlargest annual gathering of researchers in computer science, computer\nengineering and applied computing. We anticipate to have attendees from\nabout 85 countries/territories.\n\nThe 2014 Congress will be composed of research presentations, keynote lectures,\ninvited presentations, tutorials, panel discussions, and poster\npresentations. In recent past, keynote/tutorial/panel speakers have\nincluded: Prof. David A. Patterson (pioneer, architecture, U. of California,\nBerkeley), Dr. K. Eric Drexler (known as Father of Nanotechnology),\nProf. John H. Holland (known as Father of Genetic Algorithms; U. of\nMichigan), Prof. Ian Foster (known as Father of Grid Computing; U. of\nChicago & ANL), Prof. Ruzena Bajcsy (pioneer, VR, U. of California,\nBerkeley), Prof. Barry Vercoe (Founding member of MIT Media Lab, MIT),\nDr. Jim Gettys (known as X-man, developer of X Window System, xhost;\nOLPC), Prof. John Koza (known as Father of Genetic Programming, Stanford\nU.), Prof. Brian D. Athey (NIH Program Director, U. of Michigan),\nProf. Viktor K. Prasanna (pioneer, U. of Southern California), Dr. Jose\nL. Munoz (NSF Program Director and Consultant), Prof. Jun Liu (pioneer,\nBroad Institute of MIT & Harvard U.), Prof. Lotfi A. Zadeh (Father of\nFuzzy Logic), Dr. Firouz Naderi (Head, NASA Mars Exploration Program/\n2000-2005 and Associate Director, Project Formulation & Strategy, Jet\nPropulsion Lab, CalTech/NASA; Director, NASA's JPL Solar System\nExploration), Prof. David Lorge Parnas (Fellow of IEEE, ACM, RSC, CAE, GI;\nDr.h.c.: ETH Zurich, Prof. Emeritus, McMaster U. and U. of Limerick),\nProf. Eugene H. Spafford (Executive Director, CERIAS and Professor, Purdue\nUniversity), Dr. Sandeep Chatterjee (Vice President & Chief Technology\nOfficer, SourceTrace Systems, Inc.), Prof. Haym Hirsh (Dean, Cornell\nUniversity - formerly at Rutgers University, New Jersey, USA and former\ndirector of Division of Information and Intelligent Systems, National\nScience Foundation, USA), Dr. Flavio Villanustre (Vice-President, HPCC\nSystems), Prof. Victor Raskin (Distinguished Professor, Purdue University,\nUSA); Prof. Alfred Inselberg (School of Mathematical Sciences, Tel Aviv\nUniversity, Israel; Senior Fellow, San Diego Supercomputing Center;\nInventor of the multidimensional system of Parallel Coordinates and\nauthor of textbook); Prof. H. J. Siegel (Abell Endowed Chair Distinguished\nProfessor of ECE and Professor of CS; Director, CSU Information Science\nand Technology Center (ISTeC), Colorado State University, Colorado, USA);\nand many other distinguished speakers. To get a feeling about the\nconferences' atmosphere, see some delegates photos available at:\nhttp://infinitydempsey.smugmug.com/WorldComp\nhttp://worldcomp.phanfare.com/\n\nWe plan to have 12 tutorials in addition to author presentations and keynote\ntalks. Tutorial attendance and participations are free to all registered\nattendees. As of the writing of this announcement, we have received tutorial\nproposals from distinguished speakers in the following areas (12 of them\nwill be accepted) -\n\nO. Accreditation (ABET, ...) (multiple proposals received)\nO. Power-aware systems and efficient consumption issues for HPC\nO. Big Data and Data Analytics (multiple proposals received)\nO. Enterprise systems and entrepreneurial spirits and possibilities\nO. Cryptography and network security\nO. Service Oriented Architectures for Internet of Things\nO. Agent technologies\nO. Exploiting parallelism and scalability\nO. Actor Parallelism and Akka/Scala\nO. First Programming Language in CS Education - The Argument For Scala\nO. Big Data Analytics Cognitive Algorithms\nO. Hacking with Kali Linux\nO. Cloud computing\nO. Big Data in Cloud Computing\nO. Brain imaging and systems\nO. Data Center and related issues\nO. Cybersecurity tools and education\nO. Visualization and datamining in the context of Big Data\nO. Computational biology\n\nAn important mission of The Congress is \"Providing a unique platform for\na diverse community of constituents composed of scholars, researchers,\ndevelopers, educators, and practitioners. The Congress makes concerted\neffort to reach out to participants affiliated with diverse entities\n(such as: universities, institutions, corporations, government agencies,\nand research centers/labs) from all over the world. The congress also\nattempts to connect participants from institutions that have teaching as\ntheir main mission with those who are affiliated with institutions that\nhave research as their main mission. The congress uses a quota system to\nachieve its institution and geography diversity objectives.\"\n\nOne main goal of the congress is to assemble a spectrum of affiliated\nresearch conferences, workshops, and symposiums into a coordinated\nresearch meeting held in a common place at a common time. This model\nfacilitates communication among researchers in different fields of computer\nscience, computer engineering, and applied computing. The Congress also\nencourages multi-disciplinary and inter-disciplinary research initiatives;\nie, facilitating increased opportunities for cross-fertilization across\nsub-disciplines. 138939\n\nMEASURABLE SCIENTIFIC IMPACT OF CONGRESS:\n\nAs of December 14, 2013, papers published in the conference proceedings\nthat have been held as part of the federated Congress, have received over\n27,500 citations (includes about 3,300 self-citations). Citation data\nobtained from http://academic.research.microsoft.com/ . The citation data\ndoes not even include more than 15,000 other citations to papers in tracks\nwhose first offerings were initiated by this joint congress.\n\nMISCELLANEOUS:\nThe information that appears in this announcement is correct as of\nJanuary 29, 2014\n\nCONTACT:\n\nInquiries should be sent to: sc@world-comp.org\n\n=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=\n\nThis email was sent to:  foaad@calpoly.edu \n\nTo opt out of this email list: \nhttp://world-comp.org/cgi-bin/rm/full.cgi?08696a75-4b61-49a8-bc69-dce167aa057d \n\n",
    "attachments": []
}