{
    "subject": "Call For Papers - Deadline: April 19 (SAM'14: July 21-24, 2014, Las Vegas, USA) - Int'l Conf. on Security and Management",
    "from": "Security <wcom@world-comp.org>",
    "to": "foaad@calpoly.edu",
    "cc": null,
    "bcc": null,
    "date": "Thu, 20 Mar 2014 10:50:08 -0400",
    "body": "\n+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++\n\n                         CALL  FOR  PAPERS\n\n        Paper Submission Deadline (EXTENDED): April 19, 2014\n\n                               SAM'14\n                The 2014 International Conference on\n                       Security and Management\n\n                  July 21-24, 2014, Las Vegas, USA\n                    http://sam.udmercy.edu/sam14\n\nSubmissions should be uploaded to the following site:\nhttps://www.easychair.org/conferences/?conf=sam14 \n+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++\n\n-> (Since the original deadline for submission of papers coincided with the\n-> Spring break of many US and Far East institutions, the Steering Committee\n-> decided to extend the deadlines in response to numerous requests. Those\n-> authors who met the original deadlines, will receive the decision on\n-> their papers based on the original dates; i.e., notifications will not\n-> be delayed for those authors.)\n\nYou are invited to submit a full paper for consideration. All accepted\npapers will be published in printed conference books/proceedings (ISBN) and\nwill also be made available online. In addition, like prior years, extended\nversions of selected papers (about 35%) will appear in journals and edited\nresearch books (publishers include: Springer, Elsevier, BMC, and others).\nSee the following links for a small subset of the publications based on\naccepted papers in the federated congress that SAM is part of; some of\nthese books and journal special issues have already received the top 25%\ndownloads in their respective fields. To get a feeling about the\nconferences' atmosphere, see some delegates photos available at:\nhttp://worldcomp.phanfare.com/\nhttp://infinitydempsey.smugmug.com/WorldComp\n\n\nSAM'14 is composed of a number of tracks, including: tutorials, sessions,\nworkshops, posters, and panel discussions. The conference will be held July\n21-24, 2014, Las Vegas, USA.\n\nSCOPE: Topics of interest include, but are not limited to, the following:\n\nO  Network Security\n   -Security Algorithms\n   -Mobile Network Security\n   -Security in CDN (Contents Distribution Networks)\n   -Virtual Private Network (VPN)\n   -Tracing Techniques in Internet\n   -Active Networks\n   -Security in Grid\n   -Web Monitoring\n   -Network Security Engineering\n   -Transport-Level Security\n   -Wireless Network Security\n   -IP Security\n   -Electronic Mail security\n\nO  Cryptographic Technologies\n   -Security Protocols\n   -Key Management Techniques\n   -Cryptographic Technologies\n   -Applications of Block and Stream Ciphers\n   -Applications of Public Key Cryptology \n   -Message Authentication and Hash Functions\n   -Anonymity\n   -Digital Signature Schemes\n   -Secret Sharing\n   -Cryptanalysis\n\nO  Security Management\n   -Surveillance Technologies\n   -Security Policies\n   -Security for Protocol Management\n   -Location Management\n   -QoS Management\n   -Resource Management\n   -Channel Management\n   -Mobility Management\n   -Digital Contents Copyright Protection \n   -System Security Management\n   -Network Security Management\n   -Management in Network Equipment \n   -Storage Area Networks (SAN) Management\n   -Information Security Management\n   -Government Security Policy\n   -Web Penetration Testing\n   -Security Operations\n   -Vulnerabilities Management\n\nO  Security Education\n   -Computer Security Education\n   -Network Security Education\n   -Cyber Security Education \n   -Cyber Security Body of Knowledge\n   -Information Assurance Education        \n\nO  Information Assurance\n   -Mission Assurance\n   -Risk Assessment and Risk Management\n   -Continuity of Operations and Business Impact Analysis\n   -Cyber Security Compliance\n   -Security Auditing\n   -Security-Savvy Software Development\n   -Disaster Recovery\n   -Business Continuity Analysis\n   -Access Control\n   -Secure Use of Software\n   -Secure Performance       \n\nO  Biometrics and Forensics\n   -Novel Biometric Methods\n   -Forensics\n   -Biological Security Technologies\n   -Face Recognition Systems\n   -Signature Recognition Systems\n   -Cyber Forensics\n   -Forensic Analysis\n   -Biometric Technologies for Security\n   -Feature Extraction and Matching Algorithms\n\nO  Hardware Security\n   -Embedded Systems Security\n   -Cryptographic Processors and Co-Processors\n   -Security Architectures\n   -True and Pseudorandom Number Generators\n   -Side Channel Attacks\n   -Fault Attacks\n   -Hardware Tamper Resistance\n   -Smart Card Processors\n   -Secure Storage Devices\n\nO  Security Applications\n   -Security in E-Commerce and M-Commerce\n   -Secure OS\n   -Watermarking\n   -High-Tech Systems at Airports\n   -Emerging Technologies and Applications\n   -Cloud Computing Security\n   -Database Security\n   -Data Mining Security\n   -Cyber Security Automation\n\nO  Computer Security\n   -Firewall Systems\n   -Hacking Techniques and Related Issues\n   -Intrusion Detection System (IDS)\n   -Honeypot\n   -Virus Issues (Detection, Prevention ...)\n   -Trusted Computing\n   -Alert Correlation\n   -Attack Graphs\n   -Incident Responding\n   -Malware Analysis\n   -Incident Responding\n\n\nIMPORTANT DATES:\n\nApril 19, 2014:    Submission of full/regular papers (about 7 pages)\nMay 10, 2014:      Notification of acceptance (+/- two days)\nMay 24, 2014:      Final papers + Copyright + Registration\nJuly 21-24, 2014:  The 2014 International Conference on Security and\n                   Management (SAM'14)\n\n\nSUBMISSION OF REGULAR PAPERS:\n\nProspective authors are invited to submit their papers by uploading them\nto the evaluation web site at:  \n\nhttps://www.easychair.org/conferences/?conf=sam14\n\nSubmissions must be uploaded by April 19, 2014 and must be in pdf formats\n(about 7 pages including all figures, tables, and references - single\nspace, font size of 10 to 12). All reasonable typesetting formats are\nacceptable (later, the authors of accepted papers will be asked to follow\na particular typesetting format to prepare their final papers for\npublication.) Papers must not have been previously published or currently\nsubmitted for publication elsewhere. The first page of the paper should\ninclude: title of the paper, name, affiliation, postal address, and email\naddress for each author. The first page should also identify the name of\nthe Contact Author and a maximum of 5 topical keywords that would best\nrepresent the content of the paper. The track title must also be stated\non the first page of the paper as well as a 100 to 150-word abstract. The\nlength of the final/Camera-Ready papers (if accepted) will be limited to\n7 (two-column IEEE style) pages.\n\nEach paper will be peer-reviewed by two experts in the field for\noriginality, significance, clarity, impact, and soundness. In cases of\ncontradictory recommendations, a member of the conference program\ncommittee would be charged to make the final decision (accept/reject);\noften, this would involve seeking help from additional referees.\nPapers whose authors include a member of the conference program\ncommittee will be evaluated using the double-blinded review process.\n(Essay/philosophical papers will not be refereed but may be considered\nfor discussion/panels).\n\nThe proceedings will be published in printed conference books (ISBN) and\nwill also be made available online. The proceedings will be indexed in\nscience citation databases that track citation frequency/data for each\npublished paper. Science citation databases include: Elsevier indexing\nproducts (SCI Elsevier products include, among others: Scopus,\nwww.info.scopus.com; Engineering Village, www.ei.org; EMBASE,\nwww.info.embase.com; and others); Inspec / IET / The Institute for\nEngineering & Technology; The French National Center for Scientific\nResearch, CNRS, INIST databases, PASCAL (accessible from INIST, Datastar,\nDialog, EBSCO, OVID, Questel.Orbit, Qwam, and STN International); and\nothers.\n\nSUBMISSION OF POSTER PAPERS:\n\nPoster papers can be 2 pages long. Authors are to follow the same\ninstructions that appear above (see, SUBMISSION OF REGULAR PAPERS) except\nfor the submission is limited to 2 pages. On the first page, the author\nshould state that \"This paper is being submitted as a poster\". Poster papers\n(if accepted) will be published if and only the author of the accepted paper\nwishes to do so. Please email your poster papers to the poster co-chairs:\n\nHanen Idoudi,  Hanen.Idoudi@ensi.rnu.tn or\nEsmiralda Moradian,   esmirald@dsv.su.se\n \n\nMEMBERS OF STEERING COMMITTEE:\n\nCurrently being finalized. The members of the Steering Committee of The\nfederated joint Congress that SAM was (and will be) part of in recen\nyears, included: Dr. Selim Aissi, (formerly: Chief Strategist - Security,\nIntel Corporation, USA) Senior Business Leader & Chief Architect, Visa\nCorporation, USA; Prof. Babak Akhgar, PhD, FBCS, CITP, Professor of\nInformatics, Sheffield Hallam University, Sheffield, UK; Prof. Hamid R.\nArabnia, Professor of Computer Science, Elected Fellow of ISIBM,\nEditor-in-Chief of Journal of Supercomputing (Springer), University of\nGeorgia, USA; Prof. Kevin Daimi, Professor of Computer Science, Director\nof Computer Science and Software Engineering Programs, Department of\nMathematics, Computer Science and Software Engineering, University of\nDetroit Mercy, Detroit, Michigan, USA; Dr. Michael R. Grimaila, Associate\nProfessor, Air Force Institute of Technology, Systems Engineering, Fellow\nof ISSA, CISM, CISSP, IAM/IEM, Editorial Board of ISSA Journal, Air Force\nCenter of Cyberspace Research, Advisor to the Prince of Wales Fellows &\nPrince Edward Fellows at MIT and Harvard Universities and PC member of\nNATO Cooperative Cyber Defense Centre of Excellence (CCD COE); Prof. Kun\nChang Lee, Professor of MIS and WCU Professor of Creativity Science,\nBusiness School and Department of Interaction Science, Sungkyunkwan\nUniversity, Seoul, South Korea; Prof., Dr., Dr.h. Victor Malyshkin, Head\nof Supercomputer Software Department (SSD), Institute of Computational\nMathematics and Mathematical Geophysics, Russian Academy of Sciences,\nRussia; Prof. George Markowsky, Professor and Chair of Computer Science,\nAssociate Director of School of Computing and Information Science, Chair\nof International Advisory Board of IEEE IDAACS and Director 2013\nNortheast Collegiate Cyber Defense Competition, Chair Bangor Foreign\nPolicy Forum, Cooperating Professor of Mathematics & Statistics\nDepartment UMaine, Cooperating Professor of School of Policy &\nInternational Affairs UMaine, University of Maine, Orono, Maine, USA;\nProf. Andy Marsh, Director of HoIP, Director of HoIP Telecom, UK,\nSecretary-General of WABT, Vice-president of ICET, Visiting Professor,\nUniversity of Westminster, UK; Prof. James J. (Jong Hyuk) Park,\nProfessor of Computer Science and Engineering, Seoul National University\nof Science and Technology (SeoulTech), Korea, President of KITCS,\nPresident of FTRA, Editor-in-Chiefs of HCIS, JoC and IJITCC Journals; Ashu\nM. G. Solo (Publicity Chair), Fellow of British Computer Society,\nPrincipal R&D Engineer, Maverick Technologies America; Prof. Sang C. Suh,\nHead and Professor of Computer Science, Vice President, of Society for\nDesign and Process Science (SDPS), Director of Intelligent Cyberspace\nEngineering Lab (ICEL), Texas A&M University, Com., Texas, USA;\nProf. Layne T. Watson, IEEE Fellow, NIA Fellow, ISIBM Fellow, Fellow of\nThe National Institute of Aerospace, Virginia Polytechnic Institute &\nState University, Virginia, USA. The 2013 Program Committee for SAM\nconference is currently being compiled. Many who have already joined the\ncommittees are renowned leaders, scholars, researchers, scientists and\npractitioners of the highest ranks; many are directors of research labs.,\nfellows of various societies, heads/chairs of departments, program\ndirectors of research funding agencies, as well as deans and provosts.\nProgram Committee members are expected to have established a strong and\ndocumented research track record. Those interested in joining the Program\nCommittee should email Professor Daimi ( daimikj@udmercy.edu ) the\nfollowing information for consideration/evaluation: Name, affiliation and\nposition, complete mailing address, email address, a one-page biography\nthat includes research expertise, and details of two recent papers on\nsecurity.\n\n\nGENERAL INFORMATION:\n\nSAM is an international conference that serves researchers, scholars,\nprofessionals, students, and academicians who are looking to both foster\nworking relationships and gain access to the latest research results.\nIt is being held jointly (same location and dates) with a number of\nother research conferences; namely, The 2014 World Congress in Computer\nScience, Computer Engineering, and Applied Computing. The Congress is\none of the largest annual gathering of researchers in computer science,\ncomputer engineering and applied computing. We anticipate to have 2,100\nor more attendees from over 85 countries. The 2014 Congress will be\ncomposed of research presentations, keynote lectures, invited presentations,\ntutorials, panel discussions, and poster presentations. In recent past,\nkeynote/tutorial/panel speakers have included: Prof. David A. Patterson\n(pioneer, architecture, U. of California, Berkeley), Dr. K. Eric Drexler\n(known as Father of Nanotechnology), Prof. John H. Holland (known as\nFather of Genetic Algorithms; U. of Michigan), Prof. Ian Foster (known as\nFather of Grid Computing; U. of Chicago & ANL), Prof. Ruzena Bajcsy\n(pioneer, VR, U. of California, Berkeley), Prof. Barry Vercoe (Founding\nmember of MIT Media Lab, MIT), Dr. Jim Gettys (known as X-man, developer\nof X Window System, xhost; OLPC), Prof. John Koza (known as Father of\nGenetic Programming, Stanford U.), Prof. Brian D. Athey (NIH Program\nDirector, U. of Michigan), Prof. Viktor K. Prasanna (pioneer, U. of\nSouthern California), Dr. Jose L. Munoz (NSF Program Director and\nConsultant), Prof. Jun Liu (pioneer, Broad Institute of MIT & Harvard U.),\nProf. Lotfi A. Zadeh (Father of Fuzzy Logic), Dr. Firouz Naderi (Head,\nNASA Mars Exploration Program/2000-2005 and Associate Director, Project\nFormulation & Strategy, Jet Propulsion Lab, CalTech/NASA; Director, NASA's\nJPL Solar System Exploration), Prof. David Lorge Parnas (Fellow of IEEE,\nACM, RSC, CAE, GI; Dr.h.c.: ETH Zurich, Prof. Emeritus, McMaster U. and\nU. of Limerick), Prof. Eugene H. Spafford (Executive Director, CERIAS and\nProfessor, Purdue University), Dr. Sandeep Chatterjee (Vice President &\nChief Technology Officer, SourceTrace Systems, Inc.), Prof. Haym Hirsh\n(Rutgers University, New Jersey, USA and former director of Division of\nInformation and Intelligent Systems, National Science Foundation, USA;\ncurrently, Dean at Cornell University), Dr. Flavio Villanustre (Vice-\nPresident, HPCC Systems), and many other distinguished speakers. To get\na feeling about the conferences' atmosphere, see some delegates photos\navailable at:\nhttp://infinitydempsey.smugmug.com/WorldComp \nwww.pixagogo.com/1676934789 \nAn important mission of the Congress is \"Providing a unique platform for a\ndiverse community of constituents composed of scholars, researchers,\ndevelopers, educators, and practitioners. The Congress makes concerted\neffort to reach out to participants affiliated with diverse entities (such\nas: universities, institutions, corporations, government agencies, and\nresearch centers/labs) from all over the world. The Congress also attempts\nto connect participants from institutions that have teaching as their main\nmission with those who are affiliated with institutions that have research\nas their main mission. The Congress uses a quota system to achieve its\ninstitution and geography diversity objectives.\" 138939\nOne main goal of the Congress is to assemble a spectrum of affiliated\nresearch conferences, workshops, and symposiums into a coordinated\nresearch meeting held in a common place at a common time. This model\nfacilitates communication among researchers in different fields of\ncomputer science, computer engineering, and applied computing. The\nCongress also encourages multi-disciplinary and inter-disciplinary\nresearch initiatives; i.e., facilitating increased opportunities for\ncross-fertilization across sub-disciplines. Below, you will find a\nsmall subset of the books and journal special issues published based\non extended versions of accepted papers in the congress that SAM\nis part of:\n\nhttp://www.springer.com/life+sciences/bioinformatics/book/978-1-4419-7045-9\nhttp://www.springer.com/life+sciences/bioinformatics/book/978-1-4419-5912-6\nhttp://store.elsevier.com/Emerging-Trends-in-ICT-Security/isbn-9780124114746/\nhttp://www.biomedcentral.com/bmcmedgenomics/supplements/6/S1\nhttp://pubmedcentralcanada.ca/pmcc/articles/PMC3287490/\nhttp://pubmedcentralcanada.ca/pmcc/articles/PMC2709251/\nhttp://pubmedcentralcanada.ca/pmcc/articles/PMC2999338/\nhttp://www.biomedcentral.com/1471-2164/9/S1/I1\nhttp://www.springer.com/series/11769\nhttp://www.biomedcentral.com/1752-0509/5?issue=S3\n\n\nMEASURABLE SCIENTIFIC IMPACT OF CONGRESS:\n\nAs of December 14, 2013, papers published in the conference proceedings\nthat have been held as part of the federated congress, have received over\n27,500 citations (includes about 3,300 self-citations). Citation data\nobtained from http://academic.research.microsoft.com/ . The citation data\ndoes not even include more than 15,000 other citations to papers in\nconferences whose first offerings were initiated by the congress.\n\nMISCELLANEOUS:\nThe information that appears in this announcement is correct as of\nJanuary 29, 2014\n\nCONTACT:\nInquiries should be sent to:  daimikj@udmercy.edu \n\n=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=\n\nThis email was sent to:  foaad@calpoly.edu \n\nTo opt out of this email list: \nhttp://world-comp.org/cgi-bin/rm/full.cgi?08696a75-4b61-49a8-bc69-dce167aa057d \n\n",
    "attachments": []
}