{
    "subject": "Call For Papers: Deadline: June 5 - Int'l Conf. on Data Mining (July 21-24, 2014, USA)",
    "from": "Data Mining <wcom@world-comp.org>",
    "to": "foaad@calpoly.edu",
    "cc": null,
    "bcc": null,
    "date": "Thu, 29 May 2014 02:37:56 -0400",
    "body": "                          CALL  FOR  PAPERS\n\n    CALL FOR LATE BREAKING PAPERS, POSITION PAPERS, ABSTRACTS, POSTERS\n\n                   Submission Deadline: June 5, 2014\n\n                               DMIN'14\n           The 2014 International Conference on Data Mining\n\n                   July 21-24, 2014, Las Vegas, USA\n                     http://www.dmin-2014.com/\n\nSubmissions should be uploaded to the following site:\nhttp://dmin.confmaster.net/ \n+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++\n\nIMPORTANT NOTE:\nThis announcement is ONLY for those who MISSED the opportunity to submit their\npapers in response to earlier \"Call For Papers\". Therefore, authors who have\nalready submitted papers in response to earlier \"Call For Papers\" should\nIGNORE this announcement. (Those who have been notified that their papers have\nbeen accepted, MUST still follow the instructions that were emailed to them;\nincluding meeting the deadlines mentioned in the notifications that were sent\nto them).\n\nINVITATION:\nYou are invited to submit a \"Late Breaking Paper\", \"Position Paper\", or\n\"Abstract/Poster Paper\" for consideration. All accepted papers will be published\nin printed conference books/proceedings (ISBN) and will also be made available\nonline. Like prior years, extended versions of selected papers will appear in\njournals and edited research books (publishers include: Springer, Elsevier, BMC,\nand others). In addition to the above, we have arranged two new book series; one\nwith Elsevier publishers (Emerging Trends in Computer Science and Applied\nComputing) and another with Springer publishers (Transactions of Computational\nScience and Computational Intelligence). After the conference, a significant\nnumber of authors of accepted papers of our congress, will be given the\nopportunity to submit the extended version of their papers for publication\nconsideration in these books. Each book in each series will be subject to\nElsevier and Springer science indexing products (which includes: Scopus, Ei\nvillage, SCI, ...). To get a feeling about the conference's atmosphere, see\nsome delegates photos available at:\nhttp://worldcomp.phanfare.com/\nhttp://infinitydempsey.smugmug.com/WorldComp\n\nDMIN'14 is composed of a number of tracks, including: tutorials, sessions,\nworkshops, posters, and panel discussions. The conference will be held July\n21-24, 2014, Las Vegas, USA.\n\nSCOPE: Topics of interest include, but are not limited to, the following:\n\no  Data Mining Tasks\n   - Regression/Classification\n   - Time series forecasting\n   - Segmentation/Clustering/Association\n   - Deviation and outlier detection\n   - Explorative and visual data mining\n   - Web mining\n   - Mining text and semi-structured data\n   - Temporal and spatial data mining\n   - Multimedia mining (audio/video)\n   - Others\n\no  Data Mining Algorithms\n   - Artificial neural networks  \n   - Fuzzy logic and rough sets\n   - Decision trees/rule learners\n   - Support vector machines\n   - Evolutionary computation/meta heuristics\n   - Statistical methods\n   - Collaborative filtering\n   - Case based reasoning\n   - Link and sequence analysis\n   - Ensembles/committee approaches\n   - Others\n\no  Data Mining Integration\n   - Mining large scale data\n   - Distributed and grid based data mining\n   - Data and knowledge representation\n   - Data warehousing and OLAP integration\n   - Integration of prior/domain knowledge\n   - Metadata and ontologies\n   - Agent technologies for data mining\n   - Legal and social aspects of data mining\n\no  Data Mining Process\n   - Data cleaning and preparation\n   - Feature selection and transformation\n   - Attribute discretisation and encoding \n   - Sampling and rebalancing\n   - Missing value imputation\n   - Model selection/assessment and comparison\n   - Induction principles\n   - Model interpretation\n   - Others\n\no  Data Mining Applications\n   - Bioinformatics\n   - Medicine Data Mining\n   - Business/Corporate/Industrial Data Mining\n   - Credit Scoring\n   - Direct Marketing\n   - Database Marketing\n   - Engineering Mining\n   - Military Data Mining\n   - Security Data Mining\n   - Social Science Mining\n   - Data Mining in Logistics\n   - Others\n\nWe particularly encourage submissions of industrial applications and case studies\nfrom practitioners. These will not be evaluated using solely theoretical research\ncriteria, but will take general interest and presentation into consideration.\n\no  Data Mining Software\n   - All aspects and modules\n\no  Alternative and additional examples of possible topics include:\n   - Data Mining for Business Intelligence  \n   - Emerging technologies in data mining \n   - Computational performance issues in data mining \n   - Data mining in usability \n   - Advanced prediction modelling using data mining \n   - Data mining and national security  \n   - Data mining tools \n   - Data analysis \n   - Data preparation techniques (selection, transformation, and preprocessing)  \n   - Information extraction methodologies  \n   - Clustering algorithms used in data mining \n   - Genetic algorithms and categorization techniques used in data mining \n   - Data and information integration  \n   - Microarray design and analysis \n   - Privacy-preserving data mining \n   - Active data mining \n   - Statistical methods used in data mining \n   - Multidimensional data \n   - Case studies and prototypes \n   - Automatic data cleaning \n   - Data visualization  \n   - Theory and practice - knowledge representation and discovery \n   - Knowledge Discovery in Databases (KDD) \n   - Uncertainty management \n   - Data reduction methods \n   - Data engineering \n   - Content mining \n   - Indexing schemes \n   - Information retrieval \n   - Metadata use and management \n   - Multidimensional query languages and query optimization \n   - Multimedia information systems  \n   - Search engine query processing  \n   - Pattern mining \n   - Applications (examples: data mining in education, marketing, finance and\n     financial services, business applications, medicine, bioinformatics,\n     biological sciences, science and technology, industry and government, ...) \n\n\nDMIN'14 CONFERENCE CHAIR:\n\n   Dr. Robert Stahlbock\n   University of Hamburg, Germany\n   conference-chair@dmin-2014.com\n   (General Conference Chair)\n\n\nSUBMISSION OF LATE BREAKING PAPERS, POSITION PAPERS, ABSTRACTS/POSTERS:\n\nIn response to this announcement, authors are given the opportunity to submit\ntheir papers for evaluation in one of the following three categories:\n\n   1. Late Breaking Papers: describe late-breaking/recent developments in\n      the field. The maximum number of pages is 7. Please write the following\n      on the first page of your submission \"DMIN: LATE BREAKING PAPER\".\n      If accepted, The length of the final/Camera-Ready paper will be limited\n      to 7 (two-column IEEE style) pages and the author will be given the\n      opportunity to present the paper in a formal session.\n\n   2. Position Papers: enable discussions on emerging topics without the\n      experimentation normally present in an academic paper. Commonly,\n      such papers will substantiate the opinions or positions put forward\n      with evidence from an extensive objective discussion of the topic.\n      The maximum number of pages is 4. Please write the following on the\n      first page of your submission \"DMIN: POSITION PAPER\".\n      If accepted, The length of the final/Camera-Ready paper will be limited\n      to 4 (two-column IEEE style) pages and the author will be given the\n      opportunity to present the paper in a discussion/poster session.\n\n   3. Abstract/Poster Papers: describe research roadmaps (similar to PhD\n      plan or PhD prospectus). The maximum number of pages is 2. Please\n      write the following on the first page of your submission\n      \"DMIN: ABSTRACT/POSTER PAPER\".\n      If accepted, The length of the final/Camera-Ready paper will be limited\n      to 2 (two-column IEEE style) pages and the author will be given the\n      opportunity to present the paper in a discussion/poster session.\n\nProspective authors are invited to submit their papers (see above for paper\ncategories) by uploading them to the evaluation web site at:\nhttp://dmin.confmaster.net/ \n\nSubmissions must be uploaded by June 5, 2014 and must be in either\nMS doc or pdf formats (single space, font size of 10 to 12). All reasonable\ntypesetting formats are acceptable (later, the authors of accepted papers\nwill be asked to follow a particular typesetting format to prepare their\nfinal papers for publication.) Papers must not have been previously\npublished or currently submitted for publication elsewhere. The first\npage of the paper should include: title of the paper, name, affiliation,\npostal address, and email address for each author. The first page should\nalso identify the name of the Contact Author and a maximum of 5 topical\nkeywords that would best represent the content of the paper. The name\nof the conference that the paper is being submitted for consideration\n(i.e., DMIN) must also be stated on the first page of the paper as well\nas a 100 to 150-word abstract. The length of the final/Camera-Ready\npapers (if accepted) will be limited to 7 (two-column IEEE style) pages.\n\nPapers will be evaluated for originality, significance, clarity, and\nsoundness. Each paper will be refereed by two researchers in the topical\narea. To reflect upon feedback from last year we will extend the\nconstructive feedback given within the review. Please consult the pages\nfor the Review Process ( http://www.dmin-2014.com/DMIN2014/review.htm )\nfor additional Information.\n\nWe particularly encourage submissions of industrial applications and case\nstudies from practitioners. To reflect the requirements of an application\nor project centric case study presentation, these will be subject to\ndifferent review criteria. In particular, they will not be evaluated using\npredominantly theoretical research criteria of originality etc., but will\ntake general interest and presentation stronger into consideration.\n\nThe proceedings will be published in printed conference books (ISBN) and will\nalso be made available online. The proceedings will be indexed in science\ncitation databases that track citation frequency/data for each published\npaper. Science citation databases include: relevant Elsevier indexing\nproducts (SCI Elsevier products include, among others: Scopus,\nwww.info.scopus.com; Engineering Village, www.ei.org; EMBASE,\nwww.info.embase.com; and others); Inspec / IET / The Institute for\nEngineering & Technology; The French National Center for Scientific Research,\nCNRS, INIST databases, PASCAL (accessable from INIST, Datastar, Dialog,\nEBSCO, OVID, Questel.Orbit, Qwam, and STN International); and others.\n\nNote that authors who submit papers in response to this announcement, will\nhave their papers evaluated for publication consideration in the Final Edition\nof the conference proceedings which will go to press soon after the conference\n(the conference would then make the necessary arrangements to ship the printed\nproceedings/books to such authors). The Final Edition of the conference\nproceedings will be identical to earlier edition except for a number of\nsections/chapters appended to the proceedings/book.\n\n\nIMPORTANT DATES:\n\nJune 5, 2014:       Submission of papers for evaluation (the sooner, a submission\n                    is received, the earlier, the notification will be sent out.)\nJune 18, 2014:      The notification of acceptance will be sent out typically one\n                    week after the paper has been submitted.\nJune 28, 2014:      Registration\nJuly 21-24, 2014:   The 2014 International Conference on Data Mining (DMIN'14)\nAugust 20, 2014:    Camera-Ready Papers Due for publication\n                    (Papers submitted and accepted in response to this announcement\n                    will be published in the Final Edition of the proceedings which\n                    will go to press soon after the conference; they will also be\n                    indexed in science citation index databases.)\n\n\nGENERAL INFORMATION:\n\nDMIN is an international conference that serves researchers, scholars,\nprofessionals, students, and academicians who are looking to both foster\nworking relationships and gain access to the latest research results. It is\nbeing held jointly (same location and dates) with a number of other research\nconferences; namely, The 2014 World Congress in Computer Science, Computer\nEngineering, and Applied Computing. The Congress is among the top five largest\nannual gathering of researchers in computer science, computer engineering and\napplied computing. We anticipate to have attendees from about 85\ncountries/territories.\n\nThe 2014 Congress will be composed of research presentations, keynote lectures,\ninvited presentations, tutorials, panel discussions, and poster presentations.\nIn recent past, keynote/tutorial/panel speakers have included:\nProf. David A. Patterson (pioneer, architecture, U. of California,\nBerkeley), Dr. K. Eric Drexler (known as Father of Nanotechnology),\nProf. John H. Holland (known as Father of Genetic Algorithms; U. of\nMichigan), Prof. Ian Foster (known as Father of Grid Computing; U. of\nChicago & ANL), Prof. Ruzena Bajcsy (pioneer, VR, U. of California,\nBerkeley), Prof. Barry Vercoe (Founding member of MIT Media Lab, MIT),\nDr. Jim Gettys (known as X-man, developer of X Window System, xhost;\nOLPC), Prof. John Koza (known as Father of Genetic Programming, Stanford\nU.), Prof. Brian D. Athey (NIH Program Director, U. of Michigan),\nProf. Viktor K. Prasanna (pioneer, U. of Southern California), Dr. Jose\nL. Munoz (NSF Program Director and Consultant), Prof. Jun Liu (pioneer,\nBroad Institute of MIT & Harvard U.), Prof. Lotfi A. Zadeh (Father of\nFuzzy Logic), Dr. Firouz Naderi (Head, NASA Mars Exploration Program/\n2000-2005 and Associate Director, Project Formulation & Strategy, Jet\nPropulsion Lab, CalTech/NASA; Director, NASA's JPL Solar System\nExploration), Prof. David Lorge Parnas (Fellow of IEEE, ACM, RSC, CAE, GI;\nDr.h.c.: ETH Zurich, Prof. Emeritus, McMaster U. and U. of Limerick),\nProf. Eugene H. Spafford (Executive Director, CERIAS and Professor, Purdue\nUniversity), Dr. Sandeep Chatterjee (Vice President & Chief Technology\nOfficer, SourceTrace Systems, Inc.), Prof. Haym Hirsh (Dean, Cornell\nUniversity - formerly at Rutgers University, New Jersey, USA and former\ndirector of Division of Information and Intelligent Systems, National\nScience Foundation, USA), Dr. Flavio Villanustre (Vice-President, HPCC\nSystems), Prof. Victor Raskin (Distinguished Professor, Purdue University,\nUSA); Prof. Alfred Inselberg (School of Mathematical Sciences, Tel Aviv\nUniversity, Israel; Senior Fellow, San Diego Supercomputing Center;\nInventor of the multidimensional system of Parallel Coordinates and\nauthor of textbook); Prof. H. J. Siegel (Abell Endowed Chair Distinguished\nProfessor of ECE and Professor of CS; Director, CSU Information Science\nand Technology Center (ISTeC), Colorado State University, Colorado, USA);\nand many other distinguished speakers. To get a feeling about the\nconferences' atmosphere, see some delegates photos available at:\nhttp://infinitydempsey.smugmug.com/WorldComp\nhttp://worldcomp.phanfare.com/\n\nAn important mission of The Congress is \"Providing a unique platform for\na diverse community of constituents composed of scholars, researchers,\ndevelopers, educators, and practitioners. The Congress makes concerted\neffort to reach out to participants affiliated with diverse entities\n(such as: universities, institutions, corporations, government agencies,\nand research centers/labs) from all over the world. The congress also\nattempts to connect participants from institutions that have teaching as\ntheir main mission with those who are affiliated with institutions that\nhave research as their main mission. The congress uses a quota system to\nachieve its institution and geography diversity objectives.\"\n\nOne main goal of the congress is to assemble a spectrum of affiliated\nresearch conferences, workshops, and symposiums into a coordinated\nresearch meeting held in a common place at a common time. This model\nfacilitates communication among researchers in different fields of computer\nscience, computer engineering, and applied computing. The Congress also\nencourages multi-disciplinary and inter-disciplinary research initiatives;\nie, facilitating increased opportunities for cross-fertilization across\nsub-disciplines.\n\nTUTORIALS:\n\nAll tutorials are free to conference registrants, the list of tutorials\nthat have been approved so far can be found at:\nhttp://www.worldacademyofscience.org/worldcomp14/ws/tutorials\nWe plan to offer more tutorials (in addition to what is already posted on\nthe web). As of the writing of this announcement, the following tutorials\nhave been approved and they will be presented by distinguished speakers:\n\n\nO. Accreditation Board of Engineering and Technology (ABET)\n   accreditation of Computer Science Program\nO. Natural Language in Information Security and Privacy\nO. Recommendation Systems for Big Data\nO. Energy-Aware Resource Management for Computing Systems\nO. Hacking with Kali Linux\nO. Cryptography and Network Security\nO. First Programming Language in CS Education - The Argument For Scala\nO. Fault Tolerance and Beyond\nO. Agents at High Seas\nO. Actor Parallelism and Akka/Scala\nO. Cloud Computing for Big Data Challenges\n   (Cloud Architectures and Big Data Tools)\nO. The Use of ICT to Mitigate Income Inequality\n\nCurrently, we are evaluating 6 other proposals and they are in the areas of\nBig Data and Data Analytics (3 proposals); Entrepreneurial Spirits;\nVisualization and Datamining; and Computational Biology.\n\n\nUSEFUL LINKS:\n\nConference web site:\nhttp://www.dmin-2014.com/ \n\nPartial list of tutorials:\nhttp://www.worldacademyofscience.org/worldcomp14/ws/tutorials\n\nPartial list of keynotes:\nhttp://www.worldacademyofscience.org/worldcomp14/ws/keynotes\n\nLocation of the conference:\nhttp://www.worldacademyofscience.org/worldcomp14/ws/location\n\n\nMEASURABLE SCIENTIFIC IMPACT OF CONGRESS:\n\nAs of December 14, 2013, papers published in the congress proceedings that\nDMIN is part of, have received over 27,500 citations (includes about 3,300\nself-citations). Citation data obtained from Microsoft Academic Search. This\ncitation data does not even include more than 15,000 other citations to\npapers in tracks whose first offerings were initiated by the congress. 138939\n\nBased on citation record and other relevant metrics, Microsoft Academic\nhas listed DMIN annual conferences in its list of Top Conferences:\nhttp://academic.research.microsoft.com/RankList?entitytype=3&topDomainID=2&subDomainID=7&last=0&start=1&end=100 \n\n\nMISCELLANEOUS:\nThe information that appears in this announcement is correct as of May 19,\n2014.\n\nCONTACT INFORMATION:\n\n   - General Enquiries: Dr. Robert Stahlbock, General Conference Chair:\n     conference-chair@dmin-2014.com\n\n   - Conference Programme Chair: Dr. Gary M. Weiss, Programme Chair:\n     programme-chair@dmin-2014.com\n\n   - Student Funding Enquiries: Dr. Robert Stahlbock, Student Funding Chair:\n     student-chair@dmin-2014.com\n\n   - Tutorials Session Proposals: Dr. Gary M. Weiss, Tutorial Chair:\n     tutorial-chair@dmin-2014.com\n\n   - Special Session & Workshop Proposals: Dr. Gary M. Weiss,\n     Special Session Chair:\n     special-session-chair@dmin-2014.com\n\n   - Exhibitors & Corporate Sponsors: TBA; Exhibit Chair:\n     exhibits-chair@dmin-2014.com\n\n=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=\n\nThis email was sent to:  foaad@calpoly.edu \n\nTo opt out of this email list: \nhttp://world-comp.org/cgi-bin/rm/full.cgi?08696a75-4b61-49a8-bc69-dce167aa057d \n\n",
    "attachments": []
}