{
    "subject": "Call For Papers: Deadline: June 5 - federated World Congress in Computer Science (July 21-24, 2014, Las Vegas, USA)",
    "from": "American Council on Science & Education <wcom@world-comp.org>",
    "to": "foaad@calpoly.edu",
    "cc": null,
    "bcc": null,
    "date": "Sat, 31 May 2014 17:55:08 -0400",
    "body": "\n                         CALL  FOR  PAPERS\n  CALL FOR LATE BREAKING PAPERS, POSITION PAPERS, ABSTRACTS, POSTERS\n\n                 Submission Deadline: June 5, 2014\n\n  The 2014 World Congress in Computer Science, Computer Engineering,\n                      and Applied Computing\n                  July 21-24, 2014, Las Vegas, USA\n             http://www.world-academy-of-science.org/\n\n\nINVITATION:\n\nThis announcement is ONLY for those who MISSED the opportunity to submit their\npapers in response to earlier \"Call For Papers\". Therefore, authors who have\nalready submitted papers in response to earlier \"Call For Papers\" should\nIGNORE this announcement. (Those who have been notified that their papers have\nbeen accepted, MUST still follow the instructions that were emailed to them;\nincluding meeting the deadlines mentioned in the notifications that were sent\nto them).\n\nYou are invited to submit a \"Late Breaking Paper\", \"Position Paper\", or\n\"Abstract/Poster Paper\" for consideration. All accepted papers will be published\nin printed conference books/proceedings (ISBN) and will also be made available\nonline. Like prior years, extended versions of selected papers (about 35%) will\nappear in journals and edited research books (publishers include: Springer,\nElsevier, BMC, and others). In addition to the above, we have arranged two new\nbook series; one with Elsevier publishers (Emerging Trends in Computer Science\nand Applied Computing) and another with Springer publishers (Transactions of\nComputational Science and Computational Intelligence). After the conference, a\nsignificant number of authors of accepted papers of our congress, will be given\nthe opportunity to submit the extended version of their papers for publication\nconsideration in these books. Each book in each series will be subject to\nElsevier and Springer science indexing products (which includes: Scopus,\nEi village, SCI, ...). See the following links for a small subset of the\npublications based on the Congress: (some of these books and special issues\nhave already received the top 25% downloads in their respective fields - we\nalso have a number of Elsevier and Springer books in the pipeline based on the\nofferings of the congress):\n\nhttp://www.springer.com/life+sciences/bioinformatics/book/978-1-4419-7045-9\nhttp://www.springer.com/life+sciences/bioinformatics/book/978-1-4419-5912-6\nhttp://store.elsevier.com/Emerging-Trends-in-ICT-Security/isbn-9780124114746/\nhttp://www.biomedcentral.com/bmcmedgenomics/supplements/6/S1\nhttp://pubmedcentralcanada.ca/pmcc/articles/PMC3287490/\nhttp://pubmedcentralcanada.ca/pmcc/articles/PMC2709251/\nhttp://pubmedcentralcanada.ca/pmcc/articles/PMC2999338/\nhttp://www.biomedcentral.com/1471-2164/9/S1/I1\nhttp://www.springer.com/series/11769\nhttp://www.biomedcentral.com/1752-0509/5?issue=S3\n\nThe Congress is composed of a number of tracks (joint-conferences, tutorials,\nsessions, workshops, poster and panel discussions); all will be held\nsimultaneously, same location and dates: July 21-24, 2014. For the complete\nlist of joint conferences, see below. To get a feeling about the conferences'\natmosphere, see some delegates photos available at:\nhttp://worldcomp.phanfare.com/\nhttp://infinitydempsey.smugmug.com/WorldComp\n\n\nSUBMISSION OF LATE BREAKING PAPERS, POSITION PAPERS, ABSTRACTS/POSTERS:\n\nIn response to this announcement, authors are given the opportunity to submit\ntheir papers for evaluation in one of the following three categories:\n\n   1. Late Breaking Papers: describe late-breaking/recent developments in\n      the field. The maximum number of pages is 7. Please write the following\n      on the first page of your submission \"name of conference: LATE BREAKING\n      PAPER\". If accepted, The length of the final/Camera-Ready paper will be\n      limited to 7 (two-column IEEE style) pages and the author will be given\n      the opportunity to present the paper in a formal session.\n\n   2. Position Papers: enable discussions on emerging topics without the\n      experimentation normally present in an academic paper. Commonly,\n      such papers will substantiate the opinions or positions put forward\n      with evidence from an extensive objective discussion of the topic.\n      The maximum number of pages is 4. Please write the following on the\n      first page of your submission \"name of conference: POSITION PAPER\".\n      If accepted, The length of the final/Camera-Ready paper will be limited\n      to 4 (two-column IEEE style) pages and the author will be given the\n      opportunity to present the paper in a discussion/poster session.\n\n   3. Abstract/Poster Papers: describe research roadmaps (similar to PhD\n      plan or PhD prospectus). The maximum number of pages is 2. Please\n      write the following on the first page of your submission \"name of\n      conference: ABSTRACT/POSTER PAPER\". If accepted, The length of the\n      final/Camera-Ready paper will be limited to 2 (two-column IEEE style)\n      pages and the author will be given the opportunity to present the paper\n      in a discussion/poster session.\n\nProspective authors are invited to submit their papers (see above for paper\ncategories) by uploading them to the evaluation web site at:\nhttp://world-comp.org .\nSubmissions must be uploaded by June 5, 2014 and must be in either MS doc or\npdf formats. All reasonable typesetting formats are acceptable (later, the\nauthors of accepted papers will be asked to follow a particular typesetting\nformat to prepare their final papers for publication.) Papers must not have\nbeen previously published or currently submitted for publication elsewhere.\nThe first page of the paper should include: title of the paper, name,\naffiliation, postal address, and email address for each author. The first\npage should also identify the name of the Contact Author and a maximum of 5\ntopical keywords that would best represent the content of the paper.\n\nEach paper will be peer-reviewed by two experts in the field for originality,\nsignificance, clarity, impact, and soundness. In cases of contradictory\nrecommendations, a member of the conference program committee would be\ncharged to make the final decision (accept/reject); often, this would involve\nseeking help from additional referees. Papers whose authors include a member\nof the conference program committee will be evaluated using the double-blinded\nreview process. (Papers deemed to be philosophical, essay type, or about\ncontroversial topics/applications will not be refereed but may be considered\nfor discussion/panels/presentation).\n\nThe proceedings will be published in printed conference books (ISBN) and\nwill also be made available online. The proceedings will be indexed in\nscience citation databases that track citation frequency/data for each\npublished paper. Science citation databases include: Inspec / IET / The\nInstitute for Engineering & Technology; The French National Center for\nScientific Research, CNRS, INIST databases, PASCAL (accessable from INIST,\nDatastar, Dialog, EBSCO, OVID, Questel.Orbit, Qwam, & STN International);\nand others. The proceedings/books of this congress have been evaluated for\ninclusion into major science citation index databases. We are happy to\nreport that so far, the evaluation board of science citation index\ndatabases have approved the indexing, integrating, and inclusion of the\nfollowing conference tracks into relevant indexing databases (indexing\ndatabases include, among others: Scopus, www.info.scopus.com; SCI Compendex,\nEngineering Village, www.ei.org; EMBASE, www.info.embase.com; and others):\nBIOCOMP, DMIN, GCA, ICAI, ICOMP, ICWN, IKE, IPCV, PDPTA, and SAM; please\nsee below for the full name of each of these conferences.\n\nNote that authors who submit papers in response to this announcement, will\nhave their papers evaluated for publication consideration in the Final Edition\nof the conference proceedings which will go to press soon after the conference\n(the conference would then make the necessary arrangements to ship the printed\nproceedings/books to such authors). The Final Edition of the conference\nproceedings will be identical to earlier edition except for a number of\nsections/chapters appended to the proceedings/book.\n\n\nLIST OF CONFERENCES (alphabetical order based on conference acronym)\n\no ABDA'14:\n  The 1st International Conference on Advances in Big Data Analytics\no BIOCOMP'14:\n  The 15th International Conference on Bioinformatics & Computational Biology\no CSC'14:\n  The 12th International Conference on Scientific Computing\no DMIN'14:\n  The 10th International Conference on Data Mining\no EEE'14:\n  The 13th International Conference on e-Learning, e-Business, Enterprise\n  Information Systems, and e-Government\no ESA'14:\n  The 12th International Conference on Embedded Systems and Applications\no FCS'14:\n  The 10th International Conference on Foundations of Computer Science\no FECS'14:\n  The 10th International Conference on Frontiers in Education: Computer\n  Science and Computer Engineering\no GCA'14:\n  The 10th International Conference on Grid & Cloud Computing and\n  Applications\no GEM'14:\n  The 11th International Conference on Genetic & Evolutionary Methods\no ICAI'14:\n  The 16th International Conference on Artificial Intelligence\no ICOMP'14:\n  The 15th International Conference on Internet Computing and Big Data\no ICWN'14:\n  The 13th International Conference on Wireless Networks\no IKE'14:\n  The 13th International Conference on Information & Knowledge Engineering\no IPCV'14:\n  The 18th International Conference on Image Processing, Computer Vision,\n  & Pattern Recognition\no MSV'14:\n  The 11th International Conference on Modeling, Simulation and\n  Visualization Methods\no PDPTA'14:\n  The 20th International Conference on Parallel and Distributed Processing\n  Techniques and Applications\no SAM'14:\n  The 13th International Conference on Security and Management\no SERP'14:\n  The 12th International Conference on Software Engineering Research and\n  Practice\no SWWS'14:\n  The 12th International Conference on Semantic Web and Web Services\n\nJuly 21-24, 2014, USA.\n\nAll conferences listed above will be held simultaneously; i.e., same location\nand dates.\n\nIMPORTANT DATES:\n\nJune 5, 2014:       Submission of papers for evaluation (the sooner, a submission\n                    is received, the earlier, the notification will be sent out.)\nJune 14, 2014:      The notification of acceptance will be sent out typically 10\n                    days after the paper has been submitted.\nJune 26, 2014:      Registration\nJuly 21-24, 2014:   The 2014 World Congress in Computer Science, Computer Engineering,\n                    and Applied Computing (including all affiliated and federated\n                    conferences, tutorials, and workshops).\n                    http://www.world-academy-of-science.org/ \nAugust 20, 2014:    Camera-Ready Papers Due for publication\n                    (Papers submitted and accepted in response to this announcement\n                    will be published in the Final Edition of the proceedings which\n                    will go to press soon after the conference; they will also be\n                    indexed in science citation index databases.)\n\n\nGENERAL INFORMATION:\n\nThe 2014 World Congress in Computer Science, Computer Engineering, and\nApplied Computing serves researchers, scholars, professionals, students,\nand academicians who are looking to both foster working relationships\nand gain access to the latest research results. The Congress is among\nthe top five largest annual gathering of researchers in computer science,\ncomputer engineering and applied computing. We anticipate to have\nattendees from about 85 countries/territories.\n\nThe 2014 Congress will be composed of research presentations, keynote lectures,\ninvited presentations, tutorials, panel discussions, and poster presentations.\nIn recent past, keynote/tutorial/panel speakers have included:\nProf. David A. Patterson (pioneer, architecture, U. of California,\nBerkeley), Dr. K. Eric Drexler (known as Father of Nanotechnology),\nProf. John H. Holland (known as Father of Genetic Algorithms; U. of\nMichigan), Prof. Ian Foster (known as Father of Grid Computing; U. of\nChicago & ANL), Prof. Ruzena Bajcsy (pioneer, VR, U. of California,\nBerkeley), Prof. Barry Vercoe (Founding member of MIT Media Lab, MIT),\nDr. Jim Gettys (known as X-man, developer of X Window System, xhost;\nOLPC), Prof. John Koza (known as Father of Genetic Programming, Stanford\nU.), Prof. Brian D. Athey (NIH Program Director, U. of Michigan),\nProf. Viktor K. Prasanna (pioneer, U. of Southern California), Dr. Jose\nL. Munoz (NSF Program Director and Consultant), Prof. Jun Liu (pioneer,\nBroad Institute of MIT & Harvard U.), Prof. Lotfi A. Zadeh (Father of\nFuzzy Logic), Dr. Firouz Naderi (Head, NASA Mars Exploration Program/\n2000-2005 and Associate Director, Project Formulation & Strategy, Jet\nPropulsion Lab, CalTech/NASA; Director, NASA's JPL Solar System\nExploration), Prof. David Lorge Parnas (Fellow of IEEE, ACM, RSC, CAE, GI;\nDr.h.c.: ETH Zurich, Prof. Emeritus, McMaster U. and U. of Limerick),\nProf. Eugene H. Spafford (Executive Director, CERIAS and Professor, Purdue\nUniversity), Dr. Sandeep Chatterjee (Vice President & Chief Technology\nOfficer, SourceTrace Systems, Inc.), Prof. Haym Hirsh (Dean, Cornell\nUniversity - formerly at Rutgers University, New Jersey, USA and former\ndirector of Division of Information and Intelligent Systems, National\nScience Foundation, USA), Dr. Flavio Villanustre (Vice-President, HPCC\nSystems), Prof. Victor Raskin (Distinguished Professor, Purdue University,\nUSA); Prof. Alfred Inselberg (School of Mathematical Sciences, Tel Aviv\nUniversity, Israel; Senior Fellow, San Diego Supercomputing Center;\nInventor of the multidimensional system of Parallel Coordinates and\nauthor of textbook); Prof. H. J. Siegel (Abell Endowed Chair Distinguished\nProfessor of ECE and Professor of CS; Director, CSU Information Science\nand Technology Center (ISTeC), Colorado State University, Colorado, USA);\nand many other distinguished speakers. To get a feeling about the\nconferences' atmosphere, see some delegates photos available at:\nhttp://infinitydempsey.smugmug.com/WorldComp\nhttp://worldcomp.phanfare.com/\n\nAn important mission of The Congress is \"Providing a unique platform for\na diverse community of constituents composed of scholars, researchers,\ndevelopers, educators, and practitioners. The Congress makes concerted\neffort to reach out to participants affiliated with diverse entities\n(such as: universities, institutions, corporations, government agencies,\nand research centers/labs) from all over the world. The congress also\nattempts to connect participants from institutions that have teaching as\ntheir main mission with those who are affiliated with institutions that\nhave research as their main mission. The congress uses a quota system to\nachieve its institution and geography diversity objectives.\"\n\nOne main goal of the congress is to assemble a spectrum of affiliated\nresearch conferences, workshops, and symposiums into a coordinated\nresearch meeting held in a common place at a common time. This model\nfacilitates communication among researchers in different fields of computer\nscience, computer engineering, and applied computing. The Congress also\nencourages multi-disciplinary and inter-disciplinary research initiatives;\nie, facilitating increased opportunities for cross-fertilization across\nsub-disciplines.\n\n\nTUTORIALS:\n\nAll tutorials are free to conference registrants, the list of tutorials\nthat have been approved so far can be found at:\nhttp://www.worldacademyofscience.org/worldcomp14/ws/tutorials\nWe plan to offer more tutorials (in addition to what is already posted on\nthe web). As of the writing of this announcement, the following tutorials\nhave been approved and they will be presented by distinguished speakers:\n\nO. Accreditation Board of Engineering and Technology (ABET)\n   accreditation of Computer Science Program\nO. Natural Language in Information Security and Privacy\nO. Recommendation Systems for Big Data\nO. Energy-Aware Resource Management for Computing Systems\nO. Hacking with Kali Linux\nO. Cryptography and Network Security\nO. First Programming Language in CS Education - The Argument For Scala\nO. Fault Tolerance and Beyond\nO. Agents at High Seas\nO. Actor Parallelism and Akka/Scala\nO. Cloud Computing for Big Data Challenges\n   (Cloud Architectures and Big Data Tools)\nO. The Use of ICT to Mitigate Income Inequality\n\nCurrently, we are evaluating 6 other proposals and they are in the areas of\nBig Data and Data Analytics (3 proposals); Entrepreneurial Spirits;\nVisualization and Datamining; and Computational Biology. 138939\n\n\nUSEFUL LINKS:\n\nConference web site:\nhttp://www.world-academy-of-science.org/ \n\nPartial list of tutorials:\nhttp://www.worldacademyofscience.org/worldcomp14/ws/tutorials\n\nPartial list of keynotes:\nhttp://www.worldacademyofscience.org/worldcomp14/ws/keynotes\n\nLocation of the conference:\nhttp://www.worldacademyofscience.org/worldcomp14/ws/location\n\n\nMEASURABLE SCIENTIFIC IMPACT OF CONGRESS:\n\nAs of December 14, 2013, papers published in the congress proceedings\nhave received over 27,500 citations (includes about 3,300 self-citations).\nCitation data obtained from Microsoft Academic Search. This citation\ndata does not even include more than 15,000 other citations to papers\nin tracks whose first offerings were initiated by the congress.\n\nBased on citation record and other relevant metrics, Microsoft Academic\nhas listed many of the joint conferences that are part of this congress\nin its list of Top Conferences (e.g., go to\nhttp://academic.research.microsoft.com/ ; select the tab \"Conferences\"\nand then type \"PDPTA\", or \"FECS\", or \"IC-AI\", or \"ICOMP\", ...)\n\nMISCELLANEOUS:\nThe information that appears in this announcement is correct as of May 19,\n2014.\n\nCONTACT:\nInquiries should be sent to: sc@world-comp.org\n\n=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=\n\nThis email was sent to:  foaad@calpoly.edu \n\nTo opt out of this email list: \nhttp://world-comp.org/cgi-bin/rm/full.cgi?08696a75-4b61-49a8-bc69-dce167aa057d \n\n",
    "attachments": []
}