{
    "subject": "Call For Papers: ELSEVIER Book \"Computational Biology, Bioinformatics, & Systems Biology\" + Big Data; Submission Deadline: November 1, 2014",
    "from": "Elsevier Computational Biology <elsevier@world-comp.org>",
    "to": "foaad@calpoly.edu",
    "cc": null,
    "bcc": null,
    "date": "Wed, 08 Oct 2014 15:14:23 -0400",
    "body": "\n                    CALL FOR PAPERS/CHAPTERS\n\n             Emerging Trends in Computational Biology,\n               Bioinformatics, and Systems Biology\n\n                Publisher: Elsevier (MK imprints)\n\n            Paper Submission Deadline: November 1, 2014\n\nScience Citation Indexing:\n     Subject to relevant Elsevier indexing products which includes,\n     Medline, Scopus, EMBASE, BIOSIS, Biological Abstracts and others.\n\nYou are invited to submit a paper/chapter; see below for submission\ninstructions. All accepted papers will be published in a research\nbook entitled \"Emerging Trends in Computational Biology, Bioinformatics,\nand Systems Biology\". This book will be published by Elsevier (in book\nseries, \"Emerging Trends in Computer Science and Applied Computing\".)\nThe book will be subject to relevant Elsevier science citation indexing\nproducts.\n\nTOPICS OF INTEREST INCLUDE (BUT ARE NOT LIMITED TO) THE FOLLOWINGS:\n\nComputational Biology is the science of using biological data to develop\nalgorithms and relations among various biological systems. It involves the\napplication of data-analytical and algorithms, mathematical modeling and\nsimulation techniques to the study of biological systems. The field is\nmultidisciplinary in that it includes topics that are traditionally\ncovered in computer science, mathematics, imaging science, statistics,\nchemistry, biophysics, genetics, genomics, ecology, evolution, anatomy,\nneuroscience, and visualization where computer science acts as the topical\nbridge between all such diverse areas (for a formal definition of\nComputational Biology, refer to the Computational_biology wiki page).\nMany consider the area of Bioinformatics to be a sub-field of Computational\nBiology which includes methods for storing, retrieving, organizing and\nanalyzing biological data. The area of Systems Biology is an emerging\nmethodology applied to biomedical and biological scientific research.\nIt is an area that overlaps with computational biology and bioinformatics.\nIn addition, the area of Big Data and Data Analytics has become an\nimportant topic in Computational Biology. This edited book will cover the\nemerging trends in all aspects of Computational Biology, Bioinformatics,\nand Systems Biology. The topics of interest appear below (but we are not\nlimited to only these topics - therefore, the list below should be\nconsidered to be only a partial list):\n\n   O  COMPUTATIONAL BIOLOGY:\n      Computational biology involves the development and application of\n      data-analytical and theoretical methods, mathematical modeling and\n      computational simulation techniques to the study of biological and\n      behavioral systems. Topics of interest include (but not limited to):\n\n      - Computational Biology and Applications in Cancer Research\n      - Software Tools and Methods for Computational Biology\n      - Application of Computational Intelligence and Drug Design\n      - High-performance Computing and Applications in Biology\n      - Parallel Algorithms and Methods\n      - Scalable Systems and Algorithms\n      - Statistical Methods in Biology\n      - Cloud and Grid Computing for Biological Systems\n      - Simulation Methods\n\n   O  BIOINFORMATICS - DATABASES, DATA MINING, AND PATTERN DISCOVERY:\n      Bioinformatics is an interdisciplinary scientific field that is\n      concerned with methods for storing, retrieving, organizing and\n      analyzing biological data. The field is also concerned with software\n      tools to generate useful biological knowledge. Many of the methods\n      in bioinformatics have foundations in mathematics and statistics.\n      Topics of interest include (but not limited to):\n\n      - General Principles of DNA/RNA Structure and Stability\n      - Sequence Alignment Methods\n      - Software for Bioinformatics and Applications\n      - Algorithms and Models\n      - Phylogenetic Inference and Evolutionary Relationships\n      - Structure Prediction\n      - Genome Sequencing and Mapping\n      - Genome Reconstruction and Assembly\n      - Comparative Genomics\n      - Functional Genomics and Reverse Genetics\n      - Gene Expression Analysis, Clustering, Motif Discovery\n      - Genome Annotation: Gene Finding, Gene Indices\n      - Genetic Regulation and Genome Diversity and Structure\n      - The Human Genome Project\n      - Genome Databases\n      - Proteomics and Metabolomics\n      - Protein Structure and Modeling and Classification\n      - Microarray Analysis\n      - Medical Applications\n\n   O  SYSTEMS BIOLOGY:\n      Systems biology provides an ability to obtain, integrate and analyze\n      complex data sets from multiple experimental sources using\n      interdisciplinary tools. This is an evolving field and there is not\n      yet an agreed-upon definition for it. Topics of interest include\n      (but not limited to):\n\n      - Phenomics: Organismal variation in phenotype as it changes during\n        its life span\n      - Genomics: Organismal deoxyribonucleic acid (DNA) sequence, including\n        intra-organismal cell specific variation\n      - Epigenomics / Epigenetics: Organismal and corresponding cell specific\n        transcriptome regulating factors not empirically coded in the\n        genomic sequence\n      - Transcriptome: Organismal, tissue or whole cell gene expression\n        measurements by DNA microarrays or serial analysis of gene expression\n      - Interferomics: Organismal, tissue, or cell level transcript correcting\n        factors (i.e. RNA interference)\n      - Translatomics / Proteomics: Organismal, tissue, or cell level\n        measurements of proteins and peptides via 2D gel electrophoresis, mass\n        spectrometry or multi-dimensional protein identification techniques\n      - Metabolomics: Organismal, tissue, or cell level measurements of all\n        small-molecules known as metabolites\n      - Glycomics: Organismal, tissue, or cell level measurements of\n        carbohydrates\n      - Lipidomics: Organismal, tissue, or cell level measurements of lipids\n      - Probability Modeling and Statistical Inference in Periodic Cancer\n        Screening\n      - Cell cycle and checkpoint control\n      - Systems biology and vaccination research\n\n   O  BIG DATA AND DATA ANALYTIC IN COMPUTATIONAL BIOLOGY AND BIOINFORMATICS:\n      Big Data is the collection of data sets so large and complex that it\n      becomes difficult to process using conventional database management\n      systems or traditional data processing applications. With the advent of\n      high-throughput genomics, life scientists are starting to demand\n      massive data sets, encountering challenges with handling, processing\n      and moving information that were once the domain of other disciplines.\n      Topics of interest include (but not limited to):\n\n      - Algorithms for Big Data and applications in Biology: Data and\n        Information Fusion, Genetic Algorithms, Machine Learning, Scalable\n        Algorithms, Simulation and Modeling, Dimensionality Reduction Techniques,\n        Multidimensional Big Data\n      - Biological Big Data Fundamentals: Novel Computational Methodologies,\n        Algorithms for Enhancing Data Quality, Graph Algorithms and Big Data,\n        Computational Intelligence\n      - Infrastructures for Big Data and Bioinformatics: Cloud and Grid Based\n        Infrastructures, High Performance Computing, Parallel & Distributed\n        Processing, Software and Tools for Big Data, Emerging Architectural\n        Frameworks for Big Data\n      - Big Data Management: Database and Web Applications, Distributed\n        Database Systems, Distributed File Systems, Data Fusion and Integration,\n        Data Management Methods\n      - Big Data Search & Mining Methods: Data Mining, Information Mining,\n        Scalable Search Architectures, Cleaning Big Data,, Visualization Methods\n        for Search, Time Series Analysis, Graph Mining and Other Similar\n        Technologies.\n\n\nSUBMISSION OF PAPERS:\n\n   Prospective authors are invited to submit their papers by\n   uploading them to:\n   http://world-comp.org/elsevier-morgan-kaufman-CBB/ \n\n   Submissions must be received by no later than November 1, 2014 and\n   must be in either, MS doc or pdf format. Although we do not have a\n   specific page limit, we anticipate that a typical paper would be\n   about 10 pages long. At this point, all reasonable typesetting\n   formats are acceptable; however, authors of accepted papers will\n   later be asked to follow a particular typesetting format/instructions\n   to prepare their papers for publication/press.\n\n   Papers must not have been previously published or currently submitted\n   for publication elsewhere. However, we will consider and encourage\n   submissions that are the EXTENDED versions of already published\n   conference papers. The first page of the paper should include: title\n   of the paper, authors' names, their affiliations, city and country.\n   The first page should also identify the name of the Contact Author and\n   a maximum of 5 topical keywords that would best represent the content\n   of the paper. For each author, his/her email address should also\n   be provided.  864453\n\n   Papers will be evaluated for originality, significance, clarity, impact,\n   and soundness. Each paper will be refereed by at least two experts in\n   the field. The referees' evaluations will then be reviewed by the editors\n   who will recommend a decision.\n\n   This invitation is being sent to selected authors of CSCI and BIOCOMP\n   annual conferences\n   http://ieeexplore.ieee.org/xpl/mostRecentIssue.jsp?reload=true&punumber=6820887 \n   as well as to authors of other relevant conferences giving such authors\n   the opportunity to submit the extended versions of their papers for\n   publication consideration in this book series. This invitation is also\n   being sent to various listservs whose subscribers may include authors\n   who wish to submit papers to this book.\n   \n\nHISTORY:\n\n   In recent years, the same co-editors composed the following books in the\n   subject matter:\n   http://www.springer.com/life+sciences/biochemistry+%26+biophysics/book/978-1-4419-5912-6 \n   http://www.springer.com/life+sciences/systems+biology+and+bioinformatics/book/978-1-4419-7045-9 \n\n   The above books are now among the top 20% most downloaded books based on\n   the publisher's record. We are hoping that this new book will be at least\n   as successful as the above books.\n\nEDITORIAL BOARD:\n\n   This book's editorial board is composed of the program committees of:\n   BIOCOMP 2013 and 2014:\n   http://www.world-academy-of-science.org/worldcomp14/ws/conferences/biocomp14/committee \n   http://www.worldacademyofscience.org/worldcomp13/ws/conferences/biocomp13/committee \n   We will seek the help of additional experts as needs arise.\n   \n   This book solicits papers from all researchers (ie, not only from particular\n   conferences).\n\nCO-EDITORS:\n\n   Prof. Quoc-Nam Tran, PhD\n      Professor and Chair,\n      Department of Computer Science, The University of South Dakota,\n      South Dakota, USA\n      email: quocnam.tran@usd.edu\n\n   Prof. Hamid R. Arabnia, PhD\n      Professor of Computer Science and Fellow of Int'l Society of Intelligent\n      Biological Medicine (ISIBM);\n      Editor, Emerging Trends in Computer Science and Applied Computing (Elsevier)\n      The University of Georgia, Department of Computer Science, Georgia, USA\n      email: hra@world-comp.org\n\n\nIMPORTANT DEADLINES:\n\n   Paper Submission (about 10 pages):         November 1, 2014\n   Notification of acceptance:                About 3 weeks after a paper is submitted.\n                                              However, we intend to send all\n                                              notifications by November 21, 2014.\n   Submission of final paper for publication: December 8, 2014\n   Signed Copyright/Consent form:             December 8, 2014\n   Publication Date of the book:              January 2015 (or soon thereafter)\n   Publisher:                                 Elsevier (MK imprints)\n   Science Citation Indexing:\n       Subject to relevant Elsevier indexing products which includes,\n       Medline, Scopus, EMBASE, BIOSIS, Biological Abstracts and others.\n   Title of book:\n       Emerging Trends in Computational Biology, Bioinformatics, and Systems\n       Biology\"\n\nCONTACT INFORMATION:\n\n   Inquiries should be sent to sc@world-comp.org .\n\n=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=\n\nThis email was sent to:  foaad@calpoly.edu \n\nTo opt out of this email list: \nhttp://world-comp.org/cgi-bin/rm/ict.cgi?cb9ad0c3-6234-4025-b566-4d119de70f66 \n\n",
    "attachments": []
}