{
    "subject": "Call For Papers: PDPTA 2013 Conference - 5th Automata, Theory and Applications Workshop, July 22-25, 2013, USA - Paper Submission Deadline: March 25, 2013",
    "from": "Computer Science <wcom13@world-comp.org>",
    "to": "foaad@calpoly.edu",
    "cc": null,
    "bcc": null,
    "date": "Mon, 18 Feb 2013 16:36:58 -0500",
    "body": "\nApologies for multiple and cross posting\n\n************************************************************************\n\nCall for Papers\n\n5th Automata, Theory and Applications Workshop (*A-PDPTA'13)\n(formerly CA-CSC'13)\n\nwithin the 2013 International Conference on Parallel and Distributed\nProcessing Techniques and Applications (PDPTA'13)\n\nJuly 22-25, 2013, Las Vegas, USA\n\nPaper Submission Deadline: March 25, 2013\n\n************************************************************************\n\nDear Professionals and Research Students working in areas involving both\ntheory and application fields of computer science, we are inviting you to\njoin us for our:\n\n5th Automata, Theory and Applications Workshop within The 2013\nInternational Conference on Parallel and Distributed Processing\nTechniques and Applications (PDPTA'13): July 22-25, 2013, Tropicana Hotel,\nLas Vegas, USA), one of 22 conferences at WORLDCOMP'13 - The 2013 World\nCongress in Computer Science, Computer Engineering, and Applied Computing.\n\nChairs of Session: Lou D'Alotto*, J.F. Nystrom**, William Spataro***\n    * York College/CUNY and The CUNY Graduate Center, New York, USA,\n      ldalotto@gc.cuny.edu\n    **Ferris State University, Michigan, USA,\n      JamesNystrom@ferris.edu\n    ***University of Calabria, Italy,\n      spataro@unical.it\n\nDeadline for the full paper submission is March 25, 2013.\n\nOFFICIAL CFP:\n\nFollowing the success of our previous Cellular Automata, Theory and\nApplications Workshop, which included exciting keynotes addressed from\nleading Cellular Automata researchers, Prof. Dr. Peter Sloot and Prof.\nYaroslav D. Sergeyev, father of the Infinity Computer; we are glad to\ninvite you to our fifth edition. From this year, topics of the Workshop\nhave been extended to the more general Automata theme, including both\ntheoretical and applicative aspects of this important computer science\nfield.\n\nThe main objective of this Workshop, organized within the 2013 World\nCongress in Computer Science, Computer Engineering, and Applied Computing\n(WORLDCOMP'13), is to offer scientists, researchers and engineers an\nopportunity to express and confront their views on trends, challenges, and\nstate-of-the art in both theory and diverse application fields such as\nengineering, physics, chemistry, biology, geology, medicine, ecology,\nsociology, traffic control, economy, etc.\n\nDistinguished papers will be published in a special issue of the Journal\nof SuperComputing, a leading ISI research journal publishing theoretical,\npractical, tutorial and survey papers on all aspects of supercomputing.\n\nPlease see other publication details below.\n\nSCOPE: Topics of interest include, but are not limited to:\n\n- cellular automata\n  .  theoretical\n  .  systems modeling\n  .  other applications\n\n- finite automata\n\n- formal language theory\n\n- theoretical issues on automata theory\n\n- parallel implementations\n\n\nSUBMISSION:\n\nProspective authors are invited to submit their draft papers directly to\nthe Workshop Chairs (see emails above). Please include \"*A - PDPTA'13\" in\nthe email subject header. Submissions must be received by March 25, 2013\nand they must be in either MS doc (not docx) or pdf formats (about 5 to 7\npages - single space, font size of 10 to 12). All reasonable typesetting\nformats are acceptable (later, the authors of accepted papers will be\nasked to follow a particular typesetting format to prepare their papers for\npublication.) The length of the Camera-Ready papers (if accepted) will be\nlimited to 7 (IEEE style) pages. Papers must not have been previously\npublished or currently submitted for publication elsewhere. The first page\nof the draft paper should include: title of the paper, name, affiliation,\npostal address, and email address for each author. The first page should\nalso identify the name of the Contact Author and a maximum of 5 topical\nkeywords that would best represent the content of the paper. Finally, the\nname of the conference (PDPTA'13) must be stated on the first page.\n\nIMPORTANT DATES:\n\nMarch 25, 2013:   Submission of papers (about 5 to 7 pages)\nApril 23, 2013:   Notification of decision\nMay 15, 2013:     Final papers + Copyright + Registration\nJuly 22-25, 2013: The 2013 World Congress in Computer Science, Computer\n                  Engineering, and Applied Computing\n                  (WORLDCOMP''13 - 22 joint-conferences)\n                  http://www.world-academy-of-science.org/ \n\nCATEGORIES OF ACCEPTED PAPERS:\n\n(RRP)  Regular Research Papers: 7-page IEEE-style publication in the\nproceedings. 20-minute formal presentation slot.\n\n(RRR)  Regular Research Reports: 7-page IEEE-style publication in the\nproceedings. Presentation in an informal setting (during Discussion\nSessions.) Typically, those authors with language difficulties prefer\nthis mode of presentation.\n\n(SRP)  Short Research Papers: 4-page IEEE-style publication in the\nproceedings. Presentation in an informal setting (during Discussion\nSessions.)  Same presentation mode as RRR papers.\n\n(PST)  Posters 1-page IEEE-style publication in the proceedings.\nPresentation in an informal setting (during Discussion Sessions.\n\nPUBLICATION:\n\nThe proceedings will be published in printed conference books (ISBN) and\nwill also be made available online. The proceedings will be indexed in\nscience citation databases that track citation frequency/data for each\npublished paper. Science citation databases include: Inspec / IET / The\nInstitute for Engineering & Technology; The French National Center for\nScientific Research, CNRS, INIST databases, PASCAL (accessable from INIST,\nDatastar, Dialog, EBSCO, OVID, Questel.Orbit, Qwam, and STN International);\nP3P8PCTD138939 and others. Though, there is no guarantee that the\nproceedings will also be included in SCI EI Compendex/Elsevier indexings;\nin the past, the proceedings were included in these databases. Therefore,\nwe will also be sending the proceedings for indexing procedures to SCI EI\nCompendex/Elsevier. The printed proceedings/books will be available for\ndistribution on site at the conference.\n\nMORE:\n\nThe 5th Automata, Theory and Applications Workshop, together with all\nother WORLDCOMP Workshops and Conferences, will be held at Tropicana\nHotel, Las Vegas, Nevada, USA (with any overflows at other near-by\nhotels). This is a mega hotel with excellent conference facilities.\nThe hotel is minutes from the airport with 24-hour shuttle service to\nand from the airport. This hotel has many recreational attractions.\nThe negotiated room rate for conference attendees is very reasonable.\n\nMore information about the *A-PDPTA 2013 Workshop and the general\nPDPTA 2013 conference and WorldComp'13 congress can be found at:\n\nhttp://www.worldacademyofscience.org/worldcomp13/ws/conferences/pdpta13\n\nWe are looking forward to welcoming you in Las Vegas!\n\nLou D'Alotto, J.F. (Jim) Nystrom, and William Spataro, Co-chairs\n\n--------------------------\nWilliam Spataro\nDepartment of Mathematics & Computer Science\nHigh Performance Computing Center\nUniversity of Calabria\nI-87036 Arcavacata di Rende (CS)\nItaly\n\nPhone(s) : +39.0984.49.3691 / 4875 / 6464\nFax : +39.0984.493570\nWeb: www.mat.unical.it/spataro\nEmail: spataro@unical.it\n\n=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=\n\nThis email was sent to:  foaad@calpoly.edu \n\nTo opt out of this email list: \nhttp://world-comp.org/cgi-bin/rm/full.cgi?08696a75-4b61-49a8-bc69-dce167aa057d \n\n",
    "attachments": []
}