{
    "subject": "Call For Papers: The 2013 Int'l Conf. Security and Management (SAM'13: July 22-25, 2013, Las Vegas, USA) - Extended Paper submission deadline: April 20, 2013",
    "from": "Computer Security <wcom13@world-comp.org>",
    "to": "foaad@calpoly.edu",
    "cc": null,
    "bcc": null,
    "date": "Wed, 17 Apr 2013 18:47:58 -0400",
    "body": "\n                         CALL  FOR  PAPERS\n\n       EXTENDED Paper Submission Deadline: end of April 20, 2013\n\n     The 2013 International Conference on Security and Management\n                              SAM'13\n\n                  July 22-25, 2013, Las Vegas, USA\n      Indexing: Scopus, SCI Compendex, Engineering Village, ...\n\n                   http://sam.udmercy.edu/sam13/\n\nINDEXING:\nThe proceedings/books of this conference have been evaluated and approved\nfor inclusion into science citation index / SCI databases. We are happy\nto report that the evaluation board of science citation index databases\nhave APPROVED the indexing, integrating, and inclusion of the SAM\nproceedings into relevant Elsevier indexing databases (Elsevier indexing\ndatabases include, among others: Scopus, www.info.scopus.com; SCI\nCompendex, Engineering Village, www.ei.org; EMBASE, www.info.embase.com;\nand others). In addition, the proceedings will also be indexed by a\nnumber of other science citation databases that track citation\nfrequency/data for each paper.\n\nINVITATION:\nYou are invited to submit a full paper for consideration. All accepted\npapers will be published in printed conference books/proceedings (ISBN)\nand will also be made available online. Like prior years, extended\nversions of selected papers (about 35%) will appear in journals and edited\nresearch books (publishers include: Springer, Elsevier, BMC, and others).\nIn addition to the above, we have arranged two new book series; one with\nElsevier publishers (Transactions on Computer Science and Applied Computing)\nand another with Springer publishers (Transactions of Computational Science\nand Computational Intelligence). After the conference, a significant number\nof authors of accepted papers of our congress, will be given the opportunity\nto submit the extended version of their papers for publication consideration\nin these books. The web sites for the two book series will be made available\nafter the logistics are finalized between our committee and the publishers\n(both book series projects have been approved.) We anticipate having between\n10 to 20 books a year in each of these book series projects. Each book in\neach series will be subject to Elsevier and Springer science indexing\nproducts (which includes: Scopus, Ei village, SCI, ...). 138939\n\n\nSAM'13 is composed of a number of tracks, including: tutorials, sessions,\nworkshops, posters, and panel discussions. All tutorials are free to\nregistered conference attendees - for a partial list of approved tutorials,\nsee: http://www.worldacademyofscience.org/worldcomp13/ws/tutorials\nThe conference will be held July 22-25, 2013, Las Vegas, USA.\n\nSCOPE: Topics of interest include, but are not limited to, the following:\n\nO  Network Security\n   -Security Algorithms\n   -Mobile Network Security\n   -Security in CDN (Contents Distribution Networks)\n   -Virtual Private Network (VPN)\n   -Tracing Techniques in Internet\n   -Active Networks\n   -Security in Grid\n   -Web Monitoring\n   -Network Security Engineering\n   -Transport-Level Security\n   -Wireless Network Security\n   -IP Security\n   -Electronic Mail security\n\nO  Cryptographic Technologies\n   -Security Protocols\n   -Key Management Techniques\n   -Cryptographic Technologies\n   -Applications of Block and Stream Ciphers\n   -Applications of Public Key Cryptology\n   -Message Authentication and Hash Functions\n   -Anonymity\n   -Digital Signature Schemes\n   -Secret Sharing\n   -Cryptanalysis\n\nO  Security Management\n   -Surveillance Technologies\n   -Security Policies\n   -Security for Protocol Management\n   -Location Management\n   -QoS Management\n   -Resource Management\n   -Channel Management\n   -Mobility Management\n   -Digital Contents Copyright Protection\n   -System Security Management\n   -Network Security Management\n   -Management in Network Equipment\n   -Storage Area Networks (SAN) Management\n   -Information Security Management\n   -Government Security Policy\n   -Web Penetration Testing\n   -Security Operations\n   -Vulnerabilities Management\n\nO  Security Education\n   -Computer Security Education\n   -Network Security Education\n   -Cyber Security Education\n   -Cyber Security Body of Knowledge\n   -Information Assurance Education\n\nO  Information Assurance\n   -Mission Assurance\n   -Risk Assessment and Risk Management\n   -Continuity of Operations and Business Impact Analysis\n   -Cyber Security Compliance\n   -Security Auditing\n   -Security-Savvy Software Development\n   -Disaster Recovery\n   -Business Continuity Analysis\n   -Access Control\n   -Secure Use of Software\n   -Secure Performance\n\nO  Biometrics and Forensics\n   -Novel Biometric Methods\n   -Forensics\n   -Biological Security Technologies\n   -Face Recognition Systems\n   -Signature Recognition Systems\n   -Cyber Forensics\n   -Forensic Analysis\n   -Biometric Technologies for Security\n   -Feature Extraction and Matching Algorithms\n\nO  Hardware Security\n   -Embedded Systems Security\n   -Cryptographic Processors and Co-Processors\n   -Security Architectures\n   -True and Pseudorandom Number Generators\n   -Side Channel Attacks\n   -Fault Attacks\n   -Hardware Tamper Resistance\n   -Smart Card Processors\n   -Secure Storage Devices\n\nO  Security Applications\n   -Security in E-Commerce and M-Commerce\n   -Secure OS\n   -Watermarking\n   -High-Tech Systems at Airports\n   -Emerging Technologies and Applications\n   -Cloud Computing Security\n   -Database Security\n   -Data Mining Security\n   -Cyber Security Automation\n\nO  Computer Security\n   -Firewall Systems\n   -Hacking Techniques and Related Issues\n   -Intrusion Detection System (IDS)\n   -Honeypot\n   -Virus Issues (Detection, Prevention ...)\n   -Trusted Computing\n   -Alert Correlation\n   -Attack Graphs\n   -Incident Responding\n   -Malware Analysis\n   -Incident Responding\n\n\nIMPORTANT DATES - EXTENDED:\n\nApril 20, 2013:    Submission of full/regular papers (about 7 pages)\nMay 11, 2013:      Notification of acceptance (+/- two days)*\nMay 25, 2013:      Final papers + Copyright + Registration\nJuly 22-25, 2013:  The 2013 International Conference on Security\n                   and Management (SAM'13)\n\n*Authors who submitted their papers early, will receive their papers'\nstatus report (notification) much sooner than May 11, 2013.\n\n\nMEASURABLE SCIENTIFIC IMPACT OF CONGRESS:\n\nAs of March 14, 2013, papers published in Congress proceedings that\nSAM is part of, have received 27,591 citations (includes 3,342\nself-citations). Citation data obtained from\nhttp://academic.research.microsoft.com/ .\n\n\nSUBMISSION OF REGULAR PAPERS:\n\nProspective authors are invited to submit their papers by uploading them\nto the evaluation web site at:\nhttps://www.easychair.org/account/signin.cgi?conf=sam13 .\nSubmissions must be uploaded by end of April 20, 2013 and must be in either\nMS doc or pdf formats (about 7 pages including all figures, tables,\nand references - single space, font size of 10 to 12). All reasonable\ntypesetting formats are acceptable (later, the authors of accepted\npapers will be asked to follow a particular typesetting format to\nprepare their final papers for publication.) Papers must not have been\npreviously published or currently submitted for publication elsewhere.\nThe first page of the paper should include: title of the paper, name,\naffiliation, postal address, and email address for each author. The\nfirst page should also identify the name of the Contact Author and a\nmaximum of 5 topical keywords that would best represent the content\nof the paper. The track title must also be stated on the first page of the\npaper as well as a 100 to 150-word abstract. The length of the final/\nCamera-Ready papers (if accepted) will be limited to 7\n(two-column IEEE style) pages.\n\nEach paper will be peer-reviewed by two experts in the field for\noriginality, significance, clarity, impact, and soundness. In cases of\ncontradictory recommendations, a member of the conference program\ncommittee would be charged to make the final decision (accept/reject);\noften, this would involve seeking help from additional referees.\nPapers whose authors include a member of the conference program\ncommittee will be evaluated using the double-blinded review process.\n(Essay/philosophical papers will not be refereed but may be considered\nfor discussion/panels).\n\nThe proceedings will be published in printed conference books (ISBN) and\nwill also be made available online. The proceedings will be indexed in\nscience citation databases that track citation frequency/data for each\npublished paper. Science citation databases include: relevant Elsevier\nindexing products (SCI Elsevier products include, among others: Scopus,\nwww.info.scopus.com; Engineering Village, www.ei.org; EMBASE,\nwww.info.embase.com; and others); Inspec / IET / The Institute for\nEngineering & Technology; The French National Center for Scientific Research,\nCNRS, INIST databases, PASCAL (accessable from INIST, Datastar, Dialog,\nEBSCO, OVID, Questel.Orbit, Qwam, and STN International); and others.\nThe printed proceedings/books will be available for distribution on\nsite at the conference - online/soft versions will also be made available\nworld-wide.\n\nIn addition to the above, we have arranged two new book series; one with\nElsevier publishers (Transactions on Computer Science and Applied Computing)\nand another with Springer publishers (Transactions of Computational Science\nand Computational Intelligence). After the conference, a significant number\nof authors of accepted papers of our congress, will be given the opportunity\nto submit the extended version of their papers for publication consideration\nin these books. We anticipate having between 10 to 20 books a year in each\nof these book series projects. Each book in each series will be subject to\nElsevier and Springer science indexing products (which includes: Scopus,\nEi village, SCI, ...).\n\nSUBMISSION OF POSTER PAPERS:\n\nPoster papers can be 2 pages long. Authors are to follow the same\ninstructions that appear above (see, SUBMISSION OF REGULAR PAPERS) except\nfor the submission is limited to 2 pages. On the first page, the author\nshould state that \"This paper is being submitted as a poster\". Poster\npapers (if accepted) will be published if and only the author of the\naccepted paper wishes to do so.  please email your poster papers to the\nposter co-chairs: Hanen Idoudi ( Hanen.Idoudi@ensi.rnu.tn ), or\nEsmiralda Moradian ( moradian@kth.se ).\n\n\nGENERAL INFORMATION:\n\nSAM is an international conference that serves researchers, scholars,\nprofessionals, students, and academicians who are looking to both foster\nworking relationships and gain access to the latest research results.\nIt is being held jointly (same location and dates) with a number of\nother research conferences; namely, The 2013 World Congress in Computer\nScience, Computer Engineering, and Applied Computing (WORLDCOMP). The\nCongress is the largest annual gathering of researchers in computer\nscience, computer engineering and applied computing. We anticipate to\nhave 2,100 or more attendees from over 85 countries.\n\nThe 2013 Congress will be composed of research presentations, keynote\nlectures, invited presentations, tutorials, panel discussions, and\nposter presentations. In recent past, keynote/tutorial/panel speakers\nhave included: Prof. David A. Patterson (pioneer, architecture, U. of\nCalifornia, Berkeley), Dr. K. Eric Drexler (known as Father of\nNanotechnology), Prof. John H. Holland (known as Father of Genetic\nAlgorithms; U. of Michigan), Prof. Ian Foster (known as Father of Grid\nComputing; U. of Chicago & ANL), Prof. Ruzena Bajcsy (pioneer, VR, U.\nof California, Berkeley), Prof. Barry Vercoe (Founding member of MIT\nMedia Lab, MIT), Dr. Jim Gettys (known as X-man, developer of X Window\nSystem, xhost; OLPC), Prof. John Koza (known as Father of Genetic\nProgramming, Stanford U.), Prof. Brian D. Athey (NIH Program Director,\nU. of Michigan), Prof. Viktor K. Prasanna (pioneer, U. of Southern\nCalifornia), Dr. Jose L. Munoz (NSF Program Director and Consultant),\nProf. Jun Liu (pioneer, Broad Institute of MIT & Harvard U.),\nProf. Lotfi A. Zadeh (Father of Fuzzy Logic), Dr. Firouz Naderi (Head,\nNASA Mars Exploration Program/2000-2005 and Associate Director, Project\nFormulation & Strategy, Jet Propulsion Lab, CalTech/NASA; Director,\nNASA's JPL Solar System Exploration), Prof. David Lorge Parnas (Fellow\nof IEEE, ACM, RSC, CAE, GI; Dr.h.c.: ETH Zurich, Prof. Emeritus,\nMcMaster U. and U. of Limerick), Prof. Eugene H. Spafford (Executive\nDirector, CERIAS and Professor, Purdue University), Dr. Sandeep\nChatterjee (Vice President & Chief Technology Officer, SourceTrace\nSystems, Inc.), Prof. Haym Hirsh (Rutgers University, New Jersey, USA\nand former director of Division of Information and Intelligent Systems,\nNational Science Foundation, USA), Dr. Flavio Villanustre (Vice-\nPresident, HPCC Systems), and many other distinguished speakers. To\nget a feeling about the Congress's atmosphere, see the 2012 delegates\nphotos available at: http://infinitydempsey.smugmug.com/WorldComp \n\nAn important mission of the Congress is \"Providing a unique platform for\na diverse community of constituents composed of scholars, researchers,\ndevelopers, educators, and practitioners. The Congress makes concerted\neffort to reach out to participants affiliated with diverse entities\n(such as: universities, institutions, corporations, government agencies,\nand research centers/labs) from all over the world. The Congress also\nattempts to connect participants from institutions that have teaching as\ntheir main mission with those who are affiliated with institutions that\nhave research as their main mission. The Congress uses a quota system to\nachieve its institution and geography diversity objectives.\"\n\nOne main goal of the Congress is to assemble a spectrum of affiliated\nresearch conferences, workshops, and symposiums into a coordinated\nresearch meeting held in a common place at a common time. This model\nfacilitates communication among researchers in different fields of\ncomputer science, computer engineering, and applied computing. The\nCongress also encourages multi-disciplinary and inter-disciplinary\nresearch initiatives; ie, facilitating increased opportunities for\ncross-fertilization across sub-disciplines.\n\n\nCONTACT:\n\nInquiries should be sent to: daimikj@udmercy.edu \n\n=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=\n\nThis email was sent to:  foaad@calpoly.edu \n\nTo opt out of this email list: \nhttp://world-comp.org/cgi-bin/rm/full.cgi?08696a75-4b61-49a8-bc69-dce167aa057d \n\n",
    "attachments": []
}