{
    "subject": "Call For Papers: The 2015 World Congress in CS, CE, and Applied Computing (July 27-30, 2015, Las Vegas, USA); submission deadline: March 31",
    "from": "Computer Science <wcom@world-comp.org>",
    "to": "foaad@calpoly.edu",
    "cc": null,
    "bcc": null,
    "date": "Fri, 06 Feb 2015 11:29:05 -0500",
    "body": "                         CALL  FOR  PAPERS\n              Paper Submission Deadline: March 31, 2015\n\n             The 2015 World Congress in Computer Science,\n             Computer Engineering, and Applied Computing\n\n         July 27-30, 2015, Monte Carlo Resort, Las Vegas, USA\n                            WORLDCOMP'15\n              http://www.world-academy-of-science.org/\n++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++\n\nYou are invited to submit a paper for consideration. All accepted papers\nwill be published in printed conference books/proceedings (ISBN) and will\nalso be made available online. The proceedings will be indexed in science\ncitation databases that track citation frequency/data. In addition, like\nprior years, extended versions of selected papers (about 35%) of the\nconference will appear in journals and edited research books (publishers\ninclude: Springer, Elsevier, BMC, and others); some of these books and\njournal special issues have already received the top 25% downloads in\ntheir respective fields. See the link below for a very small subset of\nthe books published mostly based on extended versions of the accepted\npapers of this congress:\nhttp://www.worldacademyofscience.org/worldcomp15/ws/publications \nThe titles of proceedings of the federated congress have been indexed into\nthe ACM Digital Library ( http://dl.acm.org/ ) which includes bibliographic\ncitations from major publishers in computing.\n\nThe Congress is composed of a number of tracks (joint-conferences, tutorials,\nsessions, workshops, poster and panel discussions); all will be held\nsimultaneously, same location and dates: July 27-30, 2015. For the complete\nlist of joint conferences, see below.\n\n\nIMPORTANT DATES:\n\nMarch 31, 2015:    Submission of full papers (about 7 pages)\nApril 24, 2015:    Notification of acceptance (+/- two days)\nMay 15, 2015:      Final papers + Copyright + Registration\nJuly 27-30, 2015:  The 2015 World Congress in Computer Science, Computer\n                   Engineering, and Applied Computing\n                   (including all affiliated federated conferences).\n                   http://www.world-academy-of-science.org/ \n\nSUBMISSION OF DRAFT PAPERS FOR EVALUATION:\n\nProspective authors are invited to submit their papers by uploading them\nto the evaluation web site at:  http://world-comp.org . Submissions must\nbe uploaded by the due date (see IMPORTANT DATES) and must be in either\nMS doc or pdf formats (about 7 pages including all figures, tables, and\nreferences.) All reasonable typesetting formats are acceptable (later,\nthe authors of accepted papers will be asked to follow a particular\ntypesetting format to prepare their final papers for publication; these\nformatting instructions appear at: http://world-comp.org and they conform\nto the two-column IEEE style format). Papers must not have been previously\npublished or currently submitted for publication elsewhere. The first\npage of the paper should include: title of the paper, name, affiliation,\npostal address, and email address for each author as well as a maximum\nof 5 topical keywords that would best represent the content of the paper.\nThe first page should also identify the name of the Contact/Corresponding\nauthor together with his/her professional email address. A 100 to\n150-word abstract should appear on the first page. Authors are to\nconform to the common CODE OF ETHICS FOR AUTHORS (The document for the\nCode of Ethics is available on the submission web site.)\n\nEach paper will be peer-reviewed by two experts in the field for\noriginality, significance, clarity, impact, and soundness. In cases of\ncontradictory recommendations, a member of the conference program\ncommittee would be charged to make the final decision (accept/reject);\noften, this would involve seeking help from additional referees. Papers\nwhose authors include a member of the conference program committee will\nbe evaluated using the double-blinded review process. (Essay/philosophical\npapers will not be refereed but may be considered for discussion/panels).\n\nThe proceedings will be published in printed conference books (ISBN) and\nwill also be made available online. The printed proceedings/books will\nbe available for distribution on site at the conference. The proceedings\nwill be indexed in science citation databases that track citation\nfrequency/data for each published paper. The proceedings/books of this\ncongress have been evaluated for inclusion into major science citation\nindex databases. We are happy to report that so far, the evaluation\nboard of science citation index databases have approved the indexing,\nintegrating, and inclusion of the following conference tracks into\nrelevant indexing databases (indexing databases include, among others:\nScopus, Engineering Village, EMBASE, and others): BIOCOMP, DMIN, GCA,\nICAI, ICOMP, ICWN, IKE, IPCV, PDPTA, and SAM.  All proceedings are also\napproved for inclusion into EBSCO (www.ebsco.com), one of the largest\nsubject index systems.\n\nIn addition to the above, we have arranged two new book series (multiple\nbooks in each series); one with Elsevier publishers (Emerging Trends in\nComputer Science and Applied Computing) and another with Springer publishers\n(Transactions of Computational Science and Computational Intelligence).\nAfter the conference (the process may take 12 to 18 months), a significant\nnumber of authors of accepted papers of our congress, will be given the\nopportunity to submit the extended version of their papers for publication\nconsideration in these books. We anticipate having between 10 and 20 books\na year in each of these book series projects. Each book in each series\nwill be subject to Elsevier and Springer science indexing products (which\nincludes: Scopus, www.info.scopus.com; SCI Compendex, Engineering Village,\nwww.ei.org; EMBASE, www.info.embase.com; and others). For a recent and a\nvery small subset of the books (and journal special issues) that have\nbeen published based on the extended versions of many of our congress\npapers, see the link below:\n\nhttp://www.worldacademyofscience.org/worldcomp15/ws/books_journals \n\n\nSUBMISSION OF POSTER PAPERS:\n\nPoster papers can be 2 pages long. Authors are to follow the same\ninstructions that appear above (see, SUBMISSION OF DRAFT PAPERS FOR\nEVALUATION) except that the submission is limited to 2 pages. On the\nfirst page, the author should state that \"This paper is being\nsubmitted as a poster\". Poster papers (if accepted) will be published\nas such, if and only if the author of the accepted poster wishes to\ndo so.\n\n\nLIST OF CONFERENCES (in no particular order):\n\no PDPTA'15:\n  The 21st International Conference on Parallel and Distributed Processing\n  Techniques and Applications\n\no DMIN'15:\n  The 11th International Conference on Data Mining\n\no IPCV'15:\n  The 19th International Conference on Image Processing, Computer Vision,\n  & Pattern Recognition\n\no ICAI'15:\n  The 17th International Conference on Artificial Intelligence\n\no SAM'15:\n  The 14th International Conference on Security and Management\n\no FECS'15:\n  The 11th International Conference on Frontiers in Education: Computer\n  Science and Computer Engineering\n\no BIOCOMP'15:\n  The 16th International Conference on Bioinformatics & Computational\n  Biology\n\no ABDA'15:\n  The 2nd International Conference on Advances in Big Data Analytics\n\no SERP'15:\n  The 13th International Conference on Software Engineering Research and\n  Practice\n\no EEE'15:\n  The 14th International Conference on e-Learning, e-Business, Enterprise\n  Information Systems, and e-Government\n\no ICWN'15:\n  The 14th International Conference on Wireless Networks\n\no ICOMP'15:\n  The 16th International Conference on Internet Computing and Big Data\n\no HIMS'15:\n  International Conference on Health Informatics and Medical Systems\n\no BIOENG'15:\n  International Conference on Biomedical Engineering and Science\n\no CSC'15:\n  The 13th International Conference on Scientific Computing\n\no MSV'15:\n  The 12th International Conference on Modeling, Simulation and\n  Visualization Methods\n\no ESA'15:\n  The 13th International Conference on Embedded Systems and Applications\n\no FCS'15:\n  The 11th International Conference on Foundations of Computer Science\n\no IKE'15:\n  The 14th International Conference on Information & Knowledge Engineering\n\no GCA'15:\n  The 11th International Conference on Grid & Cloud Computing and\n  Applications\n\nJuly 27-30, 2015, Monte Carlo Resort, Las Vegas, USA.\n\nAll conferences listed above will be held simultaneously; i.e., same location\nand dates.\n\n\nMEMBERS OF PROGRAM AND ORGANIZING COMMITTEES:\n\nCurrently being finalized. The members of the Steering Committee of the\nlast offerings of the congress included: Dr. Selim Aissi, (formerly: Chief\nStrategist - Security, Intel Corporation, USA) Vice President, Global\nInformation Security, Visa Inc., USA; Prof. Nizar Al-Holou, Professor and\nDepartment Chair, and Vice Chair of IEEE/SEM-Computer Chapter, University\nof Detroit Mercy, Detroit, Michigan, USA; Prof. Hamid R. Arabnia, Professor\nof Computer Science, Elected Fellow of ISIBM, Editor-in-Chief of Journal\nof Supercomputing (Springer), University of Georgia, USA; Prof. Mary\nMehrnoosh Eshaghian-Wilner, Professor of Engineering Practice, University\nof Southern California, USA (and Adjunct Professor, University of\nCalifornia Los Angeles, UCLA, USA); Prof. Shiuh-Jeng Wang, Department of\nInformation Management, Central Police University, Taiwan and Program\nChair, Security & Forensics, Taiwan and Director, Information Crypto\nand Construction Lab (ICCL) & ICCL-FROG; Prof. Michael Panayiotis Bekakos,\nProfessor of Computer Systems and Director of Laboratory of Digital\nSystems and Head of Parallel Algorithms and architectures Research Group,\nDemocritus University of Thrace, Greece; Prof. Kevin Daimi, Professor of\nComputer Science and Director of Computer Science and Software Engineering\nPrograms, University of Detroit Mercy, Detroit, Michigan, USA; Prof.\nPatrick S. P. Wang, Fellow of IAPR, ISIBM, WASE and Professor of Computer\nand Information Science, Northeastern University, Boston, Massachusetts,\nUSA and Otto-von-Guericke Distinguished Guest Professor, University\nMagdeburg, Germany; Prof. George Jandieri, Georgian Technical University,\nTbilisi, Georgia and Chief Scientist at The Institute of Cybernetics,\nGeorgian Academy of Science, Georgia; Prof. D. V. Kodavade, Head of\nComputer Science and Engineering, DKTE Institute, India; Prof. George\nMarkowsky, Professor and Associate Director, School of Computing and\nInformation Science, Chair Int'l Advisory Board of IEEE IDAACS, Director\n2013 Northeast Collegiate Cyber Defense Competition, University of Maine,\nOrono, Maine, USA; Prof. G. N. Pandey, Vice-Chancellor, Arunachal\nUniversity of Studies, India (and Adjunct Professor, Indian Institute of\nInformation Technology, India); Prof. James J. (Jong Hyuk) Park, Professor\nof Computer Science and Engineering, Seoul, Korea and President of KITCS,\nPresident of FTRA, Editor-in-Chief of HCIS, JoC and IJITCC Journals;\nProf. Fernando G. Tinetti, Universidad Nacional de La Plata, Argentina,\nCo-editor, Journal of CS and Technology (JCS&T); Dr. Predrag Tosic,\nMicrosoft, Washington, USA; Prof. Vladimir Volkov, The Bonch-Bruevich\nState University of Telecommunications, Saint-Petersburg, Russia;\nDr. Michael R. Grimaila, Air Force Institute of Technology, Fellow of\nISSA, CISM, CISSP, IAM/IEM, Air Force Center of Cyberspace Research,\nAdvisor to the Prince of Wales Fellows & Prince Edward Fellows at MIT\nand Harvard Universities and PC member of NATO Cooperative Cyber Defence\nCentre of Excellence (CCD COE); Prof. Victor Malyshkin, Head of\nSupercomputer Software Department, Russian Academy of Sciences, Russia;\nProf. Andy Marsh, Director of HoIP, Director of HoIP Telecom, UK,\nand Secretary-General of WABT and Vice-president of ICET, Visiting\nProfessor, University of Westminster, UK; Ashu M. G. Solo, Fellow of\nBritish Computer Society, Principal R&D Engineer, Maverick Technologies\nAmerica; Prof. Sang C. Suh, Head and Professor of Computer Science,\nVice President, of Society for Design and Process Science (SDPS), Director\nof Intelligent Cyberspace Engineering (ICEL), Texas A&M University,\nCom., Texas, USA; Prof. Layne T. Watson, IEEE Fellow, NIA Fellow,\nISIBM Fellow, Fellow of The National Institute of Aerospace, Virginia\nPolytechnic Institute & State University, Virginia, USA; Prof. Mary Q.\nYang, Director, Mid-South Bioinformatics Center and Joint Bioinformatics\nPh.D. Program, University of Arkansas, USA; Prof. Byung-Gyu Kim, Multimedia\nProcessing Communications Lab.(MPCL), SunMoon University, South Korea;\nProf. Young-Sik Jeong, Editor-in-Chief of Journal of Information Processing\nSystems (JIPS), Dongguk University, Seoul, South Korea; and others.\n\nThe 2015 Program Committee for individual conferences are currently being\ncompiled. Many who have already joined the committees are renowned leaders,\nscholars, researchers, scientists and practitioners of the highest ranks;\nmany are directors of research labs., fellows of various societies, heads/\nchairs of departments, program directors of research funding agencies, as\nwell as deans and provosts.\n\nProgram Committee members are expected to have established a strong and\ndocumented research track record. Those interested in joining the Program\nCommittee should email editor@world-comp.org  the following information\nfor consideration: Name, affiliation and position, complete mailing address,\nemail address, a one-page biography that includes research expertise & the\nname of the conference(s) offering to help with.\n\n\nGENERAL INFORMATION:\n\nThe Congress will be composed of research presentations, keynote lectures,\ninvited presentations, tutorials, panel discussions, and poster\npresentations. In recent past, keynote/tutorial/panel speakers have\nincluded: Prof. David A. Patterson (pioneer, architecture, U. of California,\nBerkeley), Dr. K. Eric Drexler (known as Father of Nanotechnology),\nProf. John H. Holland (known as Father of Genetic Algorithms; U. of\nMichigan), Prof. Ian Foster (known as Father of Grid Computing; U. of\nChicago & ANL), Prof. Ruzena Bajcsy (pioneer, VR, U. of California,\nBerkeley), Prof. Barry Vercoe (Founding member of MIT Media Lab, MIT),\nDr. Jim Gettys (known as X-man, developer of X Window System, xhost;\nOLPC), Prof. John Koza (known as Father of Genetic Programming, Stanford\nU.), Prof. Brian D. Athey (NIH Program Director, U. of Michigan),\nProf. Viktor K. Prasanna (pioneer, U. of Southern California), Dr. Jose\nL. Munoz (NSF Program Director and Consultant), Prof. Jun Liu (pioneer,\nBroad Institute of MIT & Harvard U.), Prof. Lotfi A. Zadeh (Father of\nFuzzy Logic), Dr. Firouz Naderi (Head, NASA Mars Exploration Program/\n2000-2005 and Associate Director, Project Formulation & Strategy, Jet\nPropulsion Lab, CalTech/NASA; Director, NASA's JPL Solar System\nExploration), Prof. David Lorge Parnas (Fellow of IEEE, ACM, RSC, CAE, GI;\nDr.h.c.: ETH Zurich, Prof. Emeritus, McMaster U. and U. of Limerick),\nProf. Eugene H. Spafford (Executive Director, CERIAS and Professor, Purdue\nUniversity), Dr. Sandeep Chatterjee (Vice President & Chief Technology\nOfficer, SourceTrace Systems, Inc.), Prof. Haym Hirsh (Dean, Cornell\nUniversity - formerly at Rutgers University, New Jersey, USA and former\ndirector of Division of Information and Intelligent Systems, National\nScience Foundation, USA), Dr. Flavio Villanustre (Vice-President, HPCC\nSystems), Prof. Victor Raskin (Distinguished Professor, Purdue University,\nUSA); Prof. Alfred Inselberg (School of Mathematical Sciences, Tel Aviv\nUniversity, Israel; Senior Fellow, San Diego Supercomputing Center;\nInventor of the multidimensional system of Parallel Coordinates and\nauthor of textbook); Prof. H. J. Siegel (Abell Endowed Chair Distinguished\nProfessor of ECE and Professor of CS; Director, CSU Information Science\nand Technology Center (ISTeC), Colorado State University, Colorado, USA);\nProf. Amit Sheth (Fellow of IEEE and LexisNexis Eminent Scholar;\nFounder/Executive Director, Ohio Center of Excellence in Knowledge-enabled\nComputing (Kno.e.sis) and Professor of Computer Science, Wright State\nUniversity, Ohio, USA); Dr. Leonid I. Perlovsky (Harvard University,\nCambridge, Massachusetts, USA and School of Engineering and Applied\nSciences and Medical School Athinoula Martinos Brain Imaging Center; and\nThe US Air Force Research Lab., USA; CEO, LP Information Technology, USA\nand Chair of IEEE Task Force on The Mind and Brain; Recipient of John\nMcLucas Award, the highest US Air Force Award for basic research);\nand many other distinguished speakers. The Congress is among the top five\nlargest annual gathering of researchers in computer science, computer\nengineering and applied computing. We anticipate to have attendees from\nabout 85 countries/territories. To get a feeling about the conferences'\natmosphere, see some delegates photos available at:\n\nhttp://worldcomp.phanfare.com/\nhttp://worldcomp.phanfare.com/6626396 (to see a slide show, click on\n\"Start SlideShow\" tab at the url above.)\n\nAn important mission of The Congress is \"Providing a unique platform for\na diverse community of constituents composed of scholars, researchers,\ndevelopers, educators, and practitioners. The Congress makes concerted\neffort to reach out to participants affiliated with diverse entities\n(such as: universities, institutions, corporations, government agencies,\nand research centers/labs) from all over the world. The congress also\nattempts to connect participants from institutions that have teaching as\ntheir main mission with those who are affiliated with institutions that\nhave research as their main mission. The congress uses a quota system to\nachieve its institution and geography diversity objectives.\"\n\nOne main goal of the congress is to assemble a spectrum of affiliated\nresearch conferences, workshops, and symposiums into a coordinated\nresearch meeting held in a common place at a common time. This model\nfacilitates communication among researchers in different fields of computer\nscience, computer engineering, and applied computing. The Congress also\nencourages multi-disciplinary and inter-disciplinary research initiatives;\ni.e., facilitating increased opportunities for cross-fertilization across\nsub-disciplines. 138939\n\nMEASURABLE SCIENTIFIC IMPACT OF CONGRESS:\n\nAs of December 8, 2014, papers published in the conference proceedings\nthat have been held as part of this congress, have received over\n27,878 citations (includes 3,346 self-citations). Citation data is\nobtained from Microsoft Academic Search. The citation data does not\neven include more than 15,000 other citations to papers in conferences\nwhose first offerings were initiated by worldcomp. Individual proceedings/\nbooks (2013 & 2014) of the federated congress can be purchased from major\nscience book distributors: (such as: EBSCO and others):\nhttp://www.worldacademyofscience.org/worldcomp14/ws/proceedings\nhttp://www.worldacademyofscience.org/worldcomp13/ws/proceedings\n\n\nMISCELLANEOUS:\nThe information that appears in this announcement is correct as of\nJanuary 1, 2015.\n\nCONTACT:\nInquiries should be sent to: sc@world-comp.org\n\n=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=\n\nThis email was sent to:  foaad@calpoly.edu \n\nTo opt out of this email list: \nhttp://world-comp.org/cgi-bin/rm/full.cgi?08696a75-4b61-49a8-bc69-dce167aa057d \n\n",
    "attachments": []
}