{
    "subject": "Call for Paper",
    "from": "ICECCE 2020 <icecce.conf@gmail.com>",
    "to": "foaad@calpoly.edu",
    "cc": null,
    "bcc": null,
    "date": "Wed, 23 Oct 2019 22:21:25 +0000",
    "body": "\n\n\n2nd International Conference on Electrical, Communication and Computer Engineering\n\n(ICECCE-2020)\n\nIstanbul, Turkey\n\n14-15 April, 2020\n\nhttp://www.icecce.com\n\n\n\nDear Authors,\n\nWe cordially invite you to attend and submit your papers for the IEEE International \nConference on Electrical, Communication, and Computer Engineering (ICECCE 2020), \nwhich will take place at Bilek Hotel, Istanbul, Turkey on 14-15 April 2020. \nThe event will be highly international with the technical collaboration of \nGazi University, Ankara, Turkey, Aksaray University, Turkey, University of \nBuner, Pakistan, International Islamic University Islamabad, Pakistan, and \nIEEE Turkey section.\n\nThis two-day conference will be held at the beautiful city of Istanbul. ICECCE \n2020 aims to bring together leading academic and industrial researchers, scientists, \nengineers and practitioners to exchange the latest research ideas, methods, \nresults, and share experiences, on all theoretical, experimental and applied \naspects of Electrical, Communication and Computer Engineering. ICECCE 2020 \nwill provide a unique interdisciplinary and multidisciplinary forum for researchers, \npractitioners and educators to present and discuss the most recent innovations, \ntrends, practical challenges encountered and intelligent solutions adopted \nin their respective fields\n\nThe conference covers many topics under areas of Electrical, Communication \nand Computer Engineering and can be seen at http://www.icecce.com.\n\nWe shall be looking forward to your paper contributions and participation. \nWe hope that attending the conference will provide an opportunity to meet academic \nand industry experts to exchange ideas about the latest technologies. We are \nsure that your stay in the beautiful and historic city of Istanbul will be \nvery pleasant and enjoyable.\n\nImportant Dates:\nPaper Due : 15th January, 2020Acceptance Notification : 15th February, 2020Camera \nReady Due : 1st March, 2020\n\nRegistration Deadline:\nEarly Bird : 20th February, 2020\n\nConference Dates:\n14th -15th April 2020\n\nVenue:Bilek Hotel, Istanbul, Turkey\n\nPaper Submission:\nhttps://easychair.org/conferences/?conf=icecce2020\n\nhttp://www.icecce.com/call-for-papers/\n\n\n\nRegards,\nConference Organizing Team,ICECCE 2020http://www.icecce.com\n\n\n\nLet us meet in the heart of Istanbul, the magnificent city with unique beauty, \nhistory, culture, and international lifestyle, in addition to bringing two \ncontinents together!\n\nContact us:\nAthar WaseemConference Executive ChairE-mail: athar.waseem@iiu.edu.pk Phone: \n+92 334 8677790\n\nDr. Yunus UZUNConference Technical ChairE-mail: yunusuzun38@hotmail.com Phone: \n+90 532 6425237\n\n\n\nUnsubscribe\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n2nd \n      International Conference on Electrical, Communication and Computer \n      Engineering\n(ICECCE-2020)\nIstanbul, Turkey\n14-15 April, 2020\nhttp://www.icecce.com\n\n\n\nDear Authors,\nWe cordially invite you to attend and \n      submit your papers for the  International Conference on \n      Electrical, Communication, and Computer Engineering (ICECCE \n      2020), which will take place at Bilek Hotel, Istanbul, Turkey on \n      14-15 April 2020. The event will be highly international with the \n      technical collaboration of Gazi University, Ankara, Turkey, Aksaray \n      University, Turkey, University of Buner, Pakistan, International Islamic \n      University Islamabad, Pakistan, and IEEE Turkey section.\nICECCE 2020 aims to bring together leading \n      academic and industrial researchers, scientists, engineers and \n      practitioners to exchange the latest research ideas, methods, results, and \n      share experiences, on all theoretical, experimental and applied aspects of \n      Electrical, Communication and Computer Engineering. ICECCE 2020 will \n      provide a unique interdisciplinary and multidisciplinary forum for \n      researchers, practitioners and educators to present and discuss the most \n      recent innovations, trends, practical challenges encountered and \n      intelligent solutions adopted in their respective fields\nThe conference covers many topics under \n      areas of Electrical, Communication and Computer Engineering and can be \n      seen at http://www.icecce.com.\nWe shall be looking forward to your paper \n      contributions and participation. We hope that attending the conference \n      will provide an opportunity to meet academic and industry experts to \n      exchange ideas about the latest technologies. We are sure that your stay \n      in the beautiful and historic city of Istanbul will be very pleasant and \n      enjoyable.\nImportant \n      Dates:Paper Due : \n      15th January, 2020Acceptance Notification : 15th February, \n      2020Camera Ready Due : \n      1st March, 2020\nRegistration \n      Deadline: Early Bird : \n      20th February, 2020\nConference \n      Dates:14th -15th \n      April 2020\nVenue:\nBilek Hotel, Istanbul, Turkey\nPaper \n      Submission:https://easychair.org/conferences/?conf=icecce2020\nhttp://www.icecce.com/call-for-papers/\n \nRegards,Conference \n      Organizing Team,ICECCE 2020http://www.icecce.com\n   \nLet us \n      meet in the heart of Istanbul, the magnificent city with unique beauty, \n      history, culture, and international lifestyle, in addition to bringing two \n      continents together!\n Unsubscribe\n\n \n \n",
    "attachments": []
}