{
    "subject": "Call for Papers",
    "from": "\"amor21345678@yahoo.com\" <amor21345678@yahoo.com>",
    "to": "\"jea.aripd@gmail.com\" <jea.aripd@gmail.com>",
    "cc": null,
    "bcc": null,
    "date": "Sun, 06 Oct 2019 06:16:27 +0000",
    "body": "\nCallfor Papers\n\nJournalof Engineering and Architecture\n\nISSN:2334-2986 (Print) 2334-2994 (Online)\n\nJournalof Engineering and Architecture is an international peer-reviewed journal. The journal isnot limited to a specific aspect of engineering and architecture but is insteaddevoted to a wide range of subfields in the engineering sciences andarchitecture. Articles of interdisciplinary nature are particularly welcome.The journal strives to maintain high quality of publications. There will be acommitment to expediting the time taken for the publication of the papers. Theeditorial board reserves the right to reject papers without sending them outfor review. The journal also publishes innovative contributions on every aspectof architectural endeavor.\n\nThejournal is published by the American Research Institute for Policy Developmentthat serves as a focal point for academicians, professionals, graduate and undergraduatestudents, fellows, and associates pursuing research throughout the world.\n\nTheinterested contributors are highly encouraged to submit theirmanuscripts/papers to the executive editor via e-mail at editor@aripd.org. Please indicate thename of the journal (Journal of Engineering and Architecture) in the coverletter or simply put Journal of Engineering and Architecture in the subjectbox during submission via e-mail. \n\nThe journal isAbstracted/Indexed in CrossRef, CrossCheck, Cabell's, Ulrich's, GriffithResearch Online, Google Scholar, Education.edu, Informatics, Universe DigitalLibrary, Standard Periodical Directory, Gale, Open J-Gate, EBSCO, Journal Seek,DRJI, ProQuest, BASE, InfoBase Index, OCLC, IBSS, Academic Journal Databases,Scientific Index.\n\nE-Publication FirstTM\n\nE-PublicationFirstTM is a feature offered through our journal platform. It allowsPDF version of manuscripts that have been peer reviewed and accepted, to behosted online prior to their inclusion in a final printed journal. Readers canfreely access or cite the article. The accepted papers are published onlinewithin one week after the completion of all necessary publishing steps.\n\nDOI number\n\nEachpaper published in Journal of Engineering and Architecture is assigned a DOInumber, which appears beneath the author's affiliation in the published paper. \n\nJEAis inviting papers for Vol. 7, No. 2. The online publication date is December31, 2019. Submission Deadline: October 31, 2019. \n\nFor any additionalinformation, please contact with the executive editor at editor@aripd.org \n\nRegards,\n\nDr. David Grau,Arizona State University, USA. \n\nEditor-in-Chief\n\nJournal ofEngineering and Architecture \n\nWebsite: www.jea-net.com \n\n________________\n\nN. B. To unsubscribe,forward this email to info@aripd.org with'Unsubscribe' in the subject line.\n\n\nCall\nfor Papers\nJournal\nof Engineering and Architecture\nISSN:\n2334-2986 (Print) 2334-2994 (Online)\nJournal\nof Engineering and Architecture is an international peer-reviewed journal. The journal is\nnot limited to a specific aspect of engineering and architecture but is instead\ndevoted to a wide range of subfields in the engineering sciences and\narchitecture. Articles of interdisciplinary nature are particularly welcome.\nThe journal strives to maintain high quality of publications. There will be a\ncommitment to expediting the time taken for the publication of the papers. The\neditorial board reserves the right to reject papers without sending them out\nfor review. The journal also publishes innovative contributions on every aspect\nof architectural endeavor.\nThe\njournal is published by the American Research Institute for Policy Development\nthat serves as a focal point for academicians, professionals, graduate and undergraduate\nstudents, fellows, and associates pursuing research throughout the world.\nThe\ninterested contributors are highly encouraged to submit their\nmanuscripts/papers to the executive editor via e-mail at editor@aripd.org. Please indicate the\nname of the journal (Journal of Engineering and Architecture) in the cover\nletter or simply put Journal of Engineering and Architecture in the subject\nbox during submission via e-mail.  \nThe journal is\nAbstracted/Indexed in CrossRef, CrossCheck, Cabell's, Ulrich's, Griffith\nResearch Online, Google Scholar, Education.edu, Informatics, Universe Digital\nLibrary, Standard Periodical Directory, Gale, Open J-Gate, EBSCO, Journal Seek,\nDRJI, ProQuest, BASE, InfoBase Index, OCLC, IBSS, Academic Journal Databases,\nScientific Index.\nE-Publication FirstTM\nE-Publication\nFirstTM is a feature offered through our journal platform. It allows\nPDF version of manuscripts that have been peer reviewed and accepted, to be\nhosted online prior to their inclusion in a final printed journal. Readers can\nfreely access or cite the article. The accepted papers are published online\nwithin one week after the completion of all necessary publishing steps.\nDOI number\nEach\npaper published in Journal of Engineering and Architecture is assigned a DOI\nnumber, which appears beneath the author's affiliation in the published paper. \nJEA\nis inviting papers for Vol. 7, No. 2. The online publication date is December\n31, 2019. Submission Deadline: October 31, 2019.  \nFor any additional\ninformation, please contact with the executive editor at editor@aripd.org \nRegards,\nDr. David Grau,\nArizona State University, USA. \nEditor-in-Chief\nJournal of\nEngineering and Architecture \nWebsite: www.jea-net.com \n________________\nN. B. To unsubscribe,\nforward this email to info@aripd.org  with\n'Unsubscribe' in the subject line.",
    "attachments": []
}