{
    "subject": "Conference on Artificial Intelligence (ICAI 2012) - reviews about your paper - re-sending",
    "from": "Steering Committee <sc@world-comp.org>",
    "to": "foaad@calpoly.edu",
    "cc": null,
    "bcc": null,
    "date": "Sun, 13 May 2012 15:23:43 -0400",
    "body": "\nDear Dr. Foaad Khosmood:\n\n(We are re-sending this email - our earlier attempt had bounced back; the reason\nfor the bounce was that a mediator server had assigned 87 points for the use of\nHOT words/terms/attachments that appeared in our earlier email and so wrongly\ndetermined that that message was spam - we are sending this email with the\nhope that you will receive it this time since we included the reviews as text,\ninstead of attachment, and also we have tried to avoid using too many HOT terms.)\n\nYou will find the reviews of the following accepted submission in this email.\n\nICA3949\nComparison of Sentence-level Paraphrasing Approaches for Statistical Style Transformation\nFoaad Khosmood\nCalifornia Polytechnic State University, California, USA\n\nAccepted for the following conference:\n14th International Conference on Artificial Intelligence (ICAI'12: July 16-19,\n2012, USA).\nhttp://www.worldacademyofscience.org/worldcomp12/ws/conferences/icai12\n\nTrack Chair: 181\nReferees' Reports: (Some authors may also receive the same evaluation\n     report directly from the track chair who arranged the evaluation.)\n\n     Originality (1 Poor - 20 Very Good): 18\n     Technical Quality (1 Poor - 20 Very Good): 15\n     Significance of Contribution (1 Poor - 20 Very Good): 16\n     Readability and Organization (1 Poor - 20 Very Good): 17\n     Relevance (1 Not relevant - 20 Very relevant): 20\n     Overall Recommendation (1 Reject - 20 Strong Accept): 16\n     Degree of Expertise of Reviewer in the topic (1 Poor - 20 Good): 18\n     Specific Comment to the Authors:\n\n     a> This is a concise paper - I very much liked it and learned from it.\n     a> I recommend its acceptance without hesitation. Dr. Foaad presents in this paper\n     a> six distinct English-language sentence paraphrasing techniques. He then describes\n     a> the basic algorithm for each and score them on precision and recall using 50\n     a> random sentences from project Tatoeba. His main objective is to use these\n     a> techniques for style transformation. Quite enlightening. There is novelty in his\n     a> study. I would have liked to see a more in-depth presetation in section III\n     a> (on Methodology).\n\n     b> I nominate ACCEPT for this paper. The information provided in Table 3 and\n     b> Figure 3 are a little fuzzy - a more detailed explanation would help.\n     b> The reference list is good and relevant (as well as being uptodate).\n\nFor information regarding author instructions including:\n\n- Presentation Formats / Accepted Paper Categories\n- Typing Instructions\n- Deadline (registration and camera-ready papers due: May 19, 2012);\n  We strongly encourage authors to register as soon as possible.\n  (Please note that the deadline that appears on the conference web site is\n  May 16th - however, since this notification was sent 3 days late, we\n  have extended the deadline for this paper to May 19).\n- Conference Registration\n- Hotel Reservation\n- Conference Program/Schedule\nPlease visit:\nhttp://www.worldacademyofscience.org/worldcomp12/ws/authors\n\nFor Submission (uploading) of Final Camera-Ready Papers for Publication\nin the Conference Proceedings/book, please visit:\nhttp://www.ucmss.com/cr/main/papersNew/worldcomp12_first_html\n\nTo Request Invitation Letters for US Visa Purposes, please visit:\nhttp://www.ucmss.com/cr/main/invitations/worldcomp_index_html\n\nGeneral information can be found at:\nhttp://www.world-academy-of-science.org/\n\nCongratulations, and thank you for your contribution to the Conference.\nWe look forward to seeing you at the conference in July.\n\nKind regards,\nSteering Committee, ICAI 2012\nhttp://www.worldacademyofscience.org/worldcomp12/ws/conferences/icai12\n",
    "attachments": []
}