{
    "subject": "Conference on Artificial Intelligence (ICAI 2012) - decision on your paper (ICA3949) ",
    "from": "Steering Committee <sc@world-comp.org>",
    "to": "foaad@calpoly.edu",
    "cc": "foaad@calpoly.edu",
    "bcc": null,
    "date": "Thu, 26 Apr 2012 09:47:17 -0400",
    "body": "Dear Dr. Foaad Khosmood: \n\nI am pleased to inform you that the following paper which you submitted to:\nThe 14th International Conference on Artificial Intelligence\n(ICAI'12: July 16-19, 2012, USA) has been accepted as a Regular Research\nPaper (RRP) - ie, accepted for both, publication in the proceedings and oral\nformal presentation.  Please see below for the categories of accepted papers.\n\nPaper ID #: ICA3949\nTitle: Comparison of Sentence-level Paraphrasing Approaches for Statistical Style Transformation\nAuthor(s): Foaad Khosmood\n\nNote: The \"paper ID #\" shown above is composed of three letters\n(conference prefix) followed by four numeral/digits. You will need to\nhave this \"Paper ID #\" at the time of registration and final paper\nsubmission (for publication).\n\n(The evaluation of this paper is arranged by Track Chair: 181)\n\nGeneral comments to authors of accepted papers:\n  1. Each paper was peer-reviewed by two experts in the field for\n     originality, significance, clarity, impact, and soundness. In cases\n     of contradictory recommendations, a member of the conference\n     program committee was charged to make the final decision\n     (accept/reject) - often, this involved seeking help from additional\n     referees by using a double-blinded review process. In addition, all\n     papers whose authors included a member of the conference program\n     committee were evaluated using the double-blinded review process.\n  2. Authors of accepted papers are strongly encouraged to enhance the\n     organization and the quality of the English writeup of their papers\n     before uploading them to the publication web site for the\n     preparation of the printed books/proceedings.\n  3. Authors whose papers have been accepted SUBJECT to MANDATORY changes\n     will receive the compiled referees' report in about 24 hours after\n     this email - The referee reports would be sent to Contact Authors\n     by either the corresponding track chair (who arranged the evaluation\n     of this paper) or by the steering committee. Authors who do not receive\n     an email within the next 24 hours should assume that their papers have\n     been accepted without mandatory changes (though, the referees' friendly\n     suggestions would also be emailed at a later time together with\n     the overall evaluation points/marks.)\n\nFor information regarding author instructions including:\n\n- Presentation Formats / Accepted Paper Categories\n- Typing Instructions\n- Deadline (registration and camera-ready papers due: May 16, 2012);\n  We strongly encourage authors to register as soon as possible.\n- Conference Registration\n- Hotel Reservation\n- Conference Program/Schedule\nPlease visit:\nhttp://www.worldacademyofscience.org/worldcomp12/ws/authors\n\nFor Submission (uploading) of Final Camera-Ready Papers for Publication\nin the Conference Proceedings/book, please visit:\nhttp://www.ucmss.com/cr/main/papersNew/worldcomp12_first_html\n\nTo Request Invitation Letters for US Visa Purposes, please visit:\nhttp://www.ucmss.com/cr/main/invitations/worldcomp_index_html\n\nGeneral information can be found at:\nhttp://www.world-academy-of-science.org/\n\nCongratulations, and thank you for your contribution to the Conference.\nWe look forward to seeing you at the conference in July.\n\nKind regards,\nSteering Committee, ICAI 2012\nps.\n-> ICAI'12 paper acceptance rate has been 26% (as of April 25, 2012); this does\n   not yet reflect the data for all individual sessions (ie, the acceptance rate\n   is likely to change).\n-> See the appended text for useful information about the conference.\n-> If at least one author of an accepted paper registers for the conference\n   but for some reason he/she is unable to attend the conference, then\n   his/her paper will be published and arrangements would be made to ship\n   the proceedings to the registered author after the conference. However,\n   the registered author MUST inform us by no later than June 1 that he/she\n   will not be able to attend.\n----------------------------------cut here---------------------------------\n\nPUBLICATION:\n\nProceedings of ICAI will be published in printed (ISBN) conference\nbooks/proceedings and will also be made available online. The proceedings\nwill be indexed in science citation databases that track citation\nfrequency/data for each paper; such databases include: Inspec / IET /\nThe Institute for Engineering and Technology; The French National Center\nfor Scientific Research, CNRS, INIST databases, PASCAL (covers the core\nscientific literature in Science; about 90% of inclusions are journals;\nonly about 9% are proceedings; this congress tracks are selected to be among\nthe 9% - accessable from INIST, Datastar, Dialog, EBSCO, OVID, Questel.Orbit,\nQwam, and STN International); and others. Though, there is no guarantee that\nthe proceedings will also be included in EI Compendex/Elsevier indexings, in\nthe past various tracks of ICAI were included in these databases.\nTherefore, we will also be sending the proceedings for indexing procedures\nto EI Compendex/Elsevier. The printed proceedings/books will be available\nfor distribution on site at the conference. Like prior years, extended\nversions of selected papers will appear in journals and edited research\nbooks (a large number of book projects and journal special issues are in\nthe pipeline: Springer, Elsevier, BMC journals, ...) Authors of selected\npapers will be given the opportunity to submit the extended versions of\ntheir papers for consideration; this process will start soon after October\n2012.\n\nGENERAL INFORMATION:\n\nICAI conference is being held jointly (same location and dates) with a\nnumber of other federated research conferences. This federated congress\nis the largest annual gathering of researchers in computer science, computer\nengineering and applied computing. We anticipate to have about 2,000\nattendees from over 80 countries. The congress will be composed of research\npresentations, keynote lectures, invited presentations, tutorials, panel\ndiscussions, and poster presentations. In recent past, keynote/tutorial/panel\nspeakers have included: Prof. David A. Patterson (pioneer, architecture, U.\nof California, Berkeley), Dr. K. Eric Drexler (known as Father of\nNanotechnology), Prof. John H. Holland (known as Father of Genetic Algorithms;\nU. of Michigan), Prof. Ian Foster (known as Father of Grid Computing; U. of\nChicago & ANL), Prof. Ruzena Bajcsy (pioneer, VR, U. of California, Berkeley),\nProf. Barry Vercoe (Founding member of MIT Media Lab, MIT), Dr. Jim Gettys\n(known as X-man, developer of X Window System, xhost; OLPC), Prof. John Koza\n(known as Father of Genetic Programming, Stanford U.), Prof. Brian D. Athey\n(NIH Program Director, U. of Michigan), Prof. Viktor K. Prasanna (pioneer, U.\nof Southern California), Dr. Jose L. Munoz (NSF Program Director and\nConsultant), Prof. Jun Liu (pioneer, Broad Institute of MIT & Harvard U.),\nProf. Lotfi A. Zadeh (Father of Fuzzy Logic), Dr. Firouz Naderi (Head, NASA\nMars Exploration Program/2000-2005 and Associate Director, Project Formulation\nand Strategy, Jet Propulsion Lab, CalTech/NASA; Director, NASA's JPL Solar\nSystem Exploration), Prof. David Lorge Parnas (Fellow of IEEE, ACM, RSC, CAE,\nGI; Dr.h.c.: ETH Zurich, Prof. Emeritus, McMaster U. and U. of Limerick),\nProf. Eugene H. Spafford (Executive Director, CERIAS and Professor, Purdue\nUniversity), Dr. Sandeep Chatterjee (Vice President & Chief Technology Officer,\nSourceTrace Systems, Inc.), and many other distinguished speakers. To get a\nfeeling about the conferences' atmosphere, see the 2011 delegates photos\navailable at: http://worldcomp.phanfare.com/5408606\n\nAn important mission of the congress is \"Providing a unique platform for a\ndiverse community of constituents composed of scholars, researchers, developers,\neducators, and practitioners. The Congress makes concerted effort to reach out\nto participants affiliated with diverse entities (such as: universities,\ninstitutions, corporations, government agencies, and research centers/labs)\nfrom all over the world. The congress also attempts to connect participants\nfrom institutions that have teaching as their main mission with those who are\naffiliated with institutions that have research as their main mission. The\ncongress uses a quota system to achieve its institution and geography diversity\nobjectives.\"\n\nOne main goal of the congress is to assemble a spectrum of affiliated research\nconferences, workshops, and symposiums into a coordinated research meeting held\nin a common place at a common time. This model facilitates communication among\nresearchers in different fields of computer science, computer engineering, and\napplied computing. The Congress also encourages multi-disciplinary and\ninter-disciplinary research initiatives; ie, facilitating increased\nopportunities for cross-fertilization across sub-disciplines.\n\n\nMEASURABLE SCIENTIFIC IMPACT OF PROCEEDINGS:\n\nThe conference proceedings enjoy a high number of citations. As of\nMarch 2012, papers published in each track of the proceedings have\nreceived the following number of citations: 252 citations to BIOCOMP\npapers; 116 to CDES papers; 65 to CGVR papers; 55 to CSC papers; 271 to\nDMIN papers; 69 to EEE papers; 1,286 to ERSA papers; 504 to ESA papers;\n176 to FCS papers; 9,408 to FECS papers; 157 to GCA papers; 75 to GEM\npapers; 2,172 to ICAI papers; 1,529 to ICOMP papers; 1,247 to ICWN papers;\n571 to IKE papers; 255 to IPCV papers; 137 to MSV papers; 5,239 to PDPTA\npapers; 496 to SAM papers; 1,390 to SERP papers; and 177 to SWWS papers.\nIn total, over 25,600 citations have been made (so far) to papers\npublished in the proceedings of this federated joint conferences. Refer\nto the URLs below to see the actual citation numbers (each is a link to\na live search and so it may take a few seconds for the data to pull up):\n\nhttp://academic.research.microsoft.com/Conference/1816/biocomp-bioinformatics-&-computational-biology\nhttp://academic.research.microsoft.com/Conference/1845/cdes-international-conference-on-computer-design/\nhttp://academic.research.microsoft.com/Conference/1852/cgvr-international-conference-on-computer-graphics-and-virtual-reality/\nhttp://academic.research.microsoft.com/Conference/1887/csc-international-conference-on-scientific-computing/\nhttp://academic.research.microsoft.com/Conference/1920/dmin-int-conf-on-data-mining/\nhttp://academic.research.microsoft.com/Conference/1891/csreaeee-international-conference-on-e-business-enterprise-information-systems-e-government/\nhttp://academic.research.microsoft.com/Conference/679/ersa-engineering-of-reconfigurable-systems-and-algorithms/\nhttp://academic.research.microsoft.com/Conference/681/esa-embedded-systems-and-applications/\nhttp://academic.research.microsoft.com/Conference/1981/fcs-international-conference-on-foundations-of-computer-science/\nhttp://academic.research.microsoft.com/Conference/1983/fecs-conference-on-frontiers-in-education/\nhttp://academic.research.microsoft.com/Conference/1998/gca-international-conference-on-grid-computing-and-applications/\nhttp://academic.research.microsoft.com/Conference/2467/gem-international-conference-on-genetic-and-evolutionary-methods/\nhttp://academic.research.microsoft.com/Conference/7/ic-ai-international-conference-on-artificial-intelligence/\nhttp://academic.research.microsoft.com/Conference/5/icomp-international-conference-on-internet-computing/\nhttp://academic.research.microsoft.com/Conference/48/icwn-international-conference-on-wireless-networks/\nhttp://academic.research.microsoft.com/Conference/65/ike-information-and-knowledge-engineering/\nhttp://academic.research.microsoft.com/Conference/2114/ipcv-international-conference-on-image-processing-computer-vision-and-pattern-recognition/\nhttp://academic.research.microsoft.com/Conference/2209/msv-int-conf-on-modeling-simulation-&-visualization-methods/\nhttp://academic.research.microsoft.com/Conference/214/pdpta-parallel-and-distributed-processing-techniques-and-applications/\nhttp://academic.research.microsoft.com/Conference/332/sam-security-and-management/\nhttp://academic.research.microsoft.com/Conference/361/serp-software-engineering-research-and-practice/\nhttp://academic.research.microsoft.com/Conference/2308/swws-conference-on-semantic-web-and-web-services/\n\n\nUSEFUL WEB LINKS:\n\n1. Web site of ICAI'12:\n   http://www.world-academy-of-science.org/worldcomp12/ws/conferences/icai12\n2. The 2011 congress delegates photos are available at:\n   http://worldcomp.phanfare.com/5408606\n3. This email notification contains updated and current information (correct\n   as of the date of this email message). The information that appears in\n   this email message supersedes earlier ones.\n\nCONTACT:\nInquiries should be sent to: sc@world-comp.org\n\n",
    "attachments": []
}