{
    "subject": "Final Call for Papers - Computing Conference 2020 - London, UK",
    "from": "Computing Conference <conference@thesai.org>",
    "to": "foaad@calpoly.edu",
    "cc": null,
    "bcc": null,
    "date": "Mon, 07 Oct 2019 15:04:16 +0000",
    "body": "Dear Colleague,\n\n\nWe would like to let you know that the final submission due date for the Computing Conference 2020 is 15 October 2019.\n\n\nPlease consider and plan for submitting papers and encourage your colleagues, research group members and fellow scientists to contribute and participate in this conference.\n\n\nComputing Conference 2020 proceedings will be published in the Springer series \"Advances in Intelligent Systems and Computing\" and submitted for indexing to ISI Proceedings, EI-Compendex, DBLP, SCOPUS, Google Scholar and Springerlink.\n\n\nOnline Submission System:\nhttps://saiconference.com/Computing2020/Submit\n\n\nBest,\n\nSupriya Kapoor\n\n\nConference Manager\n\n\n___________________________________________________________________________\n\n\nComputing Conference 2020 - Call for Papers\n\n16-17 July 2020 - London, United Kingdom\n\n\n\nWe'd like to invite you to submit your papersfor the Computing Conference 2020 to be held from 16-17 July 2020 in London, UK.\n\n\nComputing Conference is a research conference held in Londonsince 2013. The conference series has featured keynote talks, special sessions, poster presentation, tutorials, workshops, and contributed papers each year.\nThe goal of the conference is to be a premier venue for researchers and industry practitioners to share new ideas, research results and development experiences in computing and related fields.\n\n\nConference Tracks includeComputing, Artificial Intelligence, Machine Vision, Security, Communication, Ambient Intelligence, e-Learning etc.\n\n\nImportant Dates (Regular Submission):\n\nPaper Submission Due: 15 October 2019\n\nAcceptance Notification : 15 November 2019\n\nAuthor Registration : 01 December 2019\n\nCamera Ready Submission : 01 January 2019\n\nConference Dates : 16-17 July 2020\n\n\nComplete details are available on the conference website : \nhttp://saiconference.com/Computing\n\n\nComputing Conference 2020 proceedings will be published in Springer series \"Advances in Intelligent Systems and Computing\" and submitted for indexing to ISI Proceedings, EI-Compendex, DBLP, SCOPUS, Google Scholar and Springerlink. The publications within \"Advances in Intelligent Systems and Computing\" are primarily proceedings of important conferences, symposia and congresses. They cover significant recent developments in the field, both of a foundational and applicable character.\n\n\nPlease get in touch if you would like to contribute in more ways; and feel free to circulate this information among your colleagues/students.\n\n\nLooking forward to your contributions.\n\n\n\nRegards,\n\nKohei Arai\n\nProgram Chair, Computing Conference 2020\n\n\nClick here to Unsubscribe",
    "attachments": []
}