{
    "subject": "ICSAI2019, Shanghai, Submission Open until 30 October [SCI Special Issue/EI Compendex/SCOPUS/IEEE Xplore]      2019/10/16 3:18:41 9ir",
    "from": "Prof Chen <icsai_cfp@sdju.edu.cn>",
    "to": "foaad@calpoly.edu",
    "cc": null,
    "bcc": null,
    "date": "Wed, 16 Oct 2019 03:18:27 +0800",
    "body": "Dear Colleague,\r\n\r\nThe 2019 6th International Conference on Systems and Informatics (ICSAI 2019) will be held from 2-4 November 2019 in Lingang, Shanghai, China. Submission remains open until 30 October 2019 (papers already submitted should not be re-submitted).\r\n\r\nICSAI 2019 aims to be a premier international forum for scientists and researchers to present the state of the art of systems engineering and information science. \r\n\r\nTopics include (but are not limited to): \r\n\r\n      Systems\r\n Control and Automation Systems\r\n Power and Energy Systems\r\n Intelligent Systems\r\n Computer Systems and Applications \r\n     Informatics\r\n Communications and Networking\r\n Image, Video, and Signal Processing\r\n Data Engineering and Data Mining\r\n Software Engineering\r\n\r\nAll papers in the conference proceedings will be submitted to EI Compendex, Scopus, and ISTP (ISI Proceedings), as well as IEEE Xplore. Some papers will be recommended for publication in a special issue in SCI-indexed journal Applied Sciences (2018 Impact Factor: 2.217). \r\n\r\nLingang is a new district of Shanghai, the largest city in China. Several famous universities have established new campuses in Lingang. Nearby attractions include Shanghai Wildlife Park, Shanghai Disneyland, Shanghai Haichang Ocean Park, China Maritime Museum, Shanghai Flower Harbor, Binhai Forest Park, and Dishui Lake.\r\n\r\nFor more information, visit the conference web page:\r\n\r\n  http://www.icsai.org.cn/\r\n\r\nIf you have any questions after visiting the conference web page, please email the secretariat at icsai2019@sdju.edu.cn \r\n\r\nJoin us at this major event in beautiful Lingang !!!\r\n\r\nOrganizing Committee\r\nicsai2019@sdju.edu.cn\r\n\r\nP.S.: Please forward to your colleagues or students who may be interested.\r\n\r\nIf you wish to unsubscribe, in which case we apologize, please reply with \"unsubscribe foaad@calpoly.edu \" in your email subject. Thanks.\r\n\r\n\r\n\r\n\r\n\r\n2019/10/16 3:18:41 holz1r2\r\n\r\n \n\n\n\n\n\n\n\n\nDear Colleague,\nThe 2019 6th International Conference on Systems and Informatics (ICSAI \r\n2019) will be held from 2-4 November 2019 in Lingang, Shanghai, China. \r\nSubmission remains open until 30 October \r\n2019 (papers already \r\nsubmitted should not be re-submitted).\nICSAI 2019 aims to be a premier international forum for scientists and \r\nresearchers to present the state of the art of systems engineering and \r\ninformation science. \nTopics include (but are not limited to): \n      \r\nSystems Control and Automation \r\nSystems Power and Energy Systems Intelligent \r\nSystems Computer Systems and \r\nApplications      \r\nInformatics Communications and Networking Image, \r\nVideo, and Signal Processing Data Engineering and Data \r\nMining Software Engineering\n \nAll papers in the conference proceedings will be \r\nsubmitted to EI Compendex, Scopus, and ISTP (ISI Proceedings), as well as IEEE \r\nXplore. Some papers will be recommended for publication in a special issue in \r\nSCI-indexed journal Applied Sciences (2018 Impact Factor: 2.217). \r\n\nLingang is a new district of Shanghai, the largest city in China. \r\nSeveral famous universities have established new campuses in Lingang. Nearby \r\nattractions include Shanghai Wildlife Park, Shanghai Disneyland, Shanghai \r\nHaichang Ocean Park, China Maritime Museum, Shanghai Flower Harbor, Binhai \r\nForest Park, and Dishui Lake.\nFor more information, visit the conference web page:\n  http://www.icsai.org.cn/\nIf you have any questions after visiting the conference web page, \r\nplease email the secretariat at icsai2019@sdju.edu.cn \nJoin us at this major event in beautiful Lingang !!!\nOrganizing Committeeicsai2019@sdju.edu.cn\nP.S.: Please forward to your colleagues or students who may be \r\ninterested.\nIf you wish to unsubscribe, in which case we apologize, please reply \r\nwith \"unsubscribe foaad@calpoly.edu \" in your email subject. Thanks.\n \n \n \n \n \n2019/10/16 3:18:41 llpqwbyb\n \n\n\n",
    "attachments": []
}