{
    "subject": "GEM'12, ICAI'12, IKE'12 Conferences - can you please chair a session or more? We need help",
    "from": "Steering Committee <sc@world-comp.org>",
    "to": "foaad@calpoly.edu",
    "cc": null,
    "bcc": null,
    "date": "Tue, 26 Jun 2012 15:24:52 -0400",
    "body": "\nDear conference attendees, authors and colleagues:\n\nThis is one more Call For Help.\nThis email is being sent to all registered authors, speakers, and\nparticipants of the following conferences:\n\n\ngem-icai-ike-help\n\n--> The 2012 International Conference on Genetic and Evolutionary\n    Methods (GEM'12: July 16-19, 2012, Las Vegas, USA)\n\n--> The 2012 International Conference on Information and Knowledge\n    Engineering (IKE'12: July 16-19, 2012, Las Vegas, USA)\n\n--> The 2012 International Conference on Artificial Intelligence\n    (ICAI'12: July 16-19, 2012, Las Vegas, USA)\n\nhttp://www.world-academy-of-science.org/worldcomp12/ws \n\nWe have over 200 sessions for the congress; a few of these sessions\ndo not yet have chairs/moderators. The list of sessions that we need\nhelp with is appended to this email; for each session (below), you will\nfind: the title of the session, the date and time, and conference room\nnumber.\n\nREQUEST FOR HELP:\n\nIf you know that you will be attending the conference and would be willing\nto help us by chairing/co-chairing one or more sessions (list of sessions\nis appended to this email) then please email me the following information\nas soon as possible (your help would be a great service to the conference\nand we would be most grateful to you for helping out):\n\n-> I am 100% confident that I will be attending the conference AND I am\n-> willing to chair/moderate one or more of the sessions below:\n-> \n->     Session ID Number(s) and Title(s):\n->     Date of the session(s):\n->     Your Title (Prof./Dr./...):\n->     Your name:\n->     Your affiliation and country:\n\nEXPECTATION FROM THE CHAIRS: session chairs are expected to:\n\n-> Attach a red ribbon to their name tags (available from the conference staff).\n-> Sit in the front row of the conference room (where the session will be\n   held). Session chairs are expected to be in the conference room at least\n   15 minutes before the session is scheduled to start.\n-> Make sure that each talk starts at the scheduled time and respectfully ask\n   the speaker to finish his presentation if he/she is begining to go over time.\n-> Encourage relevant questions (time permitting).\n-> After the conference, report to the Steering Committee ( sc@world-comp.org )\n   if any of the speakers did not show up.\n\nThere is no doubt that we will have a great gathering (thanks to you, all\nauthors who submitted papers, PC members, and all our sponsors.)\n\nI very much look forward to seeing you in July.\n\nKindest regards,\nSC (on behalf of Prof. Hamid R. Arabnia)\n\nps. We have reserved a large block of rooms at Monte Carlo Resort (this is where\n    the conference will be held) at a low negotiated rate. The hotel has agreed\n    to extend the reservation deadline at the low rate till June 28, 2012. If\n    you have not yet reserved your room and would like to stay at the hotel\n    where the conference will be held, then you need to do your room reservation\n    very soon - our block of 3,800 room nights are getting close to being fully\n    booked (reservations will be honored by the hotel on First-Come First-Serve\n    basis till the block is fully booked). In order to reserve a room at the\n    hotel, see the web link below:\n    http://www.world-academy-of-science.org/worldcomp12/ws/location \n\nXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXX\n\nSESSION 5-GEM:    GEM: GENETIC + EVOLUTIONAY ALGORITHMS + MEMETIC ALGORITHMS +\n                  FUZZY LOGIC + HEURISTIC METHODS\n                  Co-Chairs: TBA\n                  July 17, 2012 (Tuesday); 08:00am - 10:20am\n                  (LOCATION: Sterling Room)\n\nSESSION 8-IKE:    IKE: NOVEL TECHNIQUES AND ALGORITHMS\n                  Co-Chairs: TBA\n                  July 18, 2012 (Wednesday); 11:40am - 02:40pm\n                  (LOCATION: Sterling Room)\n\nSESSION 11-GEM-IKE: GENETIC & EVOLUTIONARY METHODS + INFORMATION & KNOWLEDGE ENGINEERING\n                  Co-Chairs: TBA\n                  July 19, 2012 (Thursday); 01:20pm - ...\n                  (LOCATION: Sterling Room)\n                  Note: We anticipate a large number of speaker no-shows for this track\n                  (probably over 80%) due to potential delay in obtaining US visa, non\n                  registration, late papers, ... In cases of no-shows, the presentations\n                  can be moved up to close time gaps in the session. Each talk is 15 to\n                  20 minutes long.\n\nSESSION 19-ICAI:  GENERAL TOPICS IN ARTIFICIAL INTELLIGENCE\n                  Co-Chairs: TBA\n                  July 19, 2012 (Thursday); 01:20pm - ...\n                  (LOCATION: Ballroom 1)\n                  Note: We anticipate a large number of speaker no-shows for this track\n                  (probably over 80%) due to potential delay in obtaining US visa, non\n                  registration, late papers, ... In cases of no-shows, the presentations\n                  can be moved up to close time gaps in the session. Each talk is 15 to\n                  20 minutes long and there is a BREAK at 3:00pm for 20 minutes.\n",
    "attachments": []
}