{
    "subject": "HCI International 2020 - Call for Participation",
    "from": "\"no_reply@hci.international\" <no_reply@hci.international>",
    "to": "foaad@calpoly.edu",
    "cc": null,
    "bcc": null,
    "date": "Mon, 30 Sep 2019 19:08:10 +0000",
    "body": "***********************\n\nYou can update\n\nyour subscription details or unsubscribe\n\nfrom HCI International NEWS at any time.\n\n***********************\n\n[Apologies if you receive multiple copies of this message]\n\n=====================================================\n\nHCI International 2020\n\n19-24 July 2020, AC Bella Sky Hotel and Bella Center\n\nCopenhagen, Denmark\n\nhttp://2020.hci.international/\n\nThe 22nd International Conference on Human-Computer Interaction is\nbeing organized under the auspices of 21 distinguished international\nboards. For the list of Affiliated Conferences / Thematic Areas, as\nwell as the list of topics of each area of HCI International 2020,\nwhich is expected to attract over 2,000 participants from more than 70\ncountries around the world, please have a look at the Conference\nwebsite \n.\n\n 11 October 2019, regular paper proposals (an abstract of 800 words is\nrequired)\n 11 October 2019, tutorial proposals (an abstract of 300 words is\nrequired)\n 31 January 2020, poster proposals (an abstract of 300 words is\nrequired)\n 10 April 2020, student design proposals (an abstract of 300 words and\na video clip are required)\n 1 May 2020, demonstrations (an abstract of 300 words is required)\n\nDetailed information about proposal submission\n\nis available. \n\nThe Conference Proceedings\n\nwill be published by Springer in a multi-volume set. Papers will\nappear in volumes of the Lecture Notes in Computer Science (LNCS) and\nLecture Notes in Artificial Intelligence (LNAI) series. Poster\nExtended Abstracts will be published in the form of short papers in\nthe Communications in Computer and Information Science (CCIS) series.\n\nAn award \nwill be presented to the best paper of each of the HCII 2020 Thematic\nAreas / Affiliated Conferences and for the best poster extended\nabstract.\n\nThe Program for Student Volunteers\n\ngives full-time university students from around the world the\nopportunity to actively participate and contribute to one of the\nprestigious conferences in the field of computing and HCI. The\ndeadline for applications receipt is 31 January 2020.\n\n------------------------------\n\nConference contact: Program Administration program@hcii2020.org\n\n\n\n\n \nDISCLAIMER: This email and any files transmitted with it are\nconfidential and intended solely for the use of the individual or\nentity to whom they are addressed. If you have received this email in\nerror, please notify the sender. If you are not the named addressee\nyou should not disseminate, distribute or copy this e-mail. The HCI\nInternational Conference has taken all reasonable precautions to\nensure that no harmful content is present in this email.\nUnfortunately, full security cannot be ensured as, despite our\nefforts, the data included in emails could be infected, intercepted,\nor corrupted. Therefore, the recipient should check the email for\nthreats with proper software, as the HCI International Conference does\nnot accept liability for any damage inflicted by viewing the content\nof this email. Please do not print this email unless it is necessary.\n\n \n\n\n-- powered by phpList, www.phplist.com --\n\n\n\n\n***********************\nYou can update your subscription details or unsubscribe from HCI International NEWS at any time.\n***********************\n[Apologies if you receive multiple copies of this message]\n=====================================================\n \nHCI International 2020\n19-24 July 2020, AC Bella Sky Hotel and Bella Center\nCopenhagen, Denmark\nhttp://2020.hci.international/\n \nThe 22nd International Conference on Human-Computer Interaction is being organized under the auspices of 21 distinguished international boards. For the list of Affiliated Conferences / Thematic Areas, as well as the list of topics of each area of HCI International 2020, which is expected to attract over 2,000 participants from more than 70 countries around the world, please have a look at the Conference website.\n\n11 October 2019, regular paper proposals (an abstract of 800 words is required)\n11 October 2019, tutorial proposals (an abstract of 300 words is required)\n31 January 2020, poster proposals (an abstract of 300 words is required)\n10 April 2020, student design proposals (an abstract of 300 words and a video clip are required)\n1 May 2020, demonstrations (an abstract of 300 words is required)\n\nDetailed information about proposal submission is available.  \nThe Conference Proceedings will be published by Springer in a multi-volume set. Papers will appear in volumes of the Lecture Notes in Computer Science (LNCS) and Lecture Notes in Artificial Intelligence (LNAI) series. Poster Extended Abstracts will be published in the form of short papers in the Communications in Computer and Information Science (CCIS) series.\nAn award will be presented to the best paper of each of the HCII 2020 Thematic Areas / Affiliated Conferences and for the best poster extended abstract.\nThe Program for Student Volunteers gives full-time university students from around the world the opportunity to actively participate and contribute to one of the prestigious conferences in the field of computing and HCI. The deadline for applications receipt is 31 January 2020.\n------------------------------\nConference contact: Program Administration   program@hcii2020.org   \nDISCLAIMER: This email and any files transmitted with it are confidential and intended solely for the use of the individual or entity to whom they are addressed. If you have received this email in error, please notify the sender. If you are not the named addressee you should not disseminate, distribute or copy this e-mail. The HCI International Conference has taken all reasonable precautions to ensure that no harmful content is present in this email. Unfortunately, full security cannot be ensured as, despite our efforts, the data included in emails could be infected, intercepted, or corrupted. Therefore, the recipient should check the email for threats with proper software, as the HCI International Conference does not accept liability for any damage inflicted by viewing the content of this email. Please do not print this email unless it is necessary.\n\n",
    "attachments": []
}