{
    "subject": "IEEE ISTAS 2019 (Boston, 15 - 16 November) - Call for Papers 23 August",
    "from": "IEEE eNotice <enotice@ieee.org>",
    "to": "foaad@calpoly.edu",
    "cc": null,
    "bcc": null,
    "date": "Mon, 26 Aug 2019 13:51:48 -0400",
    "body": "IEEE eNotice\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\t  Dear Colleagues,\n\n\n\n\t  I would appreciate wide circulation of the IEEE ISTAS 2019 Call for Papers \n\t  (Deadline 30 August) to ensure a strong response.\n\n\n\n\t  IEEE international Symposium on Technology and Society 2019\n\n\t  (Boston, 15  16 November)\n\n\t  https://attend.ieee.org/istas-2019/calls-for-papers/\n\n\n\n\t  The IEEE Society for Social Implications of Technology (SSIT) invites you \n\t  to participate in its flagship event, the 2019 IEEE International \n\t  Symposium on Technology and Society (ISTAS). IEEE ISTAS 2019 takes place \n\t  15- 16 November in Boston MA, hosted by the School of Engineering of Tufts \n\t  University, on its Medford Campus.\n\n\n\n\t  IEEE ISTAS is an interdisciplinary forum for engineers and policy makers, \n\t  entrepreneurs and educators, philosophers and researchers, social \n\t  scientists and technologists, practitioners and polymaths to collaborate, \n\t  exchange experiences, and discuss the social, cultural, ethical, economic \n\t  and environmental implications of technology.\n\n\n\n\t  Technical Co-Sponsors for IEEE ISTAS 2019 include IEEE-USA, Region 1  \n\t  Northeastern USA, IEEE Boston Section, IEEE Standards Association, IEEE \n\t  Industrial Electronics Society, IEEE Reliability Society and IEEE \n\t  Technology and Engineering Management Society. IEEE HAC is a support \n\t  organisation.\n\n\n\n\t  Keynotes\n\n\t  This years program includes Tom Coughlin (President, IEEE-USA) and Babak \n\t  Dastgheib-Beheshti, IEEE Region 1 Director.\n\n\n\n\t  Plenary Panels\n\n\t  IEEE Division VI Society Presidents will share interdisciplinary insights \n\t  and discuss collaboration opportunities.\n\n\n\n\t  IEEE SSIT Standards Committee and IEEE Standards Association will share \n\t  insights into Creating Ethically Informed Standards.\n\n\n\n\t  Call for Papers\n\n\t  The Call for Papers closes on Friday 23 August. \n\t  https://attend.ieee.org/istas-2019/calls-for-papers/\n\n\n\n\t  Paper submissions will follow a single stage review and acceptance \n\t  process, should align with at least one of the topics listed below, be \n\t  4000  5000 words max. on up to 6 pages, and comply with the IEEE format \n\t  and specifications as described in the ISTAS 2019 Paper Template.\n\n\n\n\t  Author and co-author details should only be added in the online submission \n\t  form. No author details should be included in the pdf uploaded.\n\n\n\n\t  We welcome proposals for papers, discussion panels and workshop sessions \n\t  focused on the relationship between technology, sustainable development \n\t  and social issues ranging from the economic and ethical to the cultural \n\t  and environmental.\n\n\n\n\t  All papers must be original and not simultaneously submitted to another \n\t  conference or journal.\n\n\n\n\t  Conference Themes include (but are not limited to)\n\n\t   Sustainable Development (including ICT4D) and Humanitarian Technology\n\n\t  o Technological and Social Innovation supporting the UN SDGs, including \n\t  eAgriculture, eEducation, Energy and eHealth\n\n\t  o Collaborative Open Innovation and Multi-Stakeholder Co-Design\n\n\n\n\t   Ethics/Human Values\n\n\t  o Socio-Cultural Differences\n\n\t  o Ethical Standards, Autonomous Vehicles and Artificial Intelligence\n\n\t  o Ethical Use of Big Data, Blockchain, Human Genome Editing, IoT, \n\t  Neurotechnology & Open Data\n\n\t  o Balancing Personalisation with Personal Privacy\n\n\t  o Balancing National Security with Personal Privacy\n\n\n\n\t   Universal Access\n\n\t  o Digital Literacy and 21st Century Skills\n\n\t  o Current Challenges in Technology Policy\n\n\n\n\t   Societal Impacts (including traditionally disadvantaged communities, \n\t  e.g. indigenous peoples, women, youth, elderly and differently abled)\n\n\n\n\t   Protecting the Planet\n\n\t  o Green Technology\n\n\t  o GEOValue\n\n\t  o Climate and Environment\n\n\t  o Sustainable Technologies\n\n\n\n\t  A paper will only be published in the Conference Proceedings if the author \n\t  or a co-author registers for the Conference and presents the results \n\t  during the event. Any author or co-author can only present one paper in \n\t  the program.\n\n\n\n\t  Papers accepted for the Conference Proceedings and presented during the \n\t  conference by their author or co-author will be submitted for publication \n\t  in IEEE Xplore.\n\n\n\n\t  Workshop/Panel Submissions - Deadline 30 August\n\n\t  2 page panel and workshop submissions for a 90 minute parallel session \n\t  should be sent by email to secretariat.istas@gmail.com up to 30 August.\n\n\n\n\t  Please outline the objectives, alignment with conference theme, presenters \n\t  with short abstract and expected impact. There must be a minimum of three \n\t  presenters confirmed for each session, who are not also presenting papers.\n\n\n\n\t  Please note that each presenter must register for the conference.\n\n\n\n\t  We look forward to receiving your submissions. Please forward the call for \n\t  papers to relevant colleagues and mailing lists.\n\n\n\n\t  Best wishes,\n\n\n\n\t  Paul\n\n\t  ------------------------\n\n\t  Prof. Paul M Cunningham\n\n\t  Conference Chair, IEEE ISTAS 2019\n\n\t  Director, IST-Africa Institute\n\n\t  President & CEO, IIMC International Information Management Corporation Ltd\n\n\t  Candidate for IEEE Division VI Delegate-Elect/Director-Elect\n\n\t  Past President and VP Conferences, IEEE Society on Social Implications of \n\t  Technology\n\n\t  Past-Chair, IEEE Humanitarian Activities Committee\n\n\n\n\n\n\n\n\n\n\n\n\nIEEE \n\t  Reliability Society: https://rs.ieee.org/\n\n\t  IEEE IEEE Society on Social Implications of Technology: \n\t  https://technologyandsociety.org/\n\n\t  IEEE TEMS: http://www.ieee-tems.org/\n\n\t  IEEE USA: https://ieeeusa.org/\n\n\n\n\n\n\t  To unsubscribe from all mailings, use your IEEE Account to update your \n\t  \"\nCommunication \n\t  Preferences\n\" \n\n\n\n\t  Unsubscribe from ISTAS eNotices: \nUnsubscribe from List\n\n\n\n\t  Subscribe to ISTAS eNotices: \nSubscribe to List\n\n\n\n\n\n\n\n\n\n\n \n\n\n\n\nIEEE\n\n\t  445 Hoes Lane\n\n\t  Piscataway, NJ 08854 USA\n\n\t  +1 800 678 4333 (toll free, US & Canada)\n\n\t  +1 732 981 0060 (Worldwide)\n\n\n\n\t  For more information or questions regarding your IEEE membership or IEEE \n\t  Web Account, please direct your inquiries to the\n\nIEEE \n\t  Contact Center\n.",
    "attachments": []
}