{
    "subject": "LAST Call For Papers: Submission Deadline: May 31 - The 2015 Int'l Conf on Security & Management (SAM'15: July 27-30, 2015, USA)",
    "from": "Security <wcom@world-comp.org>",
    "to": "foaad@calpoly.edu",
    "cc": null,
    "bcc": null,
    "date": "Fri, 22 May 2015 21:57:03 -0400",
    "body": "\n                     LAST  CALL  FOR  PAPERS\n\n                             SAM'15\n     The 2015 International Conference on Security and Management\n                 July 27-30, 2015, Las Vegas, USA\n                   http://sam.udmercy.edu/sam15 \n\n  CALL FOR LATE BREAKING PAPERS, POSITION PAPERS, ABSTRACTS, POSTERS\n\n                Submission Deadline: May 31, 2015\n                11:59pm US Eastern Time zone (EDT)\n\nSubmission web site: https://www.easychair.org/conferences/?conf=sam15 \n+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++\n\nThe federated congress that SAM'15 is an important part of, will have\nparticipants, speakers, authors affiliated with over 170 different\nuniversities (including many from the top 50 ranked institutions), many\nmajor IT corporations (including, Microsoft, Google, SAP, Oracle, Amazon,\nYahoo, Samsung, IBM, Ebay, GE, Siemens, and others), government research\nagencies (NSF, NIH, DoE, US Air Force, a number of security agencies, and\nothers), and national laboratories (including, NASA, ANL, LLNL, Sandia,\nORNL, Lawrence Berkeley National Lab, Los Alamos National Lab, ...) In\naddition, we also plan to have representatives of various Venture\nCapitalists as well as speakers discussing Intellectual Property issues.\n\nThe conference is composed of a number of tracks, including: tutorials,\nsessions, workshops, posters, and panel discussions.\n\nSCOPE: Topics of interest include, but are not limited to, the following:\n\nO  NETWORK SECURITY:\n   - Security Algorithms\n   - Mobile Network Security\n   - Security in CDN (Contents Distribution Networks)\n   - Virtual Private Network (VPN)\n   - Tracing Techniques in Internet\n   - Active Networks\n   - Security in Grid\n   - Web Monitoring\n   - Control Systems/SCADA Security\n   - Network Security Engineering\n   - Transport-Level Security\n   - Wireless Network Security\n   - IP Security\n   - Electronic Mail security\n\nO  CRYPTOGRAPHIC TECHNOLOGIES:\n   - Security Protocols\n   - Key Management Techniques\n   - Cryptographic Technologies\n   - Applications of Block and Stream Ciphers\n   - Applications of Public Key Cryptology\n   - Message Authentication and Hash Functions\n   - Anonymity\n   - Digital Signature Schemes\n   - Secret Sharing\n   - Cryptanalysis\n\nO  SECURITY MANAGEMENT:\n   - Surveillance Technologies\n   - Security Policies\n   - Security for Protocol Management\n   - Location Management\n   - QoS Management\n   - Resource Management\n   - Channel Management\n   - Mobility Management\n   - Digital Contents Copyright Protection\n   - System Security Management\n   - Network Security Management\n   - Management in Network Equipment\n   - Storage Area Networks (SAN) Management\n   - Information Security Management\n   - Government Security Policy\n   - Web Penetration Testing\n   - Security Operations\n   - Vulnerabilities Management\n\nO  SECURITY EDUCATION:\n   - Computer Security Education\n   - Network Security Education\n   - Cyber Security Education\n   - Cyber Security Body of Knowledge\n   - Information Assurance Education\n\nO  INFORMATION ASSURANCE:\n   - Mission Assurance\n   - Risk Assessment and Risk Management\n   - Continuity of Operations and Business Impact Analysis\n   - Cyber Security Compliance\n   - Security Auditing\n   - Security-Savvy Software Development\n   - Disaster Recovery\n   - Business Continuity Analysis\n   - Access Control\n   - Secure Use of Software\n   - Secure Performance\n\nO  BIOMETRICS AND FORENSICS:\n   - Novel Biometric Methods\n   - Forensics\n   - Biological Security Technologies\n   - Face Recognition Systems\n   - Signature Recognition Systems\n   - Cyber Forensics\n   - Forensic Analysis\n   - Biometric Technologies for Security\n   - Feature Extraction and Matching Algorithms\n\nO  HARDWARE SECURITY:\n   - Embedded Systems Security\n   - Cryptographic Processors and Co-Processors\n   - Security Architectures\n   - True and Pseudorandom Number Generators\n   - Side Channel Attacks\n   - Fault Attacks\n   - Hardware Tamper Resistance\n   - Smart Card Processors\n   - Secure Storage Devices\n\nO  SECURITY APPLICATIONS:\n   - Security in E-Commerce and M-Commerce\n   - Secure OS\n   - Watermarking\n   - High-Tech Systems at Airports\n   - Emerging Technologies and Applications\n   - Cloud Computing Security\n   - Database Security\n   - Data Mining Security\n   - Cyber Security Automation\n\nO  COMPUTER SECURITY:\n   - Firewall Systems\n   - Hacking Techniques and Related Issues\n   - Intrusion Detection System (IDS)\n   - Honeypot\n   - Virus Issues (Detection, Prevention ...)\n   - Trusted Computing\n   - Alert Correlation\n   - Attack Graphs\n   - Incident Responding\n   - Malware Analysis\n   - Incident Responding\n\nINVITATION:\n\nThis announcement is ONLY for those who MISSED the opportunity to submit\ntheir papers in response to earlier \"Call For Papers\". Therefore,\nauthors who have ALREADY submitted papers in response to earlier \"Call\nFor Papers\" should IGNORE this announcement. (Those who have been\nnotified that their papers have been accepted, should still follow the\ninstructions that were emailed to them; including meeting the deadlines\nmentioned in the notifications that were sent to them).\n\nYou are invited to submit a \"LATE BREAKING PAPER\", \"POSITION PAPER\", or\n\"ABSTRACT/POSTER PAPER\" for consideration. All accepted papers will be\npublished in printed conference books/proceedings (ISBN) and will also\nbe made available online. In addition, like prior years, extended\nversions of selected papers (about 35%) of the conference will appear\nin journals and edited research books (publishers include: Springer,\nElsevier, BMC, and others); some of these books and journal special\nissues have already received the top 25% downloads in their respective\nfields. See the link below for a very small subset of the books published\nmostly based on extended versions of the accepted papers of this congress:\nhttp://www.worldacademyofscience.org/worldcomp15/ws/publications . The\ntitles of proceedings of the federated congress have been indexed into\nthe ACM Digital Library ( http://dl.acm.org/ ) which includes\nbibliographic citations from major publishers in computing.\n\n\nIMPORTANT DATES:\n\nMay 31, 2015:       Submission of LATE BREAKING PAPERS, POSITION PAPERS,\n                    ABSTRACTS/POSTERS for evaluation (the sooner, a submission\n                    is received, the earlier, the notification will be sent out.)\nJune 14, 2015:      The notification of acceptance will be sent out typically 10\n                    days after the paper has been submitted but by no later than\n                    June 14.\nJune 24, 2015:      Registration due\nJuly 27-30, 2015:   The 2015 International Conference on Security and Management\n                    (SAM'15)\nAugust 20, 2015:    Camera-Ready LATE BREAKING PAPERS, POSITION PAPERS, ABSTRACTS/\n                    POSTERS Due for publication. Papers submitted and accepted in\n                    response to this announcement will be published in the Final\n                    Edition of the proceedings which will go to press soon after\n                    the conference; they will also be indexed in science citation\n                    index databases. The Final Edition of the proceedings will be\n                    identical to the Preliminary Edition except for the addition\n                    of the accepted LATE BREAKING PAPERS, POSITION PAPERS,\n                    ABSTRACTS/POSTERS at the end of the books. The conference\n                    would make the necessary arrangements to ship the printed\n                    proceedings/books to such authors.\n\n\n\nSUBMISSION OF LATE BREAKING PAPERS, POSITION PAPERS, ABSTRACTS/POSTERS:\n\nIn response to this announcement, authors are given the opportunity to\nsubmit their papers for evaluation in one of the following three paper\ncategories:\n\n   1. LATE BREAKING PAPERS: describe late-breaking/recent developments in\n      the field. The maximum number of pages is 7. Please write the\n      following on the first page of your submission \"name of conference:\n      LATE BREAKING PAPER\". If accepted, The length of the final/Camera-\n      Ready paper will be limited to 7 (two-column IEEE style) pages and\n      the author will be given the opportunity to present the paper in a\n      formal session.\n\n   2. POSITION PAPERS: enable discussions on emerging topics without the\n      experimentation normally present in an academic paper. Commonly,\n      such papers will substantiate the opinions or positions put forward\n      with evidence from an extensive objective discussion of the topic.\n      The maximum number of pages is 5. Please write the following on the\n      first page of your submission \"name of conference: POSITION PAPER\".\n      If accepted, The length of the final/Camera-Ready paper will be\n      limited to 4 (two-column IEEE style) pages and the author will be\n      given the opportunity to present the paper in a formal session.\n\n   3. ABSTRACT/POSTER PAPERS: describe research roadmaps (similar to PhD\n      plan or PhD prospectus). The maximum number of pages is 2. Please\n      write the following on the first page of your submission \"name of\n      conference: ABSTRACT/POSTER PAPER\". If accepted, The length of the\n      final/Camera-Ready paper will be limited to 2 (two-column IEEE\n      style) pages and the author will be given the opportunity to\n      present the paper in a discussion/poster session.\n\nProspective authors are invited to submit their papers by uploading them\nto the evaluation web site at:\n\nhttps://www.easychair.org/conferences/?conf=sam15 \n\nSubmissions must be uploaded by the due date (see IMPORTANT DATES) and\nmust be in either MS doc or pdf formats. All reasonable typesetting\nformats are acceptable (later, the authors of accepted papers will be\nasked to follow a particular typesetting format to prepare their final\npapers for publication. Papers must not have been previously published or\ncurrently submitted for publication elsewhere. The first page of the\npaper should include: title of the paper, name, affiliation, postal\naddress, and email address for each author as well as a maximum of 5\ntopical keywords that would best represent the content of the paper. The\nfirst page should also identify the name of the Contact/Corresponding\nauthor together with his/her professional email address. A 100 to 150-word\nabstract should appear on the first page.\n\nEach paper will be peer-reviewed by two experts in the field for\noriginality, significance, clarity, impact, and soundness. In cases of\ncontradictory recommendations, a member of the conference program\ncommittee would be charged to make the final decision (accept/reject);\noften, this would involve seeking help from additional referees. Papers\nwhose authors include a member of the conference program committee will\nbe evaluated using the double-blinded review process. (Essay/philosophical\npapers will not be refereed but may be considered for discussion/panels).\n\nThe proceedings will be published in printed conference books (ISBN) and\nwill also be made available online. The proceedings will be indexed in\nscience citation databases that track citation frequency/data for each\npublished paper. All proceedings are also approved for inclusion into\nEBSCO ( www.ebsco.com ), one of the largest subject index systems. The\ntitles of proceedings of the federated congress have been indexed into\nthe ACM Digital Library ( http://dl.acm.org/ ) which includes\nbibliographic citations from major publishers in computing.\n\nIn addition to the above, we have arranged two new book series (multiple\nbooks in each series); one with Elsevier publishers (Emerging Trends in\nComputer Science and Applied Computing) and another with Springer\npublishers (Transactions of Computational Science and Computational\nIntelligence). After the conference (the process may take 12 to 18\nmonths), a significant number of authors of accepted papers of our\ncongress, will be given the opportunity to submit the extended version\nof their papers for publication consideration in these books. We\nanticipate having between 10 and 20 books a year in each of these\nbook series projects. Each book in each series will be subject to\nElsevier and Springer science indexing products (which includes:\nScopus, www.info.scopus.com ; SCI Compendex, Engineering Village,\nwww.ei.org ; EMBASE, www.info.embase.com ; and others). For a recent\nand a very small subset of the books (and journal special issues) that\nhave been published based on the extended versions of many of our\ncongress papers, see the link below:\n\nhttp://www.worldacademyofscience.org/worldcomp15/ws/books_journals \n\nNote that authors who submit papers in response to this announcement,\nwill have their papers evaluated for publication consideration in the\nFinal Edition of the conference proceedings which will go to press\nsoon after the conference (the conference would then make the necessary\narrangements to ship the printed proceedings/books to such authors).\nThe Final Edition of the conference proceedings will be identical to\nearlier edition except for a number of sections/chapters appended to\nthe proceedings/book.\n\n\nGENERAL INFORMATION:\n\nThe Congress will be composed of research presentations, keynote lectures,\ninvited presentations, tutorials, panel discussions, and poster\npresentations. In recent past, keynote/tutorial/panel speakers have\nincluded: Prof. David A. Patterson (pioneer, architecture, U. of California,\nBerkeley), Dr. K. Eric Drexler (known as Father of Nanotechnology),\nProf. John H. Holland (known as Father of Genetic Algorithms; U. of\nMichigan), Prof. Ian Foster (known as Father of Grid Computing; U. of\nChicago & ANL), Prof. Ruzena Bajcsy (pioneer, VR, U. of California,\nBerkeley), Prof. Barry Vercoe (Founding member of MIT Media Lab, MIT),\nDr. Jim Gettys (known as X-man, developer of X Window System, xhost;\nOLPC), Prof. John Koza (known as Father of Genetic Programming, Stanford\nU.), Prof. Brian D. Athey (NIH Program Director, U. of Michigan),\nProf. Viktor K. Prasanna (pioneer, U. of Southern California), Dr. Jose\nL. Munoz (NSF Program Director and Consultant), Prof. Jun Liu (pioneer,\nBroad Institute of MIT & Harvard U.), Prof. Lotfi A. Zadeh (Father of\nFuzzy Logic), Dr. Firouz Naderi (Head, NASA Mars Exploration Program/\n2000-2005 and Associate Director, Project Formulation & Strategy, Jet\nPropulsion Lab, CalTech/NASA; Director, NASA's JPL Solar System\nExploration), Prof. David Lorge Parnas (Fellow of IEEE, ACM, RSC, CAE, GI;\nDr.h.c.: ETH Zurich, Prof. Emeritus, McMaster U. and U. of Limerick),\nProf. Eugene H. Spafford (Executive Director, CERIAS and Professor, Purdue\nUniversity), Dr. Sandeep Chatterjee (Vice President & Chief Technology\nOfficer, SourceTrace Systems, Inc.), Prof. Haym Hirsh (Dean, Cornell\nUniversity - formerly at Rutgers University, New Jersey, USA and former\ndirector of Division of Information and Intelligent Systems, National\nScience Foundation, USA), Dr. Flavio Villanustre (Vice-President, HPCC\nSystems), Prof. Victor Raskin (Distinguished Professor, Purdue University,\nUSA); Prof. Alfred Inselberg (School of Mathematical Sciences, Tel Aviv\nUniversity, Israel; Senior Fellow, San Diego Supercomputing Center;\nInventor of the multidimensional system of Parallel Coordinates and\nauthor of textbook); Prof. H. J. Siegel (Abell Endowed Chair Distinguished\nProfessor of ECE and Professor of CS; Director, CSU Information Science\nand Technology Center (ISTeC), Colorado State University, Colorado, USA);\nProf. Amit Sheth (Fellow of IEEE and LexisNexis Eminent Scholar;\nFounder/Executive Director, Ohio Center of Excellence in Knowledge-enabled\nComputing (Kno.e.sis) and Professor of Computer Science, Wright State\nUniversity, Ohio, USA); Dr. Leonid I. Perlovsky (Harvard University,\nCambridge, Massachusetts, USA and School of Engineering and Applied\nSciences and Medical School Athinoula Martinos Brain Imaging Center; and\nThe US Air Force Research Lab., USA; CEO, LP Information Technology, USA\nand Chair of IEEE Task Force on The Mind and Brain; Recipient of John\nMcLucas Award, the highest US Air Force Award for basic research);\nand many other distinguished speakers. The Congress is among the top five\nlargest annual gathering of researchers in computer science, computer\nengineering and applied computing. We anticipate to have attendees from\nabout 85 countries/territories. To get a feeling about the conferences'\natmosphere, see some delegates photos available at:\nhttp://worldcomp.phanfare.com/ \nhttp://worldcomp.phanfare.com/6626396 (to see a slide show, click on\n\"Start SlideShow\" tab at the url above.)\n\nAn important mission of The Congress is \"Providing a unique platform for\na diverse community of constituents composed of scholars, researchers,\ndevelopers, educators, and practitioners. The Congress makes concerted\neffort to reach out to participants affiliated with diverse entities\n(such as: universities, institutions, corporations, government agencies,\nand research centers/labs) from all over the world. The congress also\nattempts to connect participants from institutions that have teaching as\ntheir main mission with those who are affiliated with institutions that\nhave research as their main mission. The congress uses a quota system to\nachieve its institution and geography diversity objectives.\"\n\nOne main goal of the congress is to assemble a spectrum of affiliated\nresearch conferences, workshops, and symposiums into a coordinated\nresearch meeting held in a common place at a common time. This model\nfacilitates communication among researchers in different fields of computer\nscience, computer engineering, and applied computing. The Congress also\nencourages multi-disciplinary and inter-disciplinary research initiatives;\ni.e., facilitating increased opportunities for cross-fertilization across\nsub-disciplines.\n\n\nTUTORIALS:\n\nAll tutorials are free to conference registrants, the list of tutorials\nthat have been approved so far can be found at: (Under Construction)\nhttp://www.worldacademyofscience.org/worldcomp15/ws/tutorials .\nWe plan to offer about 12 tutorials and panel discussions. As of the\nwriting of this announcement, the following tutorials are in the\npipeline of approval and final review; tutorials will be presented by\ndistinguished experts in their respective fields.  138939\n\nO. Building Dependable Distributed Systems\nO. Introduction to Cryptography and Network Security\nO. Motion Tracking and Recognition with Microsoft Kinect\nO. Application of MATLAB in Science and Engineering\nO. Accreditation Board of Engineering and Technology (ABET)\nO. Natural Language in Information Security and Privacy\nO. Recommendation Systems for Big Data\nO. Fault Tolerance and Beyond\nO. Cloud Computing for Big Data Challenges\nO. Big Data and Data Analytics (multiple proposals received)\nO. Data Center and related issues\nO. Visualization and datamining in the context of Big Data\nO. Power-aware systems and efficient consumption issues for HPC\nO. Big Data Analytics\n\n\nMEASURABLE SCIENTIFIC IMPACT OF CONGRESS:\n\nAs of December 14, 2014, papers published in the conference proceedings\nthat have been held as part of this congress, have received over\n27,914 citations (includes 3,346 self-citations). Citation data is\nobtained from Microsoft Academic Search. The citation data does not\neven include more than 15,000 other citations to papers in conferences\nwhose first offerings were initiated by this congress. Individual\nproceedings/books (2013 & 2014) of the federated congress can be\npurchased from major science book distributors: (such as: EBSCO and\nothers):\nhttp://www.worldacademyofscience.org/worldcomp14/ws/proceedings \nhttp://www.worldacademyofscience.org/worldcomp13/ws/proceedings \n\n\nCONTACT:\n\nInquiries should be sent to Prof. Kevin Daimi: daimikj@udmercy.edu\n\n=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=\n\nThis email was sent to:  foaad@calpoly.edu \n\nTo opt out of this email list: (Please allow up to 24 hours for any changes to be reflected) \nhttp://world-comp.org/cgi-bin/rm/full.cgi?08696a75-4b61-49a8-bc69-dce167aa057d \n\n",
    "attachments": []
}