{
    "subject": "Present and publish at 2nd SSG 2019 conference",
    "from": "Wojciech Budzianowski <wojciech5@budzianowski.eu>",
    "to": "foaad@calpoly.edu",
    "cc": null,
    "bcc": null,
    "date": "Sun, 01 Sep 2019 18:18:26 +0200",
    "body": "Dear colleague,\n\nThe second Sustainable Solutions for Growth conference (SSG) 2019 will be\nheld on September 16-17, 2019 in Wroclaw (Poland). The conference brings\ntogether researchers, innovators, consultants and investors under common\ngoal - creating, evaluating, implementing and benefiting from sustainable\ninnovations. Conference themes include various aspects of innovation\nmanagement, sustainable new products, processes, marketing and\norganisational methods. Two types of abstracts are invited (1) research and\n(2) sustainable solution. Research needs to comply with conference themes.\nSustainable solutions need to give promise for future commercial\napplications. Abstracts will be published on Book of Abstracts, 4-page\npapers on Scopus/WOS indexed Proceedings while full papers will be\nfacilitated for publication on leading journals and edited books. For\nexample, Special Issue Sustainable Solutions for Flexible Systems Management\nin Competitive Organizations will be published by Global Journal of Flexible\nSystems Management (Springer). You may participate in-person or present\nvirtually while retaining all publication privileges.\n\nOwing to your eminence in the field I cordially invite you to communicate\nyour research abstract or sustainable solution abstract to the SSG audience.\nWe will be also happy to consider you as a member of the Scientific Advisory\nBoard (SAB) if you register as a participant and reviewer. Call for\nAbstracts can be downloaded and you may register at:\nhttp://ssg.budzianowski.eu   Register before\n2019-08-31 and benefit from 20 euro fee reduction (use your promotional code\nP1908F20AA1G).\n\nIf you are from a non-academic sector benefit from on-site exhibition and\nmedia advertisement.\n\nIn case you might have any queries or requirements please do not hesitate to\ncontact me by replying to this email.\n\nI look forward to hearing from you soon.\n\nBest regards,\nWojciech Budzianowski (Chair 2nd SSG 2019)\n\nUpcoming conferences: 5th Renewable Energy Sources - Research and Business\nconference (July 6-7, 2020, Brussels, Belgium).\nRegister   at 2nd Sustainable\nSolutions for Growth conference (September 16-17, 2019, Wroclaw, Poland).\nIf you do not wish to receive any email in future from conferences click\nUnsubscribe  . We concern for your\nprivacy.\n\n\n\n\nDear colleague,The second Sustainable Solutions for Growth conference (SSG) 2019 will be held on September 16-17, 2019 in Wroclaw (Poland). The conference brings together researchers, innovators, consultants and investors under common goal - creating, evaluating, implementing and benefiting from sustainable innovations. Conference themes include various aspects of innovation management, sustainable new products, processes, marketing and organisational methods. Two types of abstracts are invited (1) research and (2) sustainable solution. Research needs to comply with conference themes. Sustainable solutions need to give promise for future commercial applications. Abstracts will be published on Book of Abstracts, 4-page papers on Scopus/WOS indexed Proceedings while full papers will be facilitated for publication on leading journals and edited books. For example, Special Issue Sustainable Solutions for Flexible Systems Management in Competitive Organizations will be published by Global Journal of Flexible Systems Management (Springer). You may participate in-person or present virtually while retaining all publication privileges.Owing to your eminence in the field I cordially invite you to communicate your research abstract or sustainable solution abstract to the SSG audience. We will be also happy to consider you as a member of the Scientific Advisory Board (SAB) if you register as a participant and reviewer. Call for Abstracts can be downloaded and you may register at: http://ssg.budzianowski.eu Register before 2019-08-31 and benefit from 20 euro fee reduction (use your promotional code P1908F20AA1G).If you are from a non-academic sector benefit from on-site exhibition and media advertisement.In case you might have any queries or requirements please do not hesitate to contact me by replying to this email.I look forward to hearing from you soon.Best regards,Wojciech Budzianowski (Chair 2nd SSG 2019)Upcoming conferences: 5th Renewable Energy Sources - Research and Business conference (July 6-7, 2020, Brussels, Belgium).Register at 2nd Sustainable Solutions for Growth conference (September 16-17, 2019, Wroclaw, Poland).If you do not wish to receive any email in future from conferences click Unsubscribe. We concern for your privacy.",
    "attachments": []
}