{
    "subject": "Re: [GAMESNETWORK] CFP: Ropecon Academic Seminar, July 26, Helsinki, Finland",
    "from": "\"Ville Kankainen (TAU)\" <ville.kankainen@TUNI.FI>",
    "to": "Gamesnetwork <gamesnetwork@uta.fi>",
    "cc": null,
    "bcc": null,
    "date": "Mon, 06 May 2019 09:13:52 +0000",
    "body": "Due to popular demand, the abstract deadline for Ropecon 2019 Academic Seminar has been extended until 12th of May! New dates are as below:\r\n\r\nImportant dates:\r\nAbstract deadline: May 05, 2019\r\nNew abstract deadline: May 12, 2019\r\nNotification of acceptance: May 19, 2019\r\nNotification of acceptance: May 26, 2019\r\nFull Paper deadline: July 15 2019\r\n\r\nThe full cfp can be found below.\r\n\r\nAll the best,\r\n\r\nVille\r\nRopecon Academic Seminar organizer\r\n\r\nVille Kankainen (TAU) kirjoitti 17.2.2019 klo 13.22:\r\n\r\nThere seemed to be something strange happening with the formatting of the post. Let's try again.\r\n\r\nPlease, spread widely on your networks!\r\n\r\nCall for Papers\r\nCharacters and Figurines - Ropecon 2019 Academic Track\r\nhttps://2019.ropecon.fi/eng/program/academic-program/\r\n\r\nJuly 26, 2019, Helsinki, Finland\r\n\r\nImportant dates:\r\nAbstract deadline: May 05, 2019\r\nNew abstract deadline: May 12, 2019\r\nNotification of acceptance: May 19, 2019\r\nNotification of acceptance: May 26, 2019\r\nFull Paper deadline: July 15 2019\r\n\r\n\r\nThroughout the history characters and figurines have had diverse roles in playful practices from rituals to role-playing games, and from dollhouses to Warhammer 40,000. In contemporary play culture tabletop game miniatures offer visual and tangible pleasure while acting also as objects of collection and enabling other hobby practices like painting and sculpting. In role-playing games characters provide value as tools for self-representation and instruments for advancing the story, amongst other things.\r\n\r\nRecent technological developments and the ludification of culture have made characters and figurines even more central in play culture. Social capital is accumulated by sharing pictures and videos of figurines like Blythe dolls and miniature collections, through services like Instagram and YouTube. This form of social photo play also allows adults to play with toys with less fear of social stigma. Game characters like Angry Birds, Lara Croft and Beholder have become iconic pop-culture figures with their own product brands, including but not limited to, plush toys, action figures and board games. Indeed, transmediality allows novel uses for popular characters, and nostalgic feelings, which feed the popularity of phenomena like Pokémon Go.\r\n\r\nThe topic of the seminar, “characters and figurines”, ties tightly into the Ropecon 2019 theme, mythology, as characters are central elements in mythologies, while figurines are used to represent various mythological creatures in games, religion and other activities.\r\n\r\nWe invite you to present on topics related to characters and figurines. The list of possible topics includes but is not limited to:\r\n\r\nMiniature war games and miniatures in board games\r\nTangibility / visuality / aesthetics of game figurines\r\nSculpting, painting, modding, and playing with figurines\r\nCollecting action figures and dolls\r\nRoles, characters, personae, avatars, pawns, and cursors\r\nPlayer-character relations\r\nRepresentation in role-playing characters\r\nCharacters in transmedia\r\nRole-playing or larp characters: creation, enactment, development, leveling up\r\nCharacters and mythology in games\r\n\r\nCharacters and Figurines is the 2nd annual Ropecon academic seminar, organized as collaboration between Ropecon ry and  the Centre of Excellence in Game Culture Studies (2018-2025). The emphasis of the event is on multiplayer games that players engage in while being physically co-located as that is also the focus of Ropecon. Ropecon is a large, independent, convention devoted to role-playing games, larps, board games, miniature wargames, collectible card games, cosplay, and the like. The convention has been running annually since 1994.\r\n\r\nThe seminar focus is on working papers, and the presentations should encourage discussion. We want to encourage peer-to-peer discussion to refine and develop the papers further. Every paper will be presented for 10 minutes and discussed for 20 minutes. The sessions will be open for all Academic Ropecon ticket holders, but the presentations should be drafted with an academic audience in mind. We warmly welcome submissions from younger scholars and PhD candidates, as well as from more established researchers. The seminar is in discussion with a  journal so that the best papers would be invited to be further developed for publication in a special journal issue.\r\n\r\nSubmission guidelines\r\n\r\nThe papers to be presented will be chosen based on extended abstract review. The abstracts should be 500–1000 words (plus references). Abstracts should be delivered in PDF format. Full papers are distributed prior the event to all participants, in order to facilitate discussion.\r\n\r\nOur aim is that all participants can familiarise themselves with the papers in advance. Therefore, the maximum length for a full paper is 5000 words (plus references). The seminar presentations should encourage discussion, instead of repeating the information presented in the papers. Every paper will be presented for 10 minutes and discussed for 20 minutes.\r\n\r\nSubmissions should be sent to: academic.program@ropecon.fi<mailto:academic.program@ropecon.fi>\r\n\r\nOrganizers\r\n\r\nGeneral Chair: Mr. Ville Kankainen, Tampere University Game Research Lab, Ropecon Program Team\r\nProgram Chair: Dr. Jonne Arjoranta, Center of Excellence: Game Culture Studies\r\n\r\nFurther information and inquiries: academic.program@ropecon.fi<mailto:academic.program@ropecon.fi>\r\n\r\n\r\n--\r\nVille Kankainen\r\n\r\nPhD Candidate\r\nResearcher\r\nGrowing Mind project\r\nOffsetting Game project\r\nTampere University\r\n\r\ntel. +358 41 465 7029\r\n\r\n--\r\nGamesnetwork, discussion list of Digital Games Research Association, www.digra.org\r\nNote: to unsubscribe, send \"UNSUBSCRIBE GAMESNETWORK\" to LISTSERV@UTA.FI from\r\nyour subscribed email account. Web interface to subscribe and manage your subscription:\r\nhttps://listserv.uta.fi/cgi-bin/wa?SUBED1=GAMESNETWORK&A=1 .\r\nThe list archive is available online at: https://listserv.uta.fi/archives/gamesnetwork.html\r\n<html><head>\r\n<meta http-equiv=\"Content-Type\" content=\"text/html; charset=utf-8\">\r\n</head>\r\n<body text=\"#000000\" bgcolor=\"#FFFFFF\">\r\n<p>Due to popular demand, the abstract deadline for Ropecon 2019 Academic Seminar has been extended until 12th of May! New dates are as below:</p>\r\n<p><br>\r\n<b>Important dates:</b><br>\r\n<strike>Abstract deadline: May 05, 2019</strike><br>\r\nNew abstract deadline: May 12, 2019<br>\r\n<strike>Notification of acceptance: May 19, 2019</strike><br>\r\nNotification of acceptance: May 26, 2019<br>\r\nFull Paper deadline: July 15 2019<br>\r\n<br>\r\nThe full cfp can be found below. <br>\r\n</p>\r\n<p>All the best, <br>\r\n</p>\r\n<p>Ville <br>\r\nRopecon Academic Seminar organizer<br>\r\n</p>\r\n<div class=\"moz-cite-prefix\">Ville Kankainen (TAU) kirjoitti 17.2.2019 klo 13.22:<br>\r\n</div>\r\n<blockquote type=\"cite\" cite=\"mid:53f14c52-3a62-ac07-a8c8-ebb4be9a3625@tuni.fi\">\r\n<p>There seemed to be something strange happening with the formatting of the post. Let's try again.\r\n<br>\r\n</p>\r\n<p>Please, spread widely on your networks!<br>\r\n</p>\r\n<p><b>Call for Papers</b><br>\r\nCharacters and Figurines - Ropecon 2019 Academic Track<br>\r\n<a class=\"moz-txt-link-freetext\" href=\"https://2019.ropecon.fi/eng/program/academic-program/\" moz-do-not-send=\"true\">https://2019.ropecon.fi/eng/program/academic-program/</a><br>\r\n<br>\r\nJuly 26, 2019, Helsinki, Finland<br>\r\n<br>\r\nImportant dates:<br>\r\n<strike>Abstract deadline: May 05, 2019</strike><br>\r\nNew abstract deadline: May 12, 2019<br>\r\n<strike>Notification of acceptance: May 19, 2019</strike><br>\r\nNotification of acceptance: May 26, 2019<br>\r\nFull Paper deadline: July 15 2019<br>\r\n<br>\r\n<br>\r\nThroughout the history characters and figurines have had diverse roles in playful practices from rituals to role-playing games, and from dollhouses to Warhammer 40,000. In contemporary play culture tabletop game miniatures offer visual and tangible pleasure\r\n while acting also as objects of collection and enabling other hobby practices like painting and sculpting. In role-playing games characters provide value as tools for self-representation and instruments for advancing the story, amongst other things.\r\n<br>\r\n<br>\r\nRecent technological developments and the ludification of culture have made characters and figurines even more central in play culture. Social capital is accumulated by sharing pictures and videos of figurines like Blythe dolls and miniature collections, through\r\n services like Instagram and YouTube. This form of social photo play also allows adults to play with toys with less fear of social stigma. Game characters like Angry Birds, Lara Croft and Beholder have become iconic pop-culture figures with their own product\r\n brands, including but not limited to, plush toys, action figures and board games. Indeed, transmediality allows novel uses for popular characters, and nostalgic feelings, which feed the popularity of phenomena like Pokémon Go.\r\n<br>\r\n<br>\r\nThe topic of the seminar, “characters and figurines”, ties tightly into the Ropecon 2019 theme, mythology, as characters are central elements in mythologies, while figurines are used to represent various mythological creatures in games, religion and other activities.\r\n<br>\r\n<br>\r\nWe invite you to present on topics related to characters and figurines. The list of possible topics includes but is not limited to:<br>\r\n<br>\r\nMiniature war games and miniatures in board games<br>\r\nTangibility / visuality / aesthetics of game figurines<br>\r\nSculpting, painting, modding, and playing with figurines<br>\r\nCollecting action figures and dolls <br>\r\nRoles, characters, personae, avatars, pawns, and cursors<br>\r\nPlayer-character relations<br>\r\nRepresentation in role-playing characters<br>\r\nCharacters in transmedia<br>\r\nRole-playing or larp characters: creation, enactment, development, leveling up<br>\r\nCharacters and mythology in games<br>\r\n<br>\r\nCharacters and Figurines is the 2nd annual Ropecon academic seminar, organized as collaboration between Ropecon ry and&nbsp; the Centre of Excellence in Game Culture Studies (2018-2025). The emphasis of the event is on multiplayer games that players engage in while\r\n being physically co-located as that is also the focus of Ropecon. Ropecon is a large, independent, convention devoted to role-playing games, larps, board games, miniature wargames, collectible card games, cosplay, and the like. The convention has been running\r\n annually since 1994. <br>\r\n<br>\r\nThe seminar focus is on working papers, and the presentations should encourage discussion. We want to encourage peer-to-peer discussion to refine and develop the papers further. Every paper will be presented for 10 minutes and discussed for 20 minutes. The\r\n sessions will be open for all Academic Ropecon ticket holders, but the presentations should be drafted with an academic audience in mind. We warmly welcome submissions from younger scholars and PhD candidates, as well as from more established researchers.\r\n The seminar is in discussion with a&nbsp; journal so that the best papers would be invited to be further developed for publication in a special journal issue.<br>\r\n<br>\r\nSubmission guidelines<br>\r\n<br>\r\nThe papers to be presented will be chosen based on extended abstract review. The abstracts should be 500–1000 words (plus references). Abstracts should be delivered in PDF format. Full papers are distributed prior the event to all participants, in order to\r\n facilitate discussion. <br>\r\n<br>\r\nOur aim is that all participants can familiarise themselves with the papers in advance. Therefore, the maximum length for a full paper is 5000 words (plus references). The seminar presentations should encourage discussion, instead of repeating the information\r\n presented in the papers. Every paper will be presented for 10 minutes and discussed for 20 minutes.<br>\r\n<br>\r\nSubmissions should be sent to: <a class=\"moz-txt-link-abbreviated\" href=\"mailto:academic.program@ropecon.fi\" moz-do-not-send=\"true\">\r\nacademic.program@ropecon.fi</a><br>\r\n<br>\r\nOrganizers</p>\r\n<p>General Chair: Mr. Ville Kankainen, Tampere University Game Research Lab, Ropecon Program Team<br>\r\nProgram Chair: Dr. Jonne Arjoranta, Center of Excellence: Game Culture Studies<br>\r\n<br>\r\nFurther information and inquiries: <a class=\"moz-txt-link-abbreviated\" href=\"mailto:academic.program@ropecon.fi\" moz-do-not-send=\"true\">\r\nacademic.program@ropecon.fi</a><br>\r\n<br>\r\n</p>\r\n</blockquote>\r\n<pre class=\"moz-signature\" cols=\"72\">-- \r\nVille Kankainen\r\n\r\nPhD Candidate\r\nResearcher\r\nGrowing Mind project\r\nOffsetting Game project\r\nTampere University\r\n\r\ntel. &#43;358 41 465 7029</pre>\r\n</body>\r\n</html>\r\n--\r\nGamesnetwork, discussion list of Digital Games Research Association, <a href=\"http://www.digra.org\" target=\"_blank\">www.digra.org</a>\r\nNote: to unsubscribe, send &quot;UNSUBSCRIBE GAMESNETWORK&quot; to <a href=\"mailto:LISTSERV@UTA.FI\">LISTSERV@UTA.FI</a> from\r\nyour subscribed email account. Web interface to subscribe and manage your subscription:\r\n<a href=\"https://listserv.uta.fi/cgi-bin/wa?SUBED1=GAMESNETWORK&amp;A=1\" target=\"_blank\">https://listserv.uta.fi/cgi-bin/wa?SUBED1=GAMESNETWORK&amp;A=1</a> .\r\nThe list archive is available online at: <a href=\"https://listserv.uta.fi/archives/gamesnetwork.html\" target=\"_blank\">https://listserv.uta.fi/archives/gamesnetwork.html</a>\r\n",
    "attachments": []
}