{
    "subject": "Re: International Conference Invitation - Kuala lumpur, Malaysia",
    "from": "Conference <newsletter@theired.org>",
    "to": "\"foaad@calpoly.edu\" <foaad@calpoly.edu>",
    "cc": null,
    "bcc": null,
    "date": "Fri, 03 Jan 2014 04:41:42 -0500",
    "body": "\nHaving trouble viewing this email? click here: http://viewpage.benchmarkemail.com/c/v?e=40744D&c=40CE7&l=B42F517&email=GeKE%2FJi4xv18S7%2B5%2FktOoZB9gYFv4ITk&relid=4C4A98B5\nAplogizefor Multiple Copies of this email!\n\nDear Professor/Researcher,\n\nJoint International Conference will provide an excellent international forum for sharing knowledge and results in Information Technology, Computer Science, Electronics, Electrical, Mechanical, Civil, Structural and Environmental Engineering, Human Science, Economics and Social Study. The aim of the conference is to provide a platform to the researchers and practitioners from both academia as well as industry to meet and share cutting-edge development in the field \n\n \n\n \nLast Date For Final Paper Submission Round: 20 Nov, 2013\n \n\n \nConference Date(s): January 04-05, 2014\n \n\n \nConference City : Bangkok, Thailand\n\nJoint International Conference consists of the following tracks:\n \n\n \n\n\nTrack 1: Advances in Computing and Information Technology - ACIT 2014\n\nWebsite: www.acit.theired.org\n \n\n \n[1] \n\n Track 2: Advances in Electronics and Electrical Technology - AEET 2014\n\nWebsite: www.aeet.theired.org\n \n\n \n\n\n Track 3: Advances in Environmental and Bio - Technology - AEBT 2014\n\nWebsite: www.aebt.theired.org\n \n\n \n\n \nTrack 4: Advances in Civil, Structural and Mechanical Engineering - ACSME  2014\n \n\n \nwebsite: www.acsme.theired.org\n \n\n \n\n \nTrack 5: Advances in Human Science, Economics and Social Study - AHES 2014\n \n\n \nwebsite: www.ahes.theired.org[2] \n \n\n\nJoint Conference is being organized by The IRED (Institute of Research Engineers and Doctors), will be held during January 04-05, 2014 at Bangkok, Thailand. All the registered papers in the various tracks will proudly be published by IRED-CPS and stored in the SEEK digital Library. Each Paper will be assigned DOI (Digital Object Identifier) from CROSSREF. The Procc. will be submitted to ISI Thomson for Review and Indexing\nPlease take the time to explore the website for more details, check on important dates, and keep yourself up to date on recent changes.[3] \n \n\n \nRegistered Papers (IRED Extended paper guidelines applicable) will be published in the various issues of International journals \n\n \nProspective authors are invited to submit full (original) research papers; which are NOT submitted or published or under consideration anywhere in other conferences or journals; in electronic (PDF only) format via email\nOther IRED conferences can be found at http://theired.org/conference_event.html\n\nWe Request you to forward this email to your colleagues/Researchers/students in order to promote the conference \n\n \nThanks Much\n \nIRED\n\n\n References:\n\n1. http://www.ftcc.theired.org/\n2. http://www.eshb.theired.org/\n3. http://www.benchmarkemail.com/c/l?u=20998A3&e=27DE9A&c=2E5C9&t=1&l=23A8D55&email=roVb%2B%2BWaTLhhsER1tbQoeJMtdysbAGpE\n\n\n\n\nThis message was sent to foaad@calpoly.edu by newsletter@theired.org\n\nYou can modify/update your subscription via the link below\nUnsubscribe from all mailings\nhttp://www.benchmarkemail.com/c/su?e=40744D&c=40CE7&l=B42F517&email=GeKE%2FJi4xv18S7%2B5%2FktOoZB9gYFv4ITk&relid=4C4A98B5\n\nManage Subscription\nhttp://www.benchmarkemail.com/c/s?e=40744D&c=40CE7&l=B42F517&email=GeKE%2FJi4xv18S7%2B5%2FktOoZB9gYFv4ITk&relid=4C4A98B5\n\nForward Email\nhttp://www.benchmarkemail.com/c/f?e=40744D&c=40CE7&l=B42F517&email=GeKE%2FJi4xv18S7%2B5%2FktOoZB9gYFv4ITk&relid=4C4A98B5\n\nReport Abuse\nhttp://www.benchmarkemail.com/Abuse?e=40744D&c=40CE7&l=B42F517&email=GeKE%2FJi4xv18S7%2B5%2FktOoZB9gYFv4ITk&relid=4C4A98B5\n\n113, Barksdale Professional CTR, Newark, New Castle County, DE, United States of America\n\n\n\n\nHaving trouble viewing this email? click here\n\n\n\n\n\n\n\n\nAplogize for Multiple Copies of this email!\nDear Professor/Researcher,\nJoint International Conference will provide an excellent international forum for sharing knowledge and results in Information Technology, Computer Science, Electronics, Electrical, Mechanical, Civil, Structural and Environmental Engineering, Human Science, Economics and Social Study. The aim of the conference is to provide a platform to the researchers and practitioners from both academia as well as industry to meet and share cutting-edge development in the field.\n\nConfrence internationale conjointe fournira une excellente tribune internationale pour le partage des connaissances et des rsultats en technologie de l'information, Informatique, Electronique, lectrique, mcanique, civil, gnie des structures et de l'environnement, des sciences humaines, de l'conomie et de l'tude sociale. Le but de la confrence est de fournir une plate-forme pour les chercheurs et les praticiens du milieu universitaire ainsi que l'industrie de se rencontrer et de partager le dveloppement de pointe dans le domaine.\n\nFinal Round Important Dates:\n\nPaper Submission: 27 January, 2014\nPaper Acceptance: 05 February, 2014\nRegistration / Camera Ready submission: 13 February, 2014\n\n Conference Date(s): March 08-09, 2014\n\n Conference City : Kuala Lumpur, Malaysia\n\n\nJoint International Conference consists of the following tracks:\n\n\nTrack 1: Advances in Civil, Structural, Environmental and Bio-Technology - CSEB 2014\nWebsite: www.cseb.theired.org\n\n\n Track 2: Advances in Computer Science and Electronics Engineering - CSEE 2014\nWebsite: www.csee.theired.org\n\n\n Track 3: Advances in Mechanical and Robotics Engineering- MRE 2014\nWebsite: www.mre.theired.org\n\n\nTrack 4: Advances in Social Science, Economics and Human Behavior - SEH 2014\n\nwebsite: www.seh.theired.org\n \nJoint Conference is being organized by The IRED (Institute of Research Engineers and Doctors), will be held during March 08-09, 2014 at Kuala Lumpur, Malaysia. All the registered papers in the various tracks will proudly be published by IRED-CPS and stored in the SEEK digital Library. Each Paper will be assigned DOI (Digital Object Identifier) from CROSSREF. The Procc. will be submitted to ISI Thomson for Review and Indexing.\nPlease take the time to explore the website for more details, check on important dates, and keep yourself up to date on recent changes.\n\n Registered Papers (IRED Extended paper guidelines applicable) will be published in the various issues of International journals. \n\n Prospective authors are invited to submit full (original) research papers; which are NOT submitted or published or under consideration anywhere in other conferences or journals; in electronic (PDF only) format via email.\nWe Request you to forward this email to your colleagues/Researchers/students in order to promote the conference.\n\nAbout IRED:\nIRED stands for Institute of Research Engineers and Doctors. IRED headquarter is situated in USA and Cyprus with Registration Number 5372545. IRED organize world class international conferences around the globe in order to provide the platform for sharing the new ideas on upcoming multidisciplinary research areas and to promote the research among the students, researchers, professors and scientists over the globe. IRED and its associated networks websites are being accessed by more than 1 million visitors yearly. IRED is promoting research with more than 75000 student members, more than 55000 associated members and more than 5000 senior and fellow members. IRED Editorial Board consists of more than 5000 Eminent Professors, Scientists and industry professionals in order to published only high quality articles. Each article is being peer reviewed two times before publication in any Conference/Journal. IRED Conference Proceedings is being archived in SEEK Digital Library, where you will be able to see the statistics of any article (abstract views, paper downloaded etc). Each paper published in IRED Conference Proceedings is being provided Digital Object Identifies (DOI) from CROSSREF. The Proceedings is being indexed by Google Scholar and also gets submit to major Indexing service providers like ISI Thomson for further review and indexing.\n\n Thanks Much \n IRED\n\n\n\n\n\nThis message was sent to foaad@calpoly.edu by newsletter@theired.org\nUnsubscribe   | Manage Subscription   |  Forward Email  |  Report Abuse\n\n\n\n\n\n113, Barksdale Professional CTR, Newark, New Castle County, DE, United States of America\n\n\n\n\n\n",
    "attachments": []
}