{
    "subject": "RE: [GAMESNETWORK] CFP: Games + Communication Ante-Conference (prior to ICA 2019)",
    "from": "Aubrie Adams <aadams45@calpoly.edu>",
    "to": "Foaad Khosmood <foaad@calpoly.edu>",
    "cc": null,
    "bcc": null,
    "date": "Thu, 10 Jan 2019 11:52:29 -0800",
    "body": "Thanks for thinking of me Foaad! I usually do go to this conference and Ive been going to this Game Studies event the past 5 years. This is actually the first one from this group Im going to be missing as Im heading to a different\r\n conference this Winter! Oh well I suppose : ). \n\n\n- Brie\n\n\n\n\n\n\n\n__________________________________\n\n\nAubrie Adams, PhD\n\n\nhttp://aubrieadams.com\n\n\nFaculty Offices North (47) 36-B\n\r\nCommunication Studies Department\n\n\nCalifornia Polytechnic State University\n\r\n__________________________________\n\n\n\n\n\n\n\n\n\n\n\nFrom:\n Foaad Khosmood <foaad@calpoly.edu> \n\n\nSent:\n Wednesday, January 9, 2019 9:43 AM\n\n\nTo:\n Aubrie Adams <aadams45@calpoly.edu>; David D. Gillette <ddgillet@calpoly.edu>\n\n\nSubject:\n Fw: [GAMESNETWORK] CFP: Games + Communication Ante-Conference (prior to ICA 2019)\n\n\n\n\n\n\n\n\n\n\n\nFYI.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nFrom:\n Games Research Network <\nGAMESNETWORK@uta.fi\n> on behalf of Rabindra Ratan\r\n\n\n <\nraratan@GMAIL.COM\n>\n\n\nSent:\n Wednesday, January 9, 2019 9:34 AM\n\n\nTo:\n Gamesnetwork\n\n\nSubject:\n [GAMESNETWORK] CFP: Games + Communication Ante-Conference (prior to ICA 2019)\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nCall for Papers, Demos and Provocations\n\n\nFor the Games + Communication Ante-Conference\n\n\nFriday, May 24, 2019  Washington, DC\n\n\nhttp://icagamesanteconf.info\n\n\n\n\n(Preceding the International Communication Association (ICA) annual conference)\n\n\n\n\n\n\n\n\n\nWHEN: Papers due January 31; day long conference onFriday\n,\nMay 24,\r\n 2019 \n\n\n\n\nLOCATION: Washington, DC at the\nAU\r\n Game Lab\n\n\n\n\nThe\nICA Game Studies Division\nand\nAmerican University (AU)\nrequest\r\n proposals for papers, unusual panels and demos for a one-day conference in Washington, DC on the intersection of games, research in the field of communication, policy, and innovative methods. The event will be hosted in the new AU Game Lab and feature a reception\r\n afterward.\n\n\n\n\nThis is a deliberately intimate event. Registration will be capped at 50 people, with priority to speakers to reward participation  so submit! Cost will be minimal, primarily for food and facilities,\r\n and likely to be well under $100, depending on the sponsorships we obtain. If your organization would like to be a sponsor, let us know.\n\n\n\n\nWHO SHOULD SUBMIT:\nGame and communication scholars  but also designers, DC game strategists and funders.\n\n\n\n\nBACKGROUND:\nThis is a new twist on traditional academic conferences, with several unusual formats and some DC specialties\r\n including government funding and policy implications for games research. Today, the study of games influences design, shapes our understanding of society, and is applied in domains from education to healthcare, museums and urban planning. All are welcome.\r\n Emerging technologies, including Virtual Reality and Augmented Reality, use game engines even when applied to broader communicative purposes.\n\n\n\n\nOUR GOAL:\nWe are deliberately hosting an Ante-Conference to allow for more provocative content than that usually encountered\r\n in traditional academic venues. Therefore, we not only request traditional research papers, but also solicit ideas beyond research, including failures on which scholars can build, methods to link design principles to theories, and workshops to probe genuinely\r\n difficult topics of game research and design. Traditional scholarship is still welcome, but the proposal should address take into account the unique themes and goals of this conference.\n\n\n\n\nDC NETWORKING IDEAS:\nWe also are looking for ideas on how the event might best tap into Washington DCs rich universe of\r\n federal funding agencies, policymakers and design practitioners. Currently we are considering inviting select representatives to a networking reception at the end of the day, possibly with a keynote panel just beforehand. The focus will be on how we should\r\n be improving the connection between research and policy/funding/design. Ideas in this direction can be submitted as an email inquiry or as a more formal panel (see below).\n\n\n\n\nSUBMISSION TYPES\n\n\n\n\nOPTION A:\nmore traditional, including:\n\n\n\n\n\n\r\n\nResearch Reports\nand\nTheoretical Papers\nsubmitted\r\n as\nExtended Abstracts\nof\n500  1200 words\n. Each proposal should contain a (1) brief description of the research gap and\r\n theoretical background, (2) research questions, (3) methodological approach, (4) progress and anticipated implications. Submissions are not required to provide full results in cases of ongoing data collection, but presenters are expected to present their findings\r\n at the conference. Make sure to give a sense of your progress so far, and why you are likely to have something provocative or useful by late spring. Traditional papers will be given less priority than those clearly stating why they should be discussed outside\r\n a traditional conference (e.g., thorny issues about how to frame a particular finding may be more interesting than basic learning gains from a game).\n\n\n\n\n\n\r\n\nPanel Proposals\nare to be submitted as\nExtended\r\n Abstracts\nof\n500  1200 words\n. Each panel proposal should consist of (1) abstract of the core ideas the panel desires to address, (2) a rationale for the panel, and (3) a\r\n brief overview of individual topics covered. Non-traditional panels, or those relevant to the topics below are encouraged to apply. Evidence of high-quality speaking/speakers is recommended.\n\n\n\n\nOPTION B:\ninnovative and provocative formats, especially as alternatives to the traditional structures of academic conferences:\n\n\n\n\n\n\r\n\nHall of Meaningful Failure\n: We invite studies from scholars that should have worked  but didnt.\r\n This format is meant to encourage scholars to view their research as being iterative and building upon itself, like a well-designed game. Or perhaps to warn of a pitfall that more game scholars should be aware of and avoid at all costs. Send a\n500\r\n  1200 word\nproposal of what you will discuss. Indicate if you would like no recordings and for attendees to avoid public discussion to make for a safer space for honest discussion.\n\n\n\n\n\n\r\n\nImplications for Policy or Funding\n: These\n1000\r\n  1200\nword papers translate a recent publication in games or related research into clear recommendations (bullet points) for what policy makers should do differently, based on the insights of the paper. The source paper should not be your\r\n own, or your teams work. Be as specific as possible about the funding agency or policy unit that should respond.\n\n\n\n\n\n\r\n\nUniversity Studios\n: What have university-led studios with external clients or earned revenue\r\n models learned about making games, and how can they improve? Grant-funded labs could also share findings, so long as they can address how to balance the relationship with the funder in the making and distribution process. Submit a\n1000\r\n  1200\nword paper, ideally comparing your studio or lab with at least one other institution or model.\n\n\n\n\n\n\r\n\nMethods that Break Play\n: How is studying games different from other fields of communication?\r\n Send a\n500  1200\nword abstract. Do we need to tweak any established methods in order to study games well?\n\n\n\n\n\n\r\n\nDesign Principles\n: These\n500  1200\nword\r\n abstracts will directly address how game studies scholarship can affect design. Each principle or mini-theory for design should be posited and defended, such as friends lists should be ranked by recency. Such principles are needed so that designers can\r\n act on research findings.\n\n\n\n\n\n\r\n\nPlayful Societies\n: These\n500  1200 word\nabstracts\r\n reflect on how playful practices are migrating out of games. This might include activities like cheating or the subversion of norms and rules, as well as how playful attitudes persist after the game is over. Papers can also provide recommendations and ideas\r\n of how to bridge from games into other domains and activities.\n\n\n\n\n\n\r\n\nWell-Played-with-a-Theory\n: We invite\n500\n\n750\nword\r\n proposals that bring audiences through a bit of real game play, either commercial or serious games, with a twist; the talks must highlight a key theory that is becoming more prevalent in game studies. We also ask game developers to submit under this heading\r\n utilizing gameplay from their own games. Ideally you should be ready to bring whatever console or adapters necessary to show live gameplay.\n\n\n\n\n\n\r\n\nThe Wrong Term\n: Whats a word that game scholars should cease using, or be using differently?\r\n Submit\n250  500\nword abstracts for presentations that will comprise micro-talks lasting no more than 10 minutes, followed by plenty of debate.\n\n\n\n\n\n\r\n\nDemo\n\n(showcase)\n:\n250-500\nword\r\n abstract, including the current status of the project and readiness of the demo. We plan to show demos during the lunch hour or evening reception in a parallel format. Priority will be given to games that are used to test a research idea or apply a research\r\n finding in a novel way that advances our understanding of the connection between research and practice.\n\n\n\n\nHints, Selection Process and Curatorial Approach\n\n\n\n\nTo maximize quality with such fluid and unusual categories, the chairs will curate this event. Our goal is to make the day provocative and satisfying as an experience, not necessarily to represent all\r\n categories equally or in proportion to the number of submissions.\n\n\n\n\nOur main advice is to craft proposals that you find personally interesting and think your peers would find provocative with implications for the field or future research.\n\n\n\n\nWe expect the tone of the conference to be reflective, with plenty of time for questions and discussion. It will likely have one keynote speaker, include an arcade that will showcase demonstration games\r\n (see above), and a networking reception.\n\n\n\n\n\nHow to Submit\n\n\n\n\n\n\r\n\nPlease email all submissions and questions to Maxwell Foxman (\nmfoxman@uoregon.edu\n).\n\n\n\n\n\n\r\n\nIn the\ntitle\nof your\nemail\ninclude the submission\r\n type under which you are presenting. As an example: For someone submitting under the Well-Played Theory, the subject line should read:\nWELL-PLAYED THEORY: [Title of Submission]\n\n\n\n\n\n\r\n\nSubmissions should include authors names, institutions and titles. Where appropriate, submissions will be anonymized by the organizers (i.e., you do not need to remove your name) and\r\n reviewed by a panel of international scholars.\n\n\n\n\nImportant Dates\n\n\n\n\n\n\r\n\nDeadline for submissions: January 31, 2019 at 11:59pm EST.\n\n\n\n\n\n\r\n\nNotification of Acceptance: February 22, 2019. (Speakers are expected to register within a week of their notification of acceptance so we can finalize the public program.)\n\n\n\n\n\n\r\n\nBe notified! Email us if you would like to be notified when the registration page goes up in February\n\n\n\n\nLets up the ante for traditional conferences!\n\n\n\n\n\n\n\n\n\nConference Committee:\n\n\n\n\nChair: Maxwell Foxman, University of Oregon\n\n\n\n\nCo-Chair: Benjamin Stokes, American University\n\n\n\n\nAdvisor: Rabindra Ratan, Michigan State University\n\n\n\n\n\n\n\n-- Gamesnetwork, discussion list of Digital Games Research Association,\r\n\nwww.digra.org\n Note: to unsubscribe, send \"UNSUBSCRIBE GAMESNETWORK\" to\r\n\nLISTSERV@UTA.FI\n from your subscribed email account. Web interface to subscribe and manage your subscription:\r\n\n\r\nhttps://listserv.uta.fi/cgi-bin/wa?SUBED1=GAMESNETWORK&A=1\n . The list archive is available online at:\r\n\nhttps://listserv.uta.fi/archives/gamesnetwork.html",
    "attachments": []
}