{
    "subject": "Re: Conference on Artificial Intelligence (ICAI 2012) - reviews about your paper - re-sending",
    "from": "\"Franz J. Kurfess\" <fkurfess@calpoly.edu>",
    "to": "Foaad Khosmood <foaad@calpoly.edu>",
    "cc": null,
    "bcc": null,
    "date": "Mon, 14 May 2012 16:41:27 -0700",
    "body": "Hi Foaad,\n\nI've had a look at the conference Web site, in particular at the history and the program committee members. It's been around for a while, and I've recognized a few names on the committee member list, which are good signs. I've also had a look at the search results, and have recognized some of the author names. So overall, I think your assessment is right - it's not a top conference, but seems to be legitimate. \n\nFranz\n\nOn May 14, 2012, at 16:21, Foaad Khosmood wrote:\n\n> Dear Franz,\n> \n> This email and the one immediately prior to it is my communication from ICAI-2012. \n> The guy making the accusations (it *appears* to be just one person, but I don't know) is here:\n> https://sites.google.com/site/worlddump1/\n> \n> There was another wordpress site, seemingly by the same critic who was accusing WorldComp of being a one man show run by a legitimate CS professor from Georgia. There were replies and counter replies on there, but the post has been deleted. (It was there a few days ago).\n> \n> There's no disputing that this isn't a \"top quality\" venue. I got suspicious when I didn't receive reviews, but now they have sent them. (Although they are not very detailed).\n> \n> Anyway, I really appreciate and value your input in this matter. Thanks.\n> \n> Foaad Khosmood \n> foaad@calpoly.edu | (805) 756-2911 \n> \n> ----- Forwarded Message -----\n> From: \"Steering Committee\" <sc@world-comp.org>\n> To: foaad@calpoly.edu\n> Sent: Sunday, May 13, 2012 12:23:43 PM\n> Subject: Conference on Artificial Intelligence (ICAI 2012) - reviews about your paper - re-sending\n> \n> \n> Dear Dr. Foaad Khosmood:\n> \n> (We are re-sending this email - our earlier attempt had bounced back; the reason\n> for the bounce was that a mediator server had assigned 87 points for the use of\n> HOT words/terms/attachments that appeared in our earlier email and so wrongly\n> determined that that message was spam - we are sending this email with the\n> hope that you will receive it this time since we included the reviews as text,\n> instead of attachment, and also we have tried to avoid using too many HOT terms.)\n> \n> You will find the reviews of the following accepted submission in this email.\n> \n> ICA3949\n> Comparison of Sentence-level Paraphrasing Approaches for Statistical Style Transformation\n> Foaad Khosmood\n> California Polytechnic State University, California, USA\n> \n> Accepted for the following conference:\n> 14th International Conference on Artificial Intelligence (ICAI'12: July 16-19,\n> 2012, USA).\n> http://www.worldacademyofscience.org/worldcomp12/ws/conferences/icai12\n> \n> Track Chair: 181\n> Referees' Reports: (Some authors may also receive the same evaluation\n>     report directly from the track chair who arranged the evaluation.)\n> \n>     Originality (1 Poor - 20 Very Good): 18\n>     Technical Quality (1 Poor - 20 Very Good): 15\n>     Significance of Contribution (1 Poor - 20 Very Good): 16\n>     Readability and Organization (1 Poor - 20 Very Good): 17\n>     Relevance (1 Not relevant - 20 Very relevant): 20\n>     Overall Recommendation (1 Reject - 20 Strong Accept): 16\n>     Degree of Expertise of Reviewer in the topic (1 Poor - 20 Good): 18\n>     Specific Comment to the Authors:\n> \n>     a> This is a concise paper - I very much liked it and learned from it.\n>     a> I recommend its acceptance without hesitation. Dr. Foaad presents in this paper\n>     a> six distinct English-language sentence paraphrasing techniques. He then describes\n>     a> the basic algorithm for each and score them on precision and recall using 50\n>     a> random sentences from project Tatoeba. His main objective is to use these\n>     a> techniques for style transformation. Quite enlightening. There is novelty in his\n>     a> study. I would have liked to see a more in-depth presetation in section III\n>     a> (on Methodology).\n> \n>     b> I nominate ACCEPT for this paper. The information provided in Table 3 and\n>     b> Figure 3 are a little fuzzy - a more detailed explanation would help.\n>     b> The reference list is good and relevant (as well as being uptodate).\n> \n> For information regarding author instructions including:\n> \n> - Presentation Formats / Accepted Paper Categories\n> - Typing Instructions\n> - Deadline (registration and camera-ready papers due: May 19, 2012);\n>  We strongly encourage authors to register as soon as possible.\n>  (Please note that the deadline that appears on the conference web site is\n>  May 16th - however, since this notification was sent 3 days late, we\n>  have extended the deadline for this paper to May 19).\n> - Conference Registration\n> - Hotel Reservation\n> - Conference Program/Schedule\n> Please visit:\n> http://www.worldacademyofscience.org/worldcomp12/ws/authors\n> \n> For Submission (uploading) of Final Camera-Ready Papers for Publication\n> in the Conference Proceedings/book, please visit:\n> http://www.ucmss.com/cr/main/papersNew/worldcomp12_first_html\n> \n> To Request Invitation Letters for US Visa Purposes, please visit:\n> http://www.ucmss.com/cr/main/invitations/worldcomp_index_html\n> \n> General information can be found at:\n> http://www.world-academy-of-science.org/\n> \n> Congratulations, and thank you for your contribution to the Conference.\n> We look forward to seeing you at the conference in July.\n> \n> Kind regards,\n> Steering Committee, ICAI 2012\n> http://www.worldacademyofscience.org/worldcomp12/ws/conferences/icai12\n\n",
    "attachments": []
}