{
    "subject": "Re: [GAMESNETWORK] Call for Papers: Animals and the City workshop at ACI2019",
    "from": "Susana Ruiz <susiruiz@GMAIL.COM>",
    "to": "Gamesnetwork <gamesnetwork@uta.fi>",
    "cc": null,
    "bcc": null,
    "date": "Tue, 30 Jul 2019 18:50:28 +0200",
    "body": "(Apologies, an error in sending previous message.)\n\n\nSent from my iPhone\n\n> On Jul 30, 2019, at 6:49 PM, Susana Ruiz  wrote:\n> \n> Or your game...?\n> \n> Sent from my iPhone\n> \n>> On Jul 30, 2019, at 3:25 PM, Anton Nijholt  wrote:\n>> \n>> Animals and the (Playable) City: A Critical Perspective\n>> A Workshop held as part of the Sixth International Conference on Animal-Computer Interaction (ACI 2019) \n>> 12 November 2019, Haifa, Israel\n>>  \n>> https://sites.google.com/view/animalsandthecity/home\n>>  \n>> Submission Deadline: 27 September 2019\n>>  \n>> Call for Participation\n>> Cities by their very nature are human creations in the sense that they are built to support human habitation and to represent the image of the communities that build them.  However, from their very beginning cities have also served as a home to a variety of animals from the domesticated pets and livestock that formed an integral part of many households to the feral and wild animals who have found the urban environment with its novel structures, infrastructures, activities and food stuffs to be rife with opportunities that could be harnessed to their needs.\n>>  \n>> Although cities are utilitarian creations, they invite and celebrate play.  On the one hand, play can be seen in the colours and contours  of the city as its architects and residents play with form and matter to give the streets and structures their shape, identity and meaning.  On the other, play can be seen in the various playful behaviours exhibited by the denizens of the city from the odd pedestrian humming and skipping along the street through the audacious practitioner of parkour jumping from one building to the next to the multitude of games played in and around the parks and playgrounds that dot the city.  Thus, the utilitarian yet playful nature of the city goes hand in hand with the purposeful and playful nature of its inhabitants who go about their days seeking to fulfil both their physical needs and their playful nature and offers a host of opportunities for the evolution of new behaviours and sustainable co-habitation.\n>>  \n>> Recent advances in microelectronics and the connectivity offered by the internet have led to the development of smart cities in which arrays of sensors and actuators are used to monitor and control urban infrastructure with a higher level of efficiency and playable cities in which these devices are employed in the creation of novel interactions and playful experiences within the city.  These advances and the notions of the smart and the playable city offer the means through which we can explore new opportunities for human and animal habitation and co-existence within the city as well as raise new challenges and concerns about privacy, control, distraction and duplicity.\n>>  \n>> In this workshop we seek to delve into what it means to be a non-human animal in the city and how digital technology and the notions of play can play a part in supporting, enhancing and advancing non-human animal life in the city. We invite researchers and practitioners to submit idea, concept, speculative, work in progress or position papers related to theoretical, methodological, technological or practical aspects of these questions with the aim of furthering the discussion and setting the stage for future collaboration.  Topics of interest include, but are not limited to:\n>>  \n>>   Critical perspectives on non-human animals and/in the city, be they companions, strays, pests or wild encroachers\n>>  Supporting service animals such as guide dogs in the city\n>>  smart cities and smart animals  sensor-based interactions with animals in the city\n>>  The smart and playful city as a digital playground for human and non-human animals\n>>  The Internet of Animals in the smart city\n>>  Policing the polis  tracking and controlling animals in the city and their access to and through it.  \n>>  \n>> Papers which may be up to 10 pages long (excluding references) in the CHI Extended Abstract formatshould be submitted as a PDF file via easychair by 27th September 2019. \n>>  \n>> All submissions will undergo a double-blind peer review process and therefore and all identifying information about authors needs to be removed from the submitted manuscripts.  Papers will be selected based on their quality and relevance to the workshop.  Accepted submissions will be published as part of the conference proceedings.  At least one author of each accepted position paper must attend the workshop and must register for both the workshop and for at least one day of the ACI 2019 conference.\n>>  \n>> Organizers\n>>  \n>> Yoram Chisik\n>> Yoram Chisik is a digital media researcher, information technology catalyst and thinker of errant thoughts. His research explores the nature and meaning of technological interactions in the digital age. Prior to engaging in an academic career he worked as a Geographical Information Science (GIS) consultant advising government agencies and corporations on the potential and application of GIS technology and developing GIS based software solutions. Chisik is a past chair of the Advances in Computer Entertainment Technologies (ACE) conference that hosted the first conference on Animal Computer Interaction in 2014 and Intetain which hosted a series of workshops on playable cities, an associate editor of the specialty section Human-media Interaction of Frontiers and an adjunct lecturer at the Rhine-Waal University of Applied Sciences.\n>>  \n>> Mattia Thibault\n>> Mattia Thibault is a member of the Gamification Group at the University of Tampere. He holds a PhD in Semiotics and Media from Turin University, and has been visiting researcher at Tartu University, The Strong Museum of Play, and Helsinki University. His research interests revolve around the semiotics of play, toys, the cultural relevance of games and gamification. He is currently ER of the project ReClaim (Marie Sklodowska Curie IF), dealing with urban gamification and playable cities.\n>>  \n>> Anton Nijholt \n>> Anton Nijholt has interest in human-computer interaction, entertainment computing, affective computing, humor research and brain-computer interfacing. He is authors of hundreds of research papers in these areas. He has been program chair or general chair of many international conferences and workshops devoted to these topics. Nijholt is chief-editor of the specialty section Human-media Interaction of Frontiers in Psychology and he is series editor of the Springer Book Series on Gaming Media and Social Effects. Nijholt is editor of the 2016 book: Playable Cities: The City as a Digital Playground and the 2019 book Making Smart Cities More Playable. Exploring Playable Cities.\n>>  \n>> Heli Vtj \n>> Heli Vtj studies animal-computer interaction, user experience, and application of new media technologies to different contexts. She is also an expert in animal training and welfare. She acts actively as a program chair and member in a number of conferences and has chaired several scientific and practical workshops. She has authored over 70 peer-reviewed publications. She works at Tampere University as a postdoctoral researcher.\n>>  \n>> Further Information\n>> For further information or questions contact Yoram Chisik at ychisik@gmail.com\n>>  \n>> https://sites.google.com/view/animalsandthecity/home\n>>  \n>>  \n>> -- Gamesnetwork, discussion list of Digital Games Research Association, www.digra.org Note: to unsubscribe, send \"UNSUBSCRIBE GAMESNETWORK\" to LISTSERV@UTA.FI from your subscribed email account. Web interface to subscribe and manage your subscription: https://listserv.uta.fi/cgi-bin/wa?SUBED1=GAMESNETWORK&A=1 . The list archive is available online at: https://listserv.uta.fi/archives/gamesnetwork.html\n\n--\nGamesnetwork, discussion list of Digital Games Research Association, www.digra.org\nNote: to unsubscribe, send \"UNSUBSCRIBE GAMESNETWORK\" to LISTSERV@UTA.FI from\nyour subscribed email account. Web interface to subscribe and manage your subscription:\nhttps://listserv.uta.fi/cgi-bin/wa?SUBED1=GAMESNETWORK&A=1 .\nThe list archive is available online at: https://listserv.uta.fi/archives/gamesnetwork.html\n\n(Apologies, an error in sending previous message.)Sent from my iPhoneOn Jul 30, 2019, at 6:49 PM, Susana Ruiz <susiruiz@gmail.com> wrote:Or your game...?Sent from my iPhoneOn Jul 30, 2019, at 3:25 PM, Anton Nijholt <a.nijholt@utwente.nl> wrote:\n\n\n\nAnimals and the (Playable) City: A Critical Perspective\nA Workshop held as part of the Sixth International Conference on Animal-Computer Interaction (ACI\n 2019) \n12 November 2019, Haifa, Israel\n \nhttps://sites.google.com/view/animalsandthecity/home\n \nSubmission Deadline: 27 September 2019\n \nCall for Participation\nCities by their very nature are human creations in the sense that they are built to support human habitation and to represent the image\n of the communities that build them.  However, from their very beginning cities have also served as a home to a variety of animals from the domesticated pets and livestock that formed an integral part of many households to the feral and wild animals who have\n found the urban environment with its novel structures, infrastructures, activities and food stuffs to be rife with opportunities that could be harnessed to their needs.\n \nAlthough cities are utilitarian creations, they invite and celebrate play.  On the one hand, play can be seen in the colours and contours\n of the city as its architects and residents play with form and matter to give the streets and structures their shape, identity and meaning.  On the other, play can be seen in the various playful behaviours exhibited by the denizens of the city from the odd\n pedestrian humming and skipping along the street through the audacious practitioner of parkour jumping from one building to the next to the multitude of games played in and around the parks and playgrounds that dot the city.  Thus, the utilitarian yet playful\n nature of the city goes hand in hand with the purposeful and playful nature of its inhabitants who go about their days seeking to fulfil both their physical needs and their playful nature and offers a host of opportunities for the evolution of new behaviours\n and sustainable co-habitation.\n \nRecent advances in microelectronics and the connectivity offered by the internet have led to the development of smart cities in which\n arrays of sensors and actuators are used to monitor and control urban infrastructure with a higher level of efficiency and playable cities in which these devices are employed in the creation of novel interactions and playful experiences within the city. \n These advances and the notions of the smart and the playable city offer the means through which we can explore new opportunities for human and animal habitation and co-existence within the city as well as raise new challenges and concerns about privacy, control,\n distraction and duplicity.\n \nIn this workshop we seek to delve into what it means to be a non-human animal in the city and how digital technology and the notions\n of play can play a part in supporting, enhancing and advancing non-human animal life in the city. We invite researchers and practitioners to submit idea, concept, speculative, work in progress or position papers related to theoretical, methodological, technological\n or practical aspects of these questions with the aim of furthering the discussion and setting the stage for future collaboration.  Topics of interest include, but are not limited to:\n \n  Critical perspectives on non-human animals and/in the city, be they companions, strays, pests or wild encroachers\n Supporting service animals such as guide dogs in the city\n smart cities and smart animals  sensor-based interactions with animals in the city\n The smart and playful city as a digital playground for human and non-human animals\n The Internet of Animals in the smart city\n Policing the polis  tracking and controlling animals in the city and their access to and through it.  \n \nPapers which may be up to 10 pages long (excluding references) in the CHI\n Extended Abstract formatshould be submitted as a PDF file via easychair by 27th September 2019. \n \nAll submissions will undergo a double-blind peer review process and therefore and all identifying information about authors needs to\n be removed from the submitted manuscripts.  Papers will be selected based on their quality and relevance to the workshop.  Accepted submissions will be published as part of the conference proceedings.  At least one author of each accepted position paper must\n attend the workshop and must register for both the workshop and for at least one day of the ACI 2019 conference.\n \nOrganizers\n \nYoram Chisik\nYoram Chisik is a digital media researcher, information technology catalyst and thinker of errant thoughts. His research explores the\n nature and meaning of technological interactions in the digital age. Prior to engaging in an academic career he worked as a Geographical Information Science (GIS) consultant advising government agencies and corporations on the potential and application of\n GIS technology and developing GIS based software solutions. Chisik is a past chair of the Advances in Computer Entertainment Technologies (ACE) conference that hosted the first conference on Animal Computer Interaction in 2014 and Intetain which hosted a series\n of workshops on playable cities, an associate editor of the specialty section Human-media Interaction of Frontiers and an adjunct lecturer at the Rhine-Waal University of Applied Sciences.\n \nMattia Thibault\nMattia Thibault is a member of the Gamification Group at the University of Tampere. He holds a PhD in Semiotics and Media from Turin\n University, and has been visiting researcher at Tartu University, The Strong Museum of Play, and Helsinki University. His research interests revolve around the semiotics of play, toys, the cultural relevance of games and gamification. He is currently ER of\n the project ReClaim (Marie Sklodowska Curie IF), dealing with urban gamification and playable cities.\n \nAnton Nijholt \nAnton Nijholt has interest in human-computer interaction, entertainment computing, affective computing, humor research and brain-computer\n interfacing. He is authors of hundreds of research papers in these areas. He has been program chair or general chair of many international conferences and workshops devoted to these topics. Nijholt is chief-editor of the specialty section Human-media Interaction\n of Frontiers in Psychology and he is series editor of the Springer Book Series on Gaming Media and Social Effects. Nijholt is editor of the 2016 book: Playable Cities: The City as a Digital Playground\n and the 2019 book Making Smart Cities More Playable. Exploring Playable Cities.\n \nHeli Vtj \nHeli Vtj studies animal-computer interaction, user experience, and application of new media technologies to different contexts.\n She is also an expert in animal training and welfare. She acts actively as a program chair and member in a number of conferences and has chaired several scientific and practical workshops. She has authored over 70 peer-reviewed publications. She works at Tampere\n University as a postdoctoral researcher.\n \nFurther Information\nFor further information or questions contact Yoram Chisik at ychisik@gmail.com\n \nhttps://sites.google.com/view/animalsandthecity/home\n \n \n\n\n\n--\nGamesnetwork, discussion list of Digital Games Research Association, www.digra.org\nNote: to unsubscribe, send \"UNSUBSCRIBE GAMESNETWORK\" to LISTSERV@UTA.FI from\nyour subscribed email account. Web interface to subscribe and manage your subscription:\nhttps://listserv.uta.fi/cgi-bin/wa?SUBED1=GAMESNETWORK&A=1 .\nThe list archive is available online at: https://listserv.uta.fi/archives/gamesnetwork.html\n--\nGamesnetwork, discussion list of Digital Games Research Association, www.digra.org\nNote: to unsubscribe, send \"UNSUBSCRIBE GAMESNETWORK\" to LISTSERV@UTA.FI from\nyour subscribed email account. Web interface to subscribe and manage your subscription:\nhttps://listserv.uta.fi/cgi-bin/wa?SUBED1=GAMESNETWORK&A=1 .\nThe list archive is available online at: https://listserv.uta.fi/archives/gamesnetwork.html\n",
    "attachments": []
}