{
    "subject": "Re: [GAMESNETWORK] CFP: The Aesthetics of Computer Games",
    "from": "Michael Austin <mlatx81@GMAIL.COM>",
    "to": "Gamesnetwork <gamesnetwork@uta.fi>",
    "cc": null,
    "bcc": null,
    "date": "Fri, 07 Jun 2019 14:06:56 -0500",
    "body": "Please do not let this thread lull any LGBTQ list member into a false sense of security.\n\nIt should be noted that since the “Gay Propaganda Law” was passed in 2013, hate crimes against LGBT people in Russia has more than doubled. https://www.reuters.com/article/us-russia-lgbt-crime/lgbt-hate-crimes-double-in-russia-after-ban-on-gay-propaganda-idUSKBN1DL2FM\n\nForeigners accused of spreading “gay propaganda” (whatever they determine that means), can face 15 days in prison before being deported, and foreigners can be punished even more harshly if they think you’re spreading gay propaganda online:\nhttp://www.globalequality.org/component/content/article/1-in-the-news/186-the-facts-on-lgbt-rights-in-russia\n\nYou’ll recall the French couple that was violently beaten IN ST. PETERSBURG during the World Cup (when protection for foreigners was likely strongest). https://attitude.co.uk/article/gay-world-cup-fan-hospitalised-after-violent-homophobic-attack-in-russia/18199/\n\nAgain, Human Rights organizations and activists note that homophobic attacks are still on the rise in Russia, even in large cities, and crack-downs by the government are getting worse and more frequent: https://www.reuters.com/article/russia-lgbt-attitudes/feature-arrested-and-harrassed-russias-lgbt-community-fears-crackdown-worsening-idUSL8N1W51TT\n\nSpartacus is perhaps the most world-renowned publication related to travel by the LGBTQ community, and they publish an index for safe travel by country, with Russia appearing near the bottom of the list:\nhttps://spartacus.gayguide.travel/gaytravelindex_2018.pdf\n\nDespite what non-LGBTQ locals may say and what paid travel ads may promise about travel to St. Petersburg, it is absolutely not safe for LGBTQ people travel there, so please make a decision to travel there very carefully. \n\nMichael\n\n> On Jun 7, 2019, at 12:01 PM, Леонид Мойжес <moyzhesl@gmail.com> wrote:\n> \n> Hello everyone.\n> \n> \n> \n> The official law behind LGBT discrimination in Russia is so-called \"Russian gay propaganda Law\" https://en.wikipedia.org/wiki/Russian_gay_propaganda_law It prohibits spreading of the information about LGBT among minors. And while it is absolutely disgusting, from the practical point of view this law poses no problem for the foreigners coming for an international conference. The only way someone could run into problems is if there would be a person under age of 18 present on the conference, and then someone would file a complaint about him hearing something positive about LGBT. But since conference would be in English, and most Russians, especially those who support this law, do not know this language, I believe that it would be fine.\n> \n> \n> пт, 7 июн. 2019 г. в 16:46, Phoenix Perry <contact@phoenixperry.com>:\n>> Hi folks,\n>> \n>>  \n>> \n>> Does anyone know the actual law for those of us who are activists online? I googled and being out doesn’t appear to be illegal to be gay and being a foreigner would be ok?  This is actually a bit scary.\n>> \n>>  \n>> \n>> Thanks in advance,\n>> \n>>  \n>> \n>> Phoenix\n>> \n>>  \n>> \n>>  \n>> \n>>  \n>> \n>> From: Feng Zhu\n>> Sent: Friday, June 7, 2019 2:01 PM\n>> To: Gamesnetwork\n>> Subject: Re: [GAMESNETWORK] CFP: The Aesthetics of Computer Games\n>> \n>>  \n>> \n>> Dear Dr Parker,\n>> \n>> Thanks for asking a question that may have been on many people’s minds. I have been discussing this issue with Alina Latypova, the conference chair. My understanding is that St Petersburg is an international city, and that it is extremely unlikely that there will be any LGBT directed harassment. There also appear to be high levels of support for equal rights for the LGBT community in response to the government’s lamentable position. Of course nobody can give definitive assurances about any city, but I hope that we can offer some reassurances. We have an inclusivity policy that is stated on the website. Anyone is welcome to write to us to continue this discussion: feng.zhu@kcl.ac.uk\n>> \n>> Kind regards,\n>> \n>> Feng\n>> \n>>  \n>> \n>> On Thu, Jun 6, 2019 at 8:01 PM Alesja Serada <alesja.serada@gmail.com> wrote:\n>> \n>> I travel to Russia on a regular basis, to this particular research center as well (and they are doing a great job!). Saint Petersburg is a very welcoming place, just like any big European city. Can't say anything about being gay in Russia in general, but in Saint Petersburg, in most social situations, I suppose, it will be completely safe.\n>> \n>> AS\n>> \n>>  \n>> \n>> On Thu, Jun 6, 2019 at 9:48 PM Parker <jparker@ucalgary.ca> wrote:\n>> \n>> Is Russia a safe place to visit? Are the gay members of our community going to be safe?\n>> \n>>  \n>> \n>> On 2019-06-06 3:27 a.m., Feng Zhu wrote:\n>> \n>> Call for papers \n>> \n>> The 13th International Conference on the Philosophy of Computer Games: The Aesthetics of Computer Games \n>> \n>> Conference Committee: \n>> \n>> Program Chair: \n>> Feng Zhu (King’s College London) \n>> feng.zhu@kcl.ac.uk\n>> \n>> Conference Chairs: \n>> Alina Latypova (St Petersburg State University) \n>> latypova.al@gmail.com\n>> Konstantin Ocheretyany (St Petersburg State University) \n>> kocheretyany@gmail.com\n>> \n>> \n>> We invite submissions to the 13th International Conference on the Philosophy of Computer Games, organised by the Game Philosophy Network, together with the Centre for Media Philosophy and Laboratory for Computer Games Research, in St Petersburg, Russia, on October 21–24, 2019. \n>> \n>> The theme of this year’s conference is ‘The Aesthetics of Computer Games’. Playing games yields particular kinds of playful experiences or perceptions through the senses, which can be studied with an aesthetic focus, emphasising aísthēsis over noêsis. Computer games can be regarded as playful media that organise our perceptions and modify our sensibilities. For this conference, we welcome submissions on (but not limited to) the following themes and questions: \n>> \n>> 1. Aesthetics as aesthesis (aísthēsis). Is there an aesthetics or mode of experience that is specific to computer games? How do their visual, audio, and haptic aspects come together to produce distinctive experiences? How are ‘experience’ and ‘perception’ explored in computer games and shaped by them? Can concepts such as ‘affect’, ‘atmosphere’, and ‘rhythm’ be productively applied to computer games? What is the role of game interfaces on player experience? \n>> \n>> 2. Games as art? What are the conditions of possibility of games being art? How do computer games fit into established categories or conventions of aesthetics, and how do they contribute to new ones? Do games recognised as having a claim to artistic status differ from mainstream games? How do accounts of art based on necessary and sufficient conditions match up against anti-essentialist accounts in terms of gauging the status of computer games? \n>> \n>> 3. The aesthetics of gaming practices. Are games collaboratively authored? How do different kinds of play, or player-game conjunctions, bring about different kinds of gaming pleasures or aesthetic experiences? How do different bodies encounter computer games and what can be said about the way in which gameplay experience is mediated by our bodies? \n>> Do some kinds of gameplay or extra-gamic player practices have an aesthetic orientation? Are computer games performances? \n>> \n>> 4. The ethical, political, and social dimensions of game aesthetics. What is the transformative potential of computer games and how does this compare to the transformative capabilities ascribed to artworks? How do aesthetic issues interconnect with ethical, social, and political ones – what is the autonomy or heteronomy of the aesthetic domain? How are taste, sensibility, and habit acquired with respect to gameplay and what are the social implications of this? \n>> \n>> In addition to this central theme, the conference also features an open category, for which we invite welcome contributions that do not fit this year’s theme, but that nonetheless offer a valuable contribution to the philosophy of computer games. \n>> \n>> Submitted proposals should have a clear focus on philosophy and philosophical (including media philosophical) issues in relation to computer games. They should also refer to specific games rather than invoke them in more general terms. Submissions should be made in the form of extended abstracts of up to 1000 words (excluding bibliography). Please indicate if you intend your paper to fit in the open category. The deadline for submissions is 23:59 GMT, Sunday, 11th August, 2019. Please submit your abstract through review.gamephilosophy.org. All submitted abstracts will be subject to a double-blind peer review process. \n>> \n>> Notification of accepted submissions will be sent out in late August 2019. A full paper draft must then be submitted by Monday, 14th October 2019 and will be made available on the conference website. \n>> \n>> We also invite proposals for themed panels and workshops that will take place on the 20th and 24th October, 2019. Please contact the program committee chair if you are interested in organising one. \n>> \n>> We cannot provide grants or subsidies for participants. There will, however, be no conference fee.\n>> \n>> For more information about the conference please visit http://gameconference.mediaphilosophy.ru/pcg2019.html and gamephilosophy.org. \n>> \n>> \n>> Visa information\n>> \n>> Please note that you may need to obtain a visa to enter Russia. \n>> \n>> If you need a visa you should apply for it at the Russian consulate in your country or at the visa service (the most popular is VisaGlobal). All visa services have an additional fee. St. Petersburg State University provides attendees with an invitation letter, which helps to obtain the humanitarian visa. Normally the costs of the humanitarian visa is less than the tourist or business one (for German and Polish citizens, for instance, the humanitarian visa is free if they apply for it in the consulate). \n>> \n>> The cost of visas varies from country to country. Here is a list of some countries. \n>> \n>> All the information concerning the visa costs and the processing time (normally it takes from 4 to 20 days, depending on the country) is available here: https://www.vfsglobal.com. If you have any questions concerning visas, do not hesitate to contact Alina Latypova (latypova.al@gmail.com).\n>> \n>> Attendees from the following countries do not need to obtain a Russian visa: \n>> \n>> Azerbaijan, Armenia, Belarus, Kazakhstan, Kyrgyzstan, Moldova, Tajikistan, Turkmenistan, Uzbekistan, Ukraine.\n>> Citizens of the countries of the CIS (the Commonwealth of Independent States) are permitted to stay in the Russian Federation for up to 90 days without a visa. \n>> \n>> Argentina, Brazil, Chile, Colombia, Israel, Nicaragua, Peru, Venezuela.\n>> Citizens of these countries are allowed to stay in the Russian Federation without a visa for up to 90 days in each 180-day period, provided they will not be involved in any commercial or work-related activities during their stay. \n>> \n>> Cuba, Montenegro, Serbia (with biometric passport), Thailand, Hong Kong SAR (up to 14 days), Macao SAR.\n>> Citizens of the countries in this group can stay in the Russian Federation for up to 30 days without a visa. They are not entitled to work while in Russia. \n>> \n>> Bosnia and Herzegovina, Macedonia.\n>> Citizens of these Balkan countries can also stay in Russia without a visa for up to 30 days, but must also show tourist documents (tourist confirmation and tourist voucher) or an official invitation to immigration officials. \n>> \n>> \n>> About\n>> \n>> The Centre for Media Philosophy at the Institute of Philosophy, St. Petersburg State University, in collaboration with the Game Philosophy Network, have come together to organize a double conference on philosophical issues raised by computer games. \n>> \n>> The 13th International Philosophy of Computer Games Conference, \"The Aesthetics of Computer Games\" (Oct 21-24), will explore various philosophical issues in thinking about the aesthetics of games and gameplay, whilst \"Computer Games as Interfaces to Media Reality\" (Oct 21-25) will address issues that spring from considering computer games to be “experience machines” for the modification of sensibility, thought, and imagination. Our aim is to provide a meeting place for scholars of media philosophy and game philosophy in order to inspire future investigations into the commonalities and differences between these approaches.\n>> \n>> \n>> Conference Committee (full)\n>> \n>> Program Committee: \n>> \n>> Alina Latypova (St Petersburg State University) \n>> Anita Leirfall (University of Bergen) \n>> Darshana Jayemanne (Abertay University) \n>> Feng Zhu (King’s College London)(chair) \n>> Grant Tavinor (Lincoln University) \n>> Hans-Joachim Backe (IT University of Copenhagen) \n>> John Richard Sageng (Game Philosophy Network) \n>> Konstantin Ocheretyany (St Petersburg State University) \n>> Marc Bonner (University of Cologne) \n>> Margarita Skomorokh (St Petersburg State University) \n>> Mathias Fuchs (Leuphana University of Lüneburg) \n>> Olli Leino (City University of Hong Kong) \n>> Pawel Grabarczyk (IT University of Copenhagen) \n>> Sebastian Möring (University of Potsdam) \n>> Sonia Fizek (Media Academy Stuttgart) \n>> Veli-Matti Karhulahti (University of Jyväskylä/University of Turku) \n>> William Huber (Abertay University) \n>> \n>> Organizing Committee: \n>> Alexander Lenkevich (St Petersburg State University) \n>> Alina Latypova (St Petersburg State University)(chair) \n>> Konstantin Ocheretyany (St Petersburg State University)(chair) \n>> Margarita Skomorokh (St Petersburg State University) \n>> \n>> \n>> For additional queries, do not hesitate to email the organisers using the following email address: feng (dot) zhu (at) kcl (dot) ac (dot) uk\n>> \n>> Warm regards, \n>> \n>> Feng Zhu\n>> \n>> \n>> Teaching Fellow in Digital Media and Culture\n>> Department of Digital Humanities\n>> King's College London\n>> Room C0.07, Chesham Building \n>> London, WC2R 2LS\n>> -- Gamesnetwork, discussion list of Digital Games Research Association, www.digra.org Note: to unsubscribe, send \"UNSUBSCRIBE GAMESNETWORK\" to LISTSERV@UTA.FI from your subscribed email account. Web interface to subscribe and manage your subscription: https://listserv.uta.fi/cgi-bin/wa?SUBED1=GAMESNETWORK&A=1 . The list archive is available online at: https://listserv.uta.fi/archives/gamesnetwork.html\n>> \n>> -- \n>>  \n>> --\n>> Dr. J Parker                              Author of \"Python - An Introduction to Programming'\n>> University of Calgary                               \"Python 3 Pocket Primer\"\n>> Department of Art               \n>> 403 220 6784\n>> http://people.ucalgary.ca/~jparker/cv.html\n>>  \n>> \n>> \n>> \n>> Virus-free. www.avg.com\n>> \n>> -- Gamesnetwork, discussion list of Digital Games Research Association, www.digra.org Note: to unsubscribe, send \"UNSUBSCRIBE GAMESNETWORK\" to LISTSERV@UTA.FI from your subscribed email account. Web interface to subscribe and manage your subscription: https://listserv.uta.fi/cgi-bin/wa?SUBED1=GAMESNETWORK&A=1 . The list archive is available online at: https://listserv.uta.fi/archives/gamesnetwork.html\n>> \n>> -- Gamesnetwork, discussion list of Digital Games Research Association, www.digra.org Note: to unsubscribe, send \"UNSUBSCRIBE GAMESNETWORK\" to LISTSERV@UTA.FI from your subscribed email account. Web interface to subscribe and manage your subscription: https://listserv.uta.fi/cgi-bin/wa?SUBED1=GAMESNETWORK&A=1 . The list archive is available online at: https://listserv.uta.fi/archives/gamesnetwork.html\n>> \n>> -- Gamesnetwork, discussion list of Digital Games Research Association, www.digra.org Note: to unsubscribe, send \"UNSUBSCRIBE GAMESNETWORK\" to LISTSERV@UTA.FI from your subscribed email account. Web interface to subscribe and manage your subscription: https://listserv.uta.fi/cgi-bin/wa?SUBED1=GAMESNETWORK&A=1 . The list archive is available online at: https://listserv.uta.fi/archives/gamesnetwork.html\n>> \n>>  \n>> \n>> -- Gamesnetwork, discussion list of Digital Games Research Association, www.digra.org Note: to unsubscribe, send \"UNSUBSCRIBE GAMESNETWORK\" to LISTSERV@UTA.FI from your subscribed email account. Web interface to subscribe and manage your subscription: https://listserv.uta.fi/cgi-bin/wa?SUBED1=GAMESNETWORK&A=1 . The list archive is available online at: https://listserv.uta.fi/archives/gamesnetwork.html\n> -- Gamesnetwork, discussion list of Digital Games Research Association, www.digra.org Note: to unsubscribe, send \"UNSUBSCRIBE GAMESNETWORK\" to LISTSERV@UTA.FI from your subscribed email account. Web interface to subscribe and manage your subscription: https://listserv.uta.fi/cgi-bin/wa?SUBED1=GAMESNETWORK&A=1 . The list archive is available online at: https://listserv.uta.fi/archives/gamesnetwork.html\n\n--\nGamesnetwork, discussion list of Digital Games Research Association, www.digra.org\nNote: to unsubscribe, send \"UNSUBSCRIBE GAMESNETWORK\" to LISTSERV@UTA.FI from\nyour subscribed email account. Web interface to subscribe and manage your subscription:\nhttps://listserv.uta.fi/cgi-bin/wa?SUBED1=GAMESNETWORK&A=1 .\nThe list archive is available online at: https://listserv.uta.fi/archives/gamesnetwork.html\n<html><head>\n<meta http-equiv=\"Content-Type\" content=\"text/html; charset=utf-8\"></head><body dir=\"auto\"><div dir=\"ltr\"><span></span></div><div dir=\"ltr\"><div dir=\"ltr\"></div><div dir=\"ltr\">Please do not let this thread lull any LGBTQ list member into a false sense of security.</div><div dir=\"ltr\"><br></div><div dir=\"ltr\">It should be noted that since the “Gay Propaganda Law” was passed in 2013, hate crimes against LGBT people in Russia has more than doubled.&nbsp;<a href=\"https://www.reuters.com/article/us-russia-lgbt-crime/lgbt-hate-crimes-double-in-russia-after-ban-on-gay-propaganda-idUSKBN1DL2FM\">https://www.reuters.com/article/us-russia-lgbt-crime/lgbt-hate-crimes-double-in-russia-after-ban-on-gay-propaganda-idUSKBN1DL2FM</a></div><div dir=\"ltr\"><br></div><div dir=\"ltr\">Foreigners accused of spreading “gay propaganda” (whatever they determine that means), can face 15 days in prison before being deported, and foreigners can be punished even more harshly if they think you’re spreading gay propaganda online:</div><div dir=\"ltr\"><a href=\"http://www.globalequality.org/component/content/article/1-in-the-news/186-the-facts-on-lgbt-rights-in-russia\">http://www.globalequality.org/component/content/article/1-in-the-news/186-the-facts-on-lgbt-rights-in-russia</a></div><div dir=\"ltr\"><br></div><div dir=\"ltr\">You’ll recall the French couple that was violently beaten IN ST. PETERSBURG during the World Cup (when protection for foreigners was likely strongest).&nbsp;<a href=\"https://attitude.co.uk/article/gay-world-cup-fan-hospitalised-after-violent-homophobic-attack-in-russia/18199/\">https://attitude.co.uk/article/gay-world-cup-fan-hospitalised-after-violent-homophobic-attack-in-russia/18199/</a></div><div dir=\"ltr\"><br></div><div dir=\"ltr\">Again, Human Rights organizations and activists note that homophobic attacks are still on the rise in Russia, even in large cities, and crack-downs by the government are getting worse and more frequent:&nbsp;<a href=\"https://www.reuters.com/article/russia-lgbt-attitudes/feature-arrested-and-harrassed-russias-lgbt-community-fears-crackdown-worsening-idUSL8N1W51TT\">https://www.reuters.com/article/russia-lgbt-attitudes/feature-arrested-and-harrassed-russias-lgbt-community-fears-crackdown-worsening-idUSL8N1W51TT</a></div><div dir=\"ltr\"><br></div><div dir=\"ltr\">Spartacus is perhaps the most world-renowned publication related to travel by the LGBTQ community, and they publish an index for safe travel by country, with Russia appearing near the bottom of the list:</div><div dir=\"ltr\"><a href=\"https://spartacus.gayguide.travel/gaytravelindex_2018.pdf\">https://spartacus.gayguide.travel/gaytravelindex_2018.pdf</a></div><div dir=\"ltr\"><br></div><div dir=\"ltr\">Despite what non-LGBTQ locals may say and what paid travel ads may promise about travel to St. Petersburg, it is absolutely not safe for LGBTQ people travel there, so please make a decision to travel there very carefully.&nbsp;</div><div dir=\"ltr\"><br></div><div dir=\"ltr\">Michael</div><div dir=\"ltr\"><br>On Jun 7, 2019, at 12:01 PM, Леонид Мойжес &lt;<a href=\"mailto:moyzhesl@gmail.com\">moyzhesl@gmail.com</a>&gt; wrote:<br><br></div><blockquote type=\"cite\"><div dir=\"ltr\"><div dir=\"ltr\"><p class=\"MsoNormal\" style=\"margin:0cm 0cm 10pt;line-height:115%;font-size:11pt;font-family:Calibri,sans-serif\"><span lang=\"EN-US\">Hello everyone.</span></p><p class=\"MsoNormal\" style=\"margin:0cm 0cm 10pt;line-height:115%;font-size:11pt;font-family:Calibri,sans-serif\"><span lang=\"EN-US\"><br></span></p><p class=\"MsoNormal\" style=\"margin:0cm 0cm 10pt;line-height:115%;font-size:11pt;font-family:Calibri,sans-serif\"><span lang=\"EN-US\">The\nofficial law behind LGBT discrimination in Russia is so-called &quot;Russian\ngay propaganda Law&quot;&nbsp;</span><a href=\"https://en.wikipedia.org/wiki/Russian_gay_propaganda_law\" style=\"font-family:Arial,Helvetica,sans-serif;font-size:small\">https://en.wikipedia.org/wiki/Russian_gay_propaganda_law</a><span style=\"font-size:11pt\">&nbsp;It prohibits spreading\nof the information about LGBT among minors. And while it is absolutely\ndisgusting, from the practical point of view this law poses no problem for the\nforeigners coming for an international conference. The only way someone could\nrun into problems is if there would be a person under age of 18 present on the\nconference, and then someone would file a complaint about him hearing something\npositive about LGBT. But since conference would be in English, and most Russians,\nespecially those who support this law, do not know this language, I believe\nthat it would be fine.</span></p></div><br><div class=\"gmail_quote\"><div dir=\"ltr\" class=\"gmail_attr\">пт, 7 июн. 2019 г. в 16:46, Phoenix Perry &lt;<a href=\"mailto:contact@phoenixperry.com\">contact@phoenixperry.com</a>&gt;:<br></div><blockquote class=\"gmail_quote\" style=\"margin:0px 0px 0px 0.8ex;border-left:1px solid rgb(204,204,204);padding-left:1ex\"><div lang=\"EN-US\"><div class=\"gmail-m_4357909884783894982WordSection1\"><p class=\"MsoNormal\">Hi folks, </p><p class=\"MsoNormal\"><u></u>&nbsp;<u></u></p><p class=\"MsoNormal\">Does anyone know the actual law for those of us who are activists online? I googled and being out doesn’t appear to be illegal to be gay and being a foreigner would be ok?&nbsp; This is actually a bit scary. </p><p class=\"MsoNormal\"><u></u>&nbsp;<u></u></p><p class=\"MsoNormal\">Thanks in advance, </p><p class=\"MsoNormal\"><u></u>&nbsp;<u></u></p><p class=\"MsoNormal\">Phoenix </p><p class=\"MsoNormal\"><u></u>&nbsp;<u></u></p><p class=\"MsoNormal\"><u></u>&nbsp;<u></u></p><p class=\"MsoNormal\"><u></u>&nbsp;<u></u></p><div style=\"border-right:none;border-bottom:none;border-left:none;border-top:1pt solid rgb(225,225,225);padding:3pt 0in 0in\"><p class=\"MsoNormal\" style=\"border:none;padding:0in\"><b>From: </b><a href=\"mailto:feng.zhu.9@GMAIL.COM\" target=\"_blank\">Feng Zhu</a><br><b>Sent: </b>Friday, June 7, 2019 2:01 PM<br><b>To: </b><a href=\"mailto:gamesnetwork@uta.fi\" target=\"_blank\">Gamesnetwork</a><br><b>Subject: </b>Re: [GAMESNETWORK] CFP: The Aesthetics of Computer Games</p></div><p class=\"MsoNormal\"><u></u>&nbsp;<u></u></p><div><p>Dear Dr Parker,</p><p>Thanks for asking a question that may have been on many people’s minds. I have been discussing this issue with Alina Latypova, the conference chair. My understanding is that St Petersburg is an international city, and that it is extremely unlikely that there will be any LGBT directed harassment. There also appear to be high levels of support for equal rights for the LGBT community in response to the government’s lamentable position. Of course nobody can give definitive assurances about any city, but I hope that we can offer some reassurances. We have an inclusivity policy that is stated on the website. Anyone is welcome to write to us to continue this discussion: <a href=\"mailto:feng.zhu@kcl.ac.uk\" target=\"_blank\">feng.zhu@kcl.ac.uk</a></p><p>Kind regards,</p><p>Feng</p></div><p class=\"MsoNormal\"><u></u>&nbsp;<u></u></p><div><div><p class=\"MsoNormal\">On Thu, Jun 6, 2019 at 8:01 PM Alesja Serada &lt;<a href=\"mailto:alesja.serada@gmail.com\" target=\"_blank\">alesja.serada@gmail.com</a>&gt; wrote:</p></div><blockquote style=\"border-top:none;border-right:none;border-bottom:none;border-left:1pt solid rgb(204,204,204);padding:0in 0in 0in 6pt;margin-left:4.8pt;margin-right:0in\"><div><p class=\"MsoNormal\">I travel to Russia on a regular basis, to this particular research center as well (and they are doing a great job!). Saint Petersburg is a very welcoming place, just like any big European city. Can't say anything about being gay in Russia in general, but in Saint Petersburg, in most social situations, I suppose, it will be completely safe.</p><div><p class=\"MsoNormal\">AS</p></div></div><p class=\"MsoNormal\"><u></u>&nbsp;<u></u></p><div><div><p class=\"MsoNormal\">On Thu, Jun 6, 2019 at 9:48 PM Parker &lt;<a href=\"mailto:jparker@ucalgary.ca\" target=\"_blank\">jparker@ucalgary.ca</a>&gt; wrote:</p></div><blockquote style=\"border-top:none;border-right:none;border-bottom:none;border-left:1pt solid rgb(204,204,204);padding:0in 0in 0in 6pt;margin-left:4.8pt;margin-right:0in\"><div><p>Is Russia a safe place to visit? Are the gay members of our community going to be safe?</p><p><u></u>&nbsp;<u></u></p><div><p class=\"MsoNormal\">On 2019-06-06 3:27 a.m., Feng Zhu wrote:<u></u><u></u></p></div><blockquote style=\"margin-top:5pt;margin-bottom:5pt\"><p class=\"MsoNormal\"><b>Call for papers </b><br><br><b>The 13th International Conference on the Philosophy of Computer Games: The Aesthetics of Computer Games </b><br><br><b>Conference Committee: </b><br><br>Program Chair: <br>Feng Zhu (King’s College London) <br><a href=\"mailto:feng.zhu@kcl.ac.uk\" target=\"_blank\">feng.zhu@kcl.ac.uk</a><br><br>Conference Chairs: <br>Alina Latypova (St Petersburg State University) <br><a href=\"mailto:latypova.al@gmail.com\" target=\"_blank\">latypova.al@gmail.com</a><br>Konstantin Ocheretyany (St Petersburg State University) <br><a href=\"mailto:kocheretyany@gmail.com\" target=\"_blank\">kocheretyany@gmail.com</a><br><br><br>We invite submissions to the <b>13th International Conference on the Philosophy of Computer Games, organised by the Game Philosophy Network, together with the Centre for Media Philosophy and Laboratory for Computer Games Research, in St Petersburg, Russia, on October 21–24, 2019. </b><br><br>The theme of this year’s conference is <b>‘The Aesthetics of Computer Games’.</b> Playing games yields particular kinds of playful experiences or perceptions through the senses, which can be studied with an aesthetic focus, emphasising aísthēsis over noêsis. Computer games can be regarded as playful media that organise our perceptions and modify our sensibilities. For this conference, we welcome submissions on (but not limited to) the following themes and questions: <br><br><b>1. Aesthetics as aesthesis (aísthēsis).</b> Is there an aesthetics or mode of experience that is specific to computer games? How do their visual, audio, and haptic aspects come together to produce distinctive experiences? How are ‘experience’ and ‘perception’ explored in computer games and shaped by them? Can concepts such as ‘affect’, ‘atmosphere’, and ‘rhythm’ be productively applied to computer games? What is the role of game interfaces on player experience? <br><br><b>2. Games as art?</b> What are the conditions of possibility of games being art? How do computer games fit into established categories or conventions of aesthetics, and how do they contribute to new ones? Do games recognised as having a claim to artistic status differ from mainstream games? How do accounts of art based on necessary and sufficient conditions match up against anti-essentialist accounts in terms of gauging the status of computer games? <br><br><b>3. The aesthetics of gaming practices.</b> Are games collaboratively authored? How do different kinds of play, or player-game conjunctions, bring about different kinds of gaming pleasures or aesthetic experiences? How do different bodies encounter computer games and what can be said about the way in which gameplay experience is mediated by our bodies? <br>Do some kinds of gameplay or extra-gamic player practices have an aesthetic orientation? Are computer games performances? <br><br><b>4. The ethical, political, and social dimensions of game aesthetics.</b> What is the transformative potential of computer games and how does this compare to the transformative capabilities ascribed to artworks? How do aesthetic issues interconnect with ethical, social, and political ones – what is the autonomy or heteronomy of the aesthetic domain? How are taste, sensibility, and habit acquired with respect to gameplay and what are the social implications of this? <br><br>In addition to this central theme, the conference also features an open category, for which we invite welcome contributions that do not fit this year’s theme, but that nonetheless offer a valuable contribution to the philosophy of computer games. <br><br>Submitted proposals should have a clear focus on philosophy and philosophical (including media philosophical) issues in relation to computer games. They should also refer to specific games rather than invoke them in more general terms. <b>Submissions should be made in the form of extended abstracts of up to 1000 words (excluding bibliography).</b> Please indicate if you intend your paper to fit in the open category. <b>The deadline for submissions is 23:59 GMT, Sunday, 11th August, 2019.</b> Please submit your abstract through <b><a href=\"http://review.gamephilosophy.org\" target=\"_blank\">review.gamephilosophy.org</a>.</b> All submitted abstracts will be subject to a double-blind peer review process. <br><br>Notification of accepted submissions will be sent out in late August 2019. A full paper draft must then be submitted by Monday, 14th October 2019 and will be made available on the conference website. <br><br><b>We also invite proposals for themed panels and workshops that will take place on the 20th and 24th October, 2019.</b> Please contact the program committee chair if you are interested in organising one. <br><br><b>We cannot provide grants or subsidies for participants. There will, however, be no conference fee.</b><br><br>For more information about the conference please visit <a href=\"http://gameconference.mediaphilosophy.ru/pcg2019.html\" target=\"_blank\">http://gameconference.mediaphilosophy.ru/pcg2019.html</a> and <a href=\"http://gamephilosophy.org\" target=\"_blank\">gamephilosophy.org</a>. <br><br><br><b>Visa information</b><br><br>Please note that you may need to obtain a visa to enter Russia. <br><br>If you need a visa you should apply for it at the Russian consulate in your country or at the visa service (the most popular is <a href=\"https://www.vfsglobal.com\" target=\"_blank\">VisaGlobal</a>). All visa services have an additional fee. St. Petersburg State University provides attendees with an invitation letter, which helps to obtain the humanitarian visa. Normally the costs of the humanitarian visa is less than the tourist or business one (for German and Polish citizens, for instance, the humanitarian visa is free if they apply for it in the consulate). <br><br>The cost of visas varies from country to country. Here is a <a href=\"http://gameconference.mediaphilosophy.ru/files/HVR.pdf\" target=\"_blank\">list of some countries</a>. <br><br>All the information concerning the visa costs and the processing time (normally it takes from 4 to 20 days, depending on the country) is available here: <a href=\"https://www.vfsglobal.com\" target=\"_blank\">https://www.vfsglobal.com</a>. If you have any questions concerning visas, do not hesitate to contact Alina Latypova (<a href=\"mailto:latypova.al@gmail.com\" target=\"_blank\">latypova.al@gmail.com</a>).<br><br>Attendees from the following countries do not need to obtain a Russian visa: <br><br><b>Azerbaijan, Armenia, Belarus, Kazakhstan, Kyrgyzstan, Moldova, Tajikistan, Turkmenistan, Uzbekistan, Ukraine.</b><br>Citizens of the countries of the CIS (the Commonwealth of Independent States) are permitted to stay in the Russian Federation for up to 90 days without a visa. <br><br><b>Argentina, Brazil, Chile, Colombia, Israel, Nicaragua, Peru, Venezuela.</b><br>Citizens of these countries are allowed to stay in the Russian Federation without a visa for up to 90 days in each 180-day period, provided they will not be involved in any commercial or work-related activities during their stay. <br><br><b>Cuba, Montenegro, Serbia (with biometric passport), Thailand, Hong Kong SAR (up to 14 days), Macao SAR.</b><br>Citizens of the countries in this group can stay in the Russian Federation for up to 30 days without a visa. They are not entitled to work while in Russia. <br><br><b>Bosnia and Herzegovina, Macedonia.</b><br>Citizens of these Balkan countries can also stay in Russia without a visa for up to 30 days, but must also show tourist documents (tourist confirmation and tourist voucher) or an official invitation to immigration officials. <br><br><br><b>About</b><br><br>The Centre for Media Philosophy at the Institute of Philosophy, St. Petersburg State University, in collaboration with the Game Philosophy Network, have come together to organize a double conference on philosophical issues raised by computer games. <br><br>The 13th International Philosophy of Computer Games Conference, <a href=\"http://gameconference.mediaphilosophy.ru/pcg2019.html\" target=\"_blank\">&quot;The Aesthetics of Computer Games&quot;</a> (Oct 21-24), will explore various philosophical issues in thinking about the aesthetics of games and gameplay, whilst <a href=\"http://gameconference.mediaphilosophy.ru/subtitle1\" target=\"_blank\">&quot;Computer Games as Interfaces to Media Reality&quot;</a> (Oct 21-25) will address issues that spring from considering computer games to be “experience machines” for the modification of sensibility, thought, and imagination. Our aim is to provide a meeting place for scholars of media philosophy and game philosophy in order to inspire future investigations into the commonalities and differences between these approaches.<br><br><br><b>Conference Committee (full)</b><br><br>Program Committee: <br><br>Alina Latypova (St Petersburg State University) <br>Anita Leirfall (University of Bergen) <br>Darshana Jayemanne (Abertay University) <br>Feng Zhu (King’s College London)(chair) <br>Grant Tavinor (Lincoln University) <br>Hans-Joachim Backe (IT University of Copenhagen) <br>John Richard Sageng (Game Philosophy Network) <br>Konstantin Ocheretyany (St Petersburg State University) <br>Marc Bonner (University of Cologne) <br>Margarita Skomorokh (St Petersburg State University) <br>Mathias Fuchs (Leuphana University of Lüneburg) <br>Olli Leino (City University of Hong Kong) <br>Pawel Grabarczyk (IT University of Copenhagen) <br>Sebastian Möring (University of Potsdam) <br>Sonia Fizek (Media Academy Stuttgart) <br>Veli-Matti Karhulahti (University of Jyväskylä/University of Turku) <br>William Huber (Abertay University) <br><br>Organizing Committee: <br>Alexander Lenkevich (St Petersburg State University) <br>Alina Latypova (St Petersburg State University)(chair) <br>Konstantin Ocheretyany (St Petersburg State University)(chair) <br>Margarita Skomorokh (St Petersburg State University) <br><br><br>For additional queries, do not hesitate to email the organisers using the following email address: <b>feng (dot) zhu (at) kcl (dot) ac (dot) uk</b><br><br>Warm regards, <br><br>Feng Zhu<br><br><br>Teaching Fellow in Digital Media and Culture<br>Department of Digital Humanities<br>King's College London<br>Room C0.07, Chesham Building <br>London, WC2R 2LS<br>-- Gamesnetwork, discussion list of Digital Games Research Association, <a href=\"http://www.digra.org\" target=\"_blank\">www.digra.org</a> Note: to unsubscribe, send &quot;UNSUBSCRIBE GAMESNETWORK&quot; to <a href=\"mailto:LISTSERV@UTA.FI\" target=\"_blank\">LISTSERV@UTA.FI</a> from your subscribed email account. Web interface to subscribe and manage your subscription: <a href=\"https://listserv.uta.fi/cgi-bin/wa?SUBED1=GAMESNETWORK&amp;A=1\" target=\"_blank\">https://listserv.uta.fi/cgi-bin/wa?SUBED1=GAMESNETWORK&amp;A=1</a> . The list archive is available online at: <a href=\"https://listserv.uta.fi/archives/gamesnetwork.html\" target=\"_blank\">https://listserv.uta.fi/archives/gamesnetwork.html</a> <u></u><u></u></p></blockquote><pre>-- </pre><pre><u></u>&nbsp;<u></u></pre><pre>--</pre><pre>Dr. J Parker&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Author of &quot;Python - An Introduction to Programming'</pre><pre>University of Calgary&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; &nbsp;&nbsp;&quot;Python 3 Pocket Primer&quot;</pre><pre>Department of Art&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; </pre><pre>403 220 6784</pre><pre><a href=\"http://people.ucalgary.ca/~jparker/cv.html\" target=\"_blank\">http://people.ucalgary.ca/~jparker/cv.html</a></pre><div id=\"gmail-m_4357909884783894982gmail-m_-4278260077130859638gmail-m_-3471463655356352657DAB4FAD8-2DD7-40BB-A1B8-4E2AA1F9FDF2\"><p class=\"MsoNormal\"><u></u>&nbsp;<u></u></p><table class=\"gmail-m_4357909884783894982MsoNormalTable\" border=\"1\" cellpadding=\"0\" style=\"border-right:none;border-bottom:none;border-left:none;border-top:1pt solid rgb(211,212,222)\"><tbody><tr><td width=\"55\" style=\"width:41.25pt;border:none;padding:9.75pt 0.75pt 0.75pt\"><p class=\"MsoNormal\"><a href=\"http://www.avg.com/email-signature?utm_medium=email&amp;utm_source=link&amp;utm_campaign=sig-email&amp;utm_content=emailclient\" target=\"_blank\"><span style=\"text-decoration:none\"><img border=\"0\" width=\"46\" height=\"29\" style=\"width: 0.4791in; height: 0.302in;\" id=\"gmail-m_4357909884783894982_x0000_i1025\" src=\"https://ipmcdn.avast.com/images/icons/icon-envelope-tick-green-avg-v1.png\" alt=\"https://ipmcdn.avast.com/images/icons/icon-envelope-tick-green-avg-v1.png\"></span></a></p></td><td width=\"470\" style=\"width:352.5pt;border:none;padding:9pt 0.75pt 0.75pt\"><p class=\"MsoNormal\" style=\"line-height:13.5pt\"><span style=\"font-size:10pt;font-family:Arial,sans-serif;color:rgb(65,66,78)\">Virus-free. <a href=\"http://www.avg.com/email-signature?utm_medium=email&amp;utm_source=link&amp;utm_campaign=sig-email&amp;utm_content=emailclient\" target=\"_blank\"><span style=\"color:rgb(68,83,234)\">www.avg.com</span></a> <u></u><u></u></span></p></td></tr></tbody></table></div></div><p class=\"MsoNormal\">-- Gamesnetwork, discussion list of Digital Games Research Association, <a href=\"http://www.digra.org\" target=\"_blank\">www.digra.org</a> Note: to unsubscribe, send &quot;UNSUBSCRIBE GAMESNETWORK&quot; to <a href=\"mailto:LISTSERV@UTA.FI\" target=\"_blank\">LISTSERV@UTA.FI</a> from your subscribed email account. Web interface to subscribe and manage your subscription: <a href=\"https://listserv.uta.fi/cgi-bin/wa?SUBED1=GAMESNETWORK&amp;A=1\" target=\"_blank\">https://listserv.uta.fi/cgi-bin/wa?SUBED1=GAMESNETWORK&amp;A=1</a> . The list archive is available online at: <a href=\"https://listserv.uta.fi/archives/gamesnetwork.html\" target=\"_blank\">https://listserv.uta.fi/archives/gamesnetwork.html</a> <u></u><u></u></p></blockquote></div><p class=\"MsoNormal\">-- Gamesnetwork, discussion list of Digital Games Research Association, <a href=\"http://www.digra.org\" target=\"_blank\">www.digra.org</a> Note: to unsubscribe, send &quot;UNSUBSCRIBE GAMESNETWORK&quot; to <a href=\"mailto:LISTSERV@UTA.FI\" target=\"_blank\">LISTSERV@UTA.FI</a> from your subscribed email account. Web interface to subscribe and manage your subscription: <a href=\"https://listserv.uta.fi/cgi-bin/wa?SUBED1=GAMESNETWORK&amp;A=1\" target=\"_blank\">https://listserv.uta.fi/cgi-bin/wa?SUBED1=GAMESNETWORK&amp;A=1</a> . The list archive is available online at: <a href=\"https://listserv.uta.fi/archives/gamesnetwork.html\" target=\"_blank\">https://listserv.uta.fi/archives/gamesnetwork.html</a> </p></blockquote></div><p class=\"MsoNormal\">-- Gamesnetwork, discussion list of Digital Games Research Association, <a href=\"http://www.digra.org\" target=\"_blank\">www.digra.org</a> Note: to unsubscribe, send &quot;UNSUBSCRIBE GAMESNETWORK&quot; to <a href=\"mailto:LISTSERV@UTA.FI\" target=\"_blank\">LISTSERV@UTA.FI</a> from your subscribed email account. Web interface to subscribe and manage your subscription: <a href=\"https://listserv.uta.fi/cgi-bin/wa?SUBED1=GAMESNETWORK&amp;A=1\" target=\"_blank\">https://listserv.uta.fi/cgi-bin/wa?SUBED1=GAMESNETWORK&amp;A=1</a> . The list archive is available online at: <a href=\"https://listserv.uta.fi/archives/gamesnetwork.html\" target=\"_blank\">https://listserv.uta.fi/archives/gamesnetwork.html</a> </p><p class=\"MsoNormal\"><u></u>&nbsp;<u></u></p></div></div>--\nGamesnetwork, discussion list of Digital Games Research Association, <a href=\"http://www.digra.org\" target=\"_blank\">www.digra.org</a>\nNote: to unsubscribe, send &quot;UNSUBSCRIBE GAMESNETWORK&quot; to <a href=\"mailto:LISTSERV@UTA.FI\" target=\"_blank\">LISTSERV@UTA.FI</a> from\nyour subscribed email account. Web interface to subscribe and manage your subscription:\n<a href=\"https://listserv.uta.fi/cgi-bin/wa?SUBED1=GAMESNETWORK&amp;A=1\" target=\"_blank\">https://listserv.uta.fi/cgi-bin/wa?SUBED1=GAMESNETWORK&amp;A=1</a> .\nThe list archive is available online at: <a href=\"https://listserv.uta.fi/archives/gamesnetwork.html\" target=\"_blank\">https://listserv.uta.fi/archives/gamesnetwork.html</a>\n</blockquote></div>\n--\nGamesnetwork, discussion list of Digital Games Research Association, <a href=\"http://www.digra.org\" target=\"_blank\">www.digra.org</a>\nNote: to unsubscribe, send &quot;UNSUBSCRIBE GAMESNETWORK&quot; to <a href=\"mailto:LISTSERV@UTA.FI\">LISTSERV@UTA.FI</a> from\nyour subscribed email account. Web interface to subscribe and manage your subscription:\n<a href=\"https://listserv.uta.fi/cgi-bin/wa?SUBED1=GAMESNETWORK&amp;A=1\" target=\"_blank\">https://listserv.uta.fi/cgi-bin/wa?SUBED1=GAMESNETWORK&amp;A=1</a> .\nThe list archive is available online at: <a href=\"https://listserv.uta.fi/archives/gamesnetwork.html\" target=\"_blank\">https://listserv.uta.fi/archives/gamesnetwork.html</a>\n</div></blockquote></div></body></html>--\nGamesnetwork, discussion list of Digital Games Research Association, <a href=\"http://www.digra.org\" target=\"_blank\">www.digra.org</a>\nNote: to unsubscribe, send &quot;UNSUBSCRIBE GAMESNETWORK&quot; to <a href=\"mailto:LISTSERV@UTA.FI\">LISTSERV@UTA.FI</a> from\nyour subscribed email account. Web interface to subscribe and manage your subscription:\n<a href=\"https://listserv.uta.fi/cgi-bin/wa?SUBED1=GAMESNETWORK&amp;A=1\" target=\"_blank\">https://listserv.uta.fi/cgi-bin/wa?SUBED1=GAMESNETWORK&amp;A=1</a> .\nThe list archive is available online at: <a href=\"https://listserv.uta.fi/archives/gamesnetwork.html\" target=\"_blank\">https://listserv.uta.fi/archives/gamesnetwork.html</a>\n",
    "attachments": []
}