{
    "subject": "Scopus Index - Engineering Journal (Status-active 2019)",
    "from": "IRPH Journals <info@irphjournals.com>",
    "to": "\"foaad@calpoly.edu\" <foaad@calpoly.edu>",
    "cc": null,
    "bcc": null,
    "date": "Fri, 07 Jun 2019 09:50:18 +0200",
    "body": "Read the online version here:\nhttp://www.irphjournals.com//subscriber/newsletter.php?e2=aab4b392aa8795a2b0b5c19dbf7597a5b9&c=26&h=2&t=0\n\n Dear Author, This Journal Title is Indexed in SCOPUS (Active-2019). We invite you to submit original and unpublished research articles for review and possible publication in:    International Journal of Engineering Research and Technology ISSN: 09743154 Scopus Indexed-Active 2019   Published by: International Research Publication House (IRPH), New Delhi, India.  View full Aim & Scope: http://www.irphouse.com/mec/ijer.htm Submit paper for review at: irpeditor@gmail.com SCOPUS Web page: https://www.scopus.com/sourceid/21100828027?origin=sbrowse  Important Note: Original IJERT with print ISSN number 0974-3154 (Scopus Indexed) is published by International Research Publication House (www.irphouse.com) and not by www.ijert.org ESRA Publication in Gujarat. For clarification please email at: irpeditor@gmail.com   Indexing: SCOPUS Indexed (active-2019), Informatics, Open J-Gate, i-Scholar, EBSCOs Database, Academia, Research Gate, Cambridge Science Abstract, Elsevier Bibliographic Databases, ACM Guide to Computing Literature, DBLP, Mathematical Reviews, Journal Seek, Thomson Gale, Google Scholar.   Submission: email at: irpeditor@gmail.com, mentioning the journal title in the subject area. Please submit your article with complete name of author(s) and your complete affiliation (department and University address). If you have an orcid id then please mention it below your affiliation.    Publication Process: Upon acceptance your paper will appear online within 10 working days. We shall be glad to receive your technical contributions at your earliest convenience.  If you find any difficulty/queries, please feel free to contact us by phone (011-27893171), or email  at: irpeditor@gmail.com     Best regards International Journal of Engineering Research and Technology (IJERT) ISSN 09743154  Associate Editor: Dr. Kong Fah Tee Associate Prof. Engineering Science Department University of Greenwich Chatham Maritime, Kent United Kingdom   Other important titles: International Journal of Electrical Engineering (IJEE) - Under Scopus evaluation. International Journal of Electronics and Communication Engineering (IJECE) International Journal of Industrial Engineering and Technology (IJIET) International Journal of Electronic and Electrical Engineering (IJEEE) Note: To unsubscribe, simply send a blank reply with UNSUBSCRIBE as subject.\n",
    "attachments": []
}