{
    "subject": "This email is sent to those who registered to attend one of the tracks of World Congress in CS and CE (July 16-19, 2012, Las Vegas) ",
    "from": "Steering Committee <sc@world-comp.org>",
    "to": "foaad@calpoly.edu",
    "cc": null,
    "bcc": null,
    "date": "Sun, 03 Jun 2012 22:46:08 -0400",
    "body": "\nYou are receiving this because you have registered for one or more of the\nco-located conferences (list of conferences is appended to this email for\nyour reference).\n\nPlease note the following TWO requests from conference attendees:\n\n1. Hotel reservation:\n   (Ignore this if you have already reserved your room or plan to stay at some\n   other hotel.)\n   We reserved over 3,500 room nights at the hotel where the conference will\n   be held. Our reserved block of rooms at the hotel is close to being fully\n   booked. There are only a few more rooms available at the negotiated rate.\n   If you plan to stay at the hotel where the conference will be held, you\n   would need to do your room reservation within the next few days. In order\n   to reserve your room at the conference negotiated rate, use the online\n   reservation system at:\n   http://www.world-academy-of-science.org/worldcomp12/ws\n   and then select the tab \"Location\". Or go directly to:\n   http://www.world-academy-of-science.org/worldcomp12/ws/location\n   and follow the instructions.\n\n2. Steps you would need to take if you ARE NOT planning to attend the conference:\n   (Ignore this if you have already reported to us that you will not be able\n   to attend.)\n\n   Authors of accepted papers who have registered but will not be able to attend\n   the conference must email us the following information urgently:\n\n   -> I am NOT able to attend the conference in order to present my paper - therefore\n           my paper does not need to be scheduled for presentation. Please ship the\n           printed books/proceedings to my address.\n   -> Your name:\n   -> Your paper ID number:\n   -> Title of paper:\n   -> Your COMPLETE shipping address (including, postal code, city, country, ...):\n\n   We would then arrange for the conference books to be shipped to the above address.\n   All shipments will be done in October.\n\n\nIndications are that we will have a great conference. Prof. David A. Patterson\n(Professor of University of California at Berkeley, member of National Academy of\nEngineering, member of National of Academy of Sciences, Fellow of IEEE, ACM, and AAAS)\nwill be opening the conference with his keynote lecture. We will have a number of\ntutorials (all tutorials are free to conference registrants) as well as tens of keynotes,\ninvited talks, together with 100's of presentations. Like other research conference,\nthe conference program/schedule will be ready one month before the start date of the\nconference (we plan to make the conference schedule vailable around June 16th).\n\nWe all look forward to seeing you at the conference in July.\n\nThank you,\nSteering Committee\n---------------------------\n\nList of co-located conferences (same dates and location; July 16-19, 2012, Las Vegas,\nUSA):\n\no. BIOCOMP'12 - 13th Int'l. Conference on Bioinformatics & Computational Biology\no. CDES'12 - 12th Int'l Conference on Computer Design\no. CGVR'12 - 16th Int'l Conference on Computer Graphics and Virtual Reality\no. CSC'12 - 9th Int'l Conference on Scientific Computing\no. DMIN'12 - 8th Int'l Conference on Data Mining\no. EEE'12 - 11th Int'l Conference on e-Learning, e-Business, Enterprise\n      Information Systems, and e-Government\no. ERSA'12 - 12th Int'l Conference on Engineering of Reconfigurable Systems\n      and Algorithms\no. ESA'12 - 10th Int'l Conference on Embedded Systems and Applications\no. FCS'12 - 8th Int'l Conference on Foundations of Computer Science\no. FECS'12 - 8th Int'l Conference on Frontiers in Education: Computer\n      Science and Computer Engineering\no. GCA'12 - 8th Int'l Conference on Grid Computing and Applications\no. GEM'12 - 9th Int'l Conference on Genetic and Evolutionary Methods\no. ICAI'12 - 14th Int'l Conference on Artificial Intelligence\no. ICOMP'12 - 13th Int'l Conference on Internet Computing\no. ICWN'12 - 11th Int'l Conference on Wireless Networks\no. IKE'12 - 11th Int'l Conference on Information and Knowledge Engineering\no. IPCV'12 - 16th Int'l Conference on Image Processing, Computer Vision,\n      and Pattern Recognition\no. MSV'12 - 9th Int'l Conference on Modeling, Simulation and Visualization\n      Methods\no. PDPTA'12 - 18th Int'l Conference on Parallel and Distributed Processing\n      Techniques and Applications\no. SAM'12 - 11th Int'l Conference on Security and Management\no. SERP'12 - 11th Int'l Conference on Software Engineering Research and\n      Practice\no. SWWS'12 - 11th Int'l Conference on Semantic Web and Web Services\n\nhttp://www.world-academy-of-science.org\n",
    "attachments": []
}