{
    "subject": "SusTech 2020",
    "from": "IEEE eNotice <enotice@ieee.org>",
    "to": "foaad@calpoly.edu",
    "cc": null,
    "bcc": null,
    "date": "Wed, 02 Oct 2019 17:36:49 -0400",
    "body": "To see the web version of this message click here: \nhttp://contentsharing.net/actions/email_web_version.cfm?recipient_id=2908860288&message_id=17492635&user_id=IEEE_MGAIM&jobid=45468518\n\rTake a look at our most recent message: https://www.magnetmail.net/actions/email_web_version.cfm?recipient_id=2908860288&message_id=17492635&user_id=IEEE_MGAIM&group_id=7309520&jobid=45468518Use this link to unsubscribe:\nhttp://unsubscribe.magnetmail.net/Actions/unsubscribe.cfm?message_id=17492635&user_id=IEEE_MGAIM&recipient_id=2908860288&group_id=7309520&jobid=45468518\n\nIf you are having trouble reading this message, click here for the web version.\n\nIEEE SusTech 2020\nTechnologies that improve Air, Water, Energy, Food and Human Life\nApril 23-25, 2020 at DoubleTree by Hilton Hotel, Santa Ana, CA, USA.\nhttp://site.ieee.org/sustech\n \nThere is still time to submit your abstracts!\n \n\n\n\n\nWe Have Extended Our Abstract Deadline to October 22, 2019\n\n\n\n\n \nThe SusTech Conference is designed to explore the development and application of science, engineering and technology that improve Sustainability of Air, Water, Energy, Food and Human Life. It brings together scientists, engineers, technologists and scholars from multiple disciplines to hold a dialogue on environmental issues and collaborate on ideas to develop and utilize innovative tools and intelligent systems to address them.\n \nGrowing List of Our Esteemed Invited Speakers:\nMarty Waldman, Space Information Labs  \"Small Modular Reactors and Microgrids for Military Use\"\nKay Das  \"Challenges of the Connected Vehicle Revolution\"\nSeth Potter  \"Space Based Solar Power\"\nPaul Schultz, LADWP  Power Challenges for Southern California\nDong Tan, Northrop Grumman Aerospace Systems  \"Power Electronics, Smart Grid and Grid Modernization\"\n \nSusTech 2020 is soliciting papers for verbal presentations from industry, government, and academia (including students) covering relevant research, technologies, methodologies, tools and case studies. Topics with policy implications are also welcome.\nSuggested Topics of Interest: \nRenewable/Alternative Energy - Solar/Wind/other                                  Energy Efficiency      \nInternet of Things ( IOT) for Sustainability                                                  Smart Grid   Connected Vehicles\nSustainable Electronics                                              eWaste                       Agriculture and Food Technology\nEcological Sustainability and Conservation                                                Water Resources Management\nOcean Waste & Pollution Management                                                      Societal Implications/ Quality of life\n \nhttp://site.ieee.org/sustech   \nhttps://www.linkedin.com/groups/8594589/\n\n\n\nWestern USA - Region 6 : http://ewh.ieee.org/reg/6/\n\n\tManage your IEEE Communication Preferences at the \nIEEE Privacy Portal\n\n\n\n\n\n",
    "attachments": []
}