{
    "subject": "The reference to references",
    "from": "Scitus Academics <newsletter@academics-scitus.com>",
    "to": "California Polytechnic State University-San Luis Obispo <foaad@calpoly.edu>",
    "cc": null,
    "bcc": null,
    "date": "Tue, 15 Oct 2019 11:51:23 +0000",
    "body": "SCITUS ACADEMICS LLC\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nHello,\n\n\nHaruki Murakami\n once said,If you only read the books that everyone else is reading, you can only think what everyone else is thinking.\n\n\nMany textbooks fail to meet academic needs are commonplace in educational institutes. The weaknesses of textbooks are counterbalanced by reference books.\n\n\nWe at Scitus Academics deal with reference books. Our books cover a plethora of subjects, from management to applied and pure sciences. We ensure that our books are in conformation to the academic curricula of different institutions or universities. The books we publish are a perfect mlange of theories, information, examples and exercise problems in lucid language.\n\n\nIf you are a research scholar in search of good references or if you represent a university or an institution and want the best for the online book repository of your respective institution, look no further.\nYour search ends here at\nScitus Academics\n, the solution to all your book worries. We are a book publishing house with a rich online book storehouse which is getting richer by the day.\n\n\nQuoting Rahm Emanuel, we have come a long way and we have a little further to go, Scitus Academics have come a long way and have been serving clients of different nationalities. However, we have a long way to travel; we aim to extend the reach of Scitus Academics to the nook and corner of the world, encompassing clients from all parts of the world. Introduction of our own book merch is also in the bucket-list.\n\n\nWhat distinguishes us from the rest in the market you ask? We are adaptable, flexible and multifaceted, so are our books. Being at their versatile best, our books are qualified to be adopted as reference books at different educational levels.\n\n\nLastly, our books are not heavy on the pocket, rest assured of that.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nBest regards,\n\n\nSCITUS ACADEMICS LLC\n\n\n3 Germay Dr.\n\n\t\t\t\t\t\tSte 4 - 4314\n\n\t\t\t\t\t\tWilmington DE 19804\n\n\t\t\t\t\t\tUnited States of America\n\n\nhttps://www.scitusacademics.com/\n\n\n\n\n\n\n\n\n\n\n\nFor orders and enquiries, please contact\n\n\nsales@scitusacademics.com\n\n\n\n\nYou can download Catalog & List of Titles by clicking the link -\nCatalog\n &\nExcelic Catalouge\n\n\nCopyright  2019 Scitus Academics LLC.\n\n\n\n\n\n\n\n\nYou can\n \nunsubscribe\n from this list or update subscription preferences",
    "attachments": []
}