{
    "subject": "[GAMESNETWORK] 2nd Call for Papers: Art Exhibit, Doctoral Consortium, and Workshops",
    "from": "\"Rogelio E. Cardona-Rivera\" <rogelio@EAE.UTAH.EDU>",
    "to": "Gamesnetwork <gamesnetwork@uta.fi>",
    "cc": null,
    "bcc": null,
    "date": "Sat, 29 Jun 2019 09:20:35 -0600",
    "body": "Conference website: https://icids.eae.utah.edu \nICIDS is the premier conference for researchers and practitioners concerned with studying digital interactive forms of narrative from a variety of perspectives, including theoretical, technological, and applied design lenses. The annual conference is an interdisciplinary gathering that combines technology-focused approaches with humanities-inspired theoretical inquiry, empirical research and artistic expression.\n\nIn this call, we are delighted to announce the request for participation for the ICIDS 2019 Art Exhibit, Workshops, and Doctoral Consortium!\n\nREMINDER: MAIN CONFERENCE PAPERS DUE SOON!\nAs a reminder, we are still accepting submissions to the ICIDS 2019 Main Conference program on several topics in and around interactive storytelling.  This years organizers take this edition as an opportunity to expand on previously identified topics, related to this years special theme:\n\nDesign Foundations, Innovations, and Practices\nThis years conference features a special theme of Design Foundations, Innovations, and Practices. In addition to the topics covered by previous iterations of ICIDS, the conference program will feature topic areas that focus on principles of design, advancements in the design lifecycle, and design process case studies for interactive storytelling.\n\nImportant Dates\nDeadlines for this call are posted below, for your convenience:\n(All deadlines are specified as Anywhere on Earth time  unless otherwise noted.)\nPaper & Poster submission: \tJuly 12th, 2019\nInitial Notification: \t\tAugust 23rd, 2019\nAuthor Rebuttals: \t\tAugust 30th, 2019\nFinal notifications: \t\tSeptember 6th, 2019\nCamera-ready submission: \tSeptember 13th, 2019\n\nMore details of this call have been posted on the ICIDS 2019 conference website: http://icids.eae.utah.edu/call-for-papers/ . The submission portal for conference papers is: easychair.org/conferences/?conf=icids2019 \nTHE ART EXHIBIT AT ICIDS 2019\nAbout\nThe conference has a long-standing tradition of bringing together theoretical and practical approaches in an interdisciplinary dialogue. This year, the exhibition will be held in connection with the ICIDS conference in Snowbird Ski & Summer Resort, Little Cottonwood Canyon in the Magpie Gallery. The art exhibition will be held in conjunction with the academic conference, which runs from 19  23 of November, with the opening taking place on November 20th at 6 pm (MST). A printed catalog of descriptions of the work and artists statements with supporting images will be given to exhibitors and conference attendees at the opening of the exhibition.\n\nThe ICIDS 2019 Art Exhibition offers the opportunity for artists to present artworks relevant to the field of interactive storytelling through the broad lens of the curated theme: The Expression of Emotion in Humans and Technology. The curatorial theme is intended to inspire (as opposed to constrain) creativity in the imagination and expression of the artist.\n\nMore information about the theme and submission guidelines can be found on the website here: https://icids.eae.utah.edu/art-exhibit/ \n \nImportant Dates\nSeptember 15, 2019\t\tSubmission deadline\nSeptember 24, 2019\t\tArtist notified (via email)\nSeptember 29, 2019\t\tAccepted artist, respond with agreement\nNovember 15, 2019\t\tShipped work must arrive\nNovember 19, 2019\t\tInstallation of Artwork by organizers\nNovember 20, 2019\t\tOpening night\nNovember 23, 2019\t\tClosing of Art Exhibition\nNovember 25, 2019\t\tArtwork returned to artist\nCurators\nRyan Bown (University of Utah, US)\nBrian Salisbury (University of Utah, US)\nTHE WORKSHOPS AT ICIDS 2019\nWorkshops afford participants a smaller, more intimate setting where they can share ideas and learn from each others research. Topics for the workshops change each year, and the limited seating capacity and relaxed atmosphere allow for interpersonal interaction. We are now inviting proposals for workshops to be celebrated at ICIDS 2019. These will be celebrated on the first day of the conference, November 19 2019.\n\nMore information about workshops and submission guidelines can be found here: https://icids.eae.utah.edu/workshops/ \nImportant Dates\nJuly 15, 2019                      Submission deadline\nJuly 29, 2019                      Notifications sent out\n\nChair\nJichen Zhu (Drexel University, US)\nTHE ICIDS 2019 DOCTORAL CONSORTIUM\nAbout\nThe Doctoral Consortium is an opportunity for PhD students in areas related to the topics of ICIDS to present their research work, at a stage where feedback from the community might be beneficial. Students will discuss the work with experts in the area and with peers in a friendly atmosphere where discussion and contributions will be encouraged. Students should have defined their research plan, and can be in intermediate or advanced stages of their research. Regardless of how far along the students are in their research, the work should still be in-progress and malleable enough to take advantage of the feedback from the Doctoral Consortium.\n\nMore information about the doctoral consortium and submission guidelines can be found here: https://icids.eae.utah.edu/doctoral-consortium/ \nImportant Dates\nAugust 1, 2019                      Submission deadline\nAugust 27, 2019                    Notification of acceptance\nSeptember 13, 2019\t\tCamera-ready copy due\nNovember 19 - 23, 2019\tDoctoral consortium celebration (throughout the conference)\n\nChair\nBen Samuel (University of New Orleans, US)\n\nFor general questions, please email the ICIDS Program Chairs by using the following email address: icids2019program@gmail.com \nWe look forward to seeing your contributions at ICIDS 2019!\n Rogelio\n[On behalf of myself and my co-chair, Anne Sullivan (Georgia Institute of Technology, USA)]\n\n--\n\n\tRogelio E. Cardona-Rivera, Ph.D. (Pronouns: he/him, they/them)\nAssistant Professor and Director, Laboratory for Quantitative Experience Design\nEntertainment Arts and Engineering, School of Computing\nThe University of Utah\nMobile 919-798-9011\nhttp://qed.cs.utah.edu\nhttp://rogel.io\n\n\n\n\n\n\n\n\n--\nGamesnetwork, discussion list of Digital Games Research Association, www.digra.org\nNote: to unsubscribe, send \"UNSUBSCRIBE GAMESNETWORK\" to LISTSERV@UTA.FI from\nyour subscribed email account. Web interface to subscribe and manage your subscription:\nhttps://listserv.uta.fi/cgi-bin/wa?SUBED1=GAMESNETWORK&A=1 .\nThe list archive is available online at: https://listserv.uta.fi/archives/gamesnetwork.html\n\nConference website: https://icids.eae.utah.eduICIDS is the premier conference for researchers and practitioners concerned with studying digital interactive forms of narrative from a variety of perspectives, including theoretical, technological, and applied design lenses. The annual conference is an interdisciplinary gathering that combines technology-focused approaches with humanities-inspired theoretical inquiry, empirical research and artistic expression.In this call, we are delighted to announce the request for participation for the ICIDS 2019 Art Exhibit, Workshops, and Doctoral Consortium!REMINDER: MAIN CONFERENCE PAPERS DUE SOON!As a reminder, we are still accepting submissions to the ICIDS 2019 Main Conference program on several topics in and around interactive storytelling.  This years organizers take this edition as an opportunity to expand on previously identified topics, related to this years special theme:Design Foundations, Innovations, and PracticesThis years conference features a special theme of Design Foundations, Innovations, and Practices. In addition to the topics covered by previous iterations of ICIDS, the conference program will feature topic areas that focus on principles of design, advancements in the design lifecycle, and design process case studies for interactive storytelling.Important DatesDeadlines for this call are posted below, for your convenience:(All deadlines are specified as Anywhere on Earth time unless otherwise noted.)Paper & Poster submission:  July 12th, 2019Initial Notification:   August 23rd, 2019Author Rebuttals:   August 30th, 2019Final notifications:   September 6th, 2019Camera-ready submission:  September 13th, 2019More details of this call have been posted on the ICIDS 2019 conference website: http://icids.eae.utah.edu/call-for-papers/. The submission portal for conference papers is: easychair.org/conferences/?conf=icids2019THE ART EXHIBIT AT ICIDS 2019AboutThe conference has a long-standing tradition of bringing together theoretical and practical approaches in an interdisciplinary dialogue. This year, the exhibition will be held in connection with the ICIDS conference in Snowbird Ski & Summer Resort, Little Cottonwood Canyon in the Magpie Gallery. The art exhibition will be held in conjunction with the academic conference, which runs from 19  23 of November, with the opening taking place on November 20th at 6 pm (MST). A printed catalog of descriptions of the work and artists statements with supporting images will be given to exhibitors and conference attendees at the opening of the exhibition.The ICIDS 2019 Art Exhibition offers the opportunity for artists to present artworks relevant to the field of interactive storytelling through the broad lens of the curated theme: The Expression of Emotion in Humans and Technology. The curatorial theme is intended to inspire (as opposed to constrain) creativity in the imagination and expression of the artist.More information about the theme and submission guidelines can be found on the website here: https://icids.eae.utah.edu/art-exhibit/ Important DatesSeptember 15, 2019  Submission deadlineSeptember 24, 2019  Artist notified (via email)September 29, 2019  Accepted artist, respond with agreementNovember 15, 2019  Shipped work must arriveNovember 19, 2019  Installation of Artwork by organizersNovember 20, 2019  Opening nightNovember 23, 2019  Closing of Art ExhibitionNovember 25, 2019  Artwork returned to artistCuratorsRyan Bown (University of Utah, US)Brian Salisbury (University of Utah, US)THE WORKSHOPS AT ICIDS 2019Workshops afford participants a smaller, more intimate setting where they can share ideas and learn from each others research. Topics for the workshops change each year, and the limited seating capacity and relaxed atmosphere allow for interpersonal interaction. We are now inviting proposals for workshops to be celebrated at ICIDS 2019. These will be celebrated on the first day of the conference, November 19 2019.More information about workshops and submission guidelines can be found here: https://icids.eae.utah.edu/workshops/Important DatesJuly 15, 2019                      Submission deadlineJuly 29, 2019                      Notifications sent outChairJichen Zhu (Drexel University, US)THE ICIDS 2019 DOCTORAL CONSORTIUMAboutThe Doctoral Consortium is an opportunity for PhD students in areas related to the topics of ICIDS to present their research work, at a stage where feedback from the community might be beneficial. Students will discuss the work with experts in the area and with peers in a friendly atmosphere where discussion and contributions will be encouraged. Students should have defined their research plan, and can be in intermediate or advanced stages of their research. Regardless of how far along the students are in their research, the work should still be in-progress and malleable enough to take advantage of the feedback from the Doctoral Consortium.More information about the doctoral consortium and submission guidelines can be found here: https://icids.eae.utah.edu/doctoral-consortium/Important DatesAugust 1, 2019                      Submission deadlineAugust 27, 2019                    Notification of acceptanceSeptember 13, 2019  Camera-ready copy dueNovember 19 - 23, 2019 Doctoral consortium celebration (throughout the conference)ChairBen Samuel (University of New Orleans, US)For general questions, please email the ICIDS Program Chairs by using the following email address: icids2019program@gmail.comWe look forward to seeing your contributions at ICIDS 2019! Rogelio[On behalf of myself and my co-chair, Anne Sullivan (Georgia Institute of Technology, USA)]\n--Rogelio E. Cardona-Rivera, Ph.D. (Pronouns: he/him, they/them)Assistant Professor and Director, Laboratory for Quantitative Experience DesignEntertainment Arts and Engineering, School of ComputingThe University of UtahMobile 919-798-9011http://qed.cs.utah.eduhttp://rogel.io\n\n--\nGamesnetwork, discussion list of Digital Games Research Association, www.digra.org\nNote: to unsubscribe, send \"UNSUBSCRIBE GAMESNETWORK\" to LISTSERV@UTA.FI from\nyour subscribed email account. Web interface to subscribe and manage your subscription:\nhttps://listserv.uta.fi/cgi-bin/wa?SUBED1=GAMESNETWORK&A=1 .\nThe list archive is available online at: https://listserv.uta.fi/archives/gamesnetwork.html\n",
    "attachments": []
}