{
    "subject": "[GAMESNETWORK] CFP + 3rd keynote: DiGRA 2020",
    "from": "\"Frans Mäyrä (TAU)\" <frans.mayra@TUNI.FI>",
    "to": "GAMESNETWORK@LISTSERV.UTA.FI",
    "cc": null,
    "bcc": null,
    "date": "Thu, 31 Oct 2019 09:39:04 +0000",
    "body": "*Call for Papers & 3rd Keynote Announcement: DiGRA 2020*\n\nTampere, Finland (June 2-6, 2020)\nhttps://digra2020.org/\n\nUpdates:\n- We have already announced two conference keynotes, Dr Susanna Paasonen and Dr. Kishonna Gray. Today we are happy and proud to announce the third keynote speaker, Dr. Rilla Khaled. Dr Khaled is an Associate Professor in the Department of Design and Computation Arts at Concordia University in Montral, Canada. Dr. Khaled's research is focused on the use of interactive technologies to improve the human condition, a career-long passion that has led to diverse outcomes, including designing award-winning serious games, creating speculative prototypes of near-future technologies, developing a framework for game design specifically aimed at reflective outcomes, and working with Indigenous communities to use contemporary technologies to imagine new, inclusive futures. See: https://digra2020.org/keynotes/.\n- The conference submissions are still open - but it is less than a month to the deadline of full paper, abstract and panel submissions (29 November 2019).\n\nDiGRA 2020 will take place in Tampere, Finland from June 3rd-6th 2020. A pre-conference will be held on Tuesday, June 2nd. DiGRA 2020 is co-hosted by the Centre of Excellence in Game Culture Studies (https://coe-gamecult.org/), a joint effort of game research teams in three universities (Tampere, Turku, and Jyvskyl).\n\nThe theme of DiGRA 2020 is \"Play Everywhere\", exploring the workings of play and games as wide-ranging cultural phenomena which have shaped many areas of society. The ludification of culture, including practices around games, play, and related phenomena have arguably broadened and diversified approaches in the field. Games pervade culture and society, play is everywhere.\n\nWe encourage reflection upon how the collapse of traditional divisions between work and leisure, and between seriousness and playfulness, affect both culture in general, and play and games in particular. On the one hand, the cultural importance of playful phenomena has increased, rendering games one of the defining expressive means of contemporary society. They come with the promise of enhanced agency and participation on an unprecedented scale. On the other hand, the dominance of games and play introduces new challenges, such as the question of videogame hegemony and its global impacts.\n\nWhile game studies in the past has often underlined the hedonic, empowering aspects of games and play, the ludification of society also raises difficult questions around the socioeconomic and environmental cost of game culture. Who is entitled to design, play, and enjoy games and under what conditions?\n\nWith the theme of \"Play Everywhere\", DiGRA 2020 makes space for an interdisciplinary critical debate around related question, inviting a diversity of voices. As mainstream phenomena around games and play grow, so do approaches and tactics at the margin of games culture. This creates potentials for vibrant exchange, methodical variety, and multifaceted critique. DiGRA 2020 welcomes contributions on different game formats, expressions, and phenomena both related to digital and non-digital games.\n\nWe are inviting submissions for the following six tracks:\n\n- Philosophy and Theory of Play & Games: theoretical frameworks and investigations of games and play phenomena as well as meta-reflection on game studies methods and practices.\n- Game Analyses, Criticism and Interpretation: analyses, close-readings, and critical discussions of game texts.\n- Game History and Cultural Context: explorations of game histories, contemporary game cultures and regional game studies.\n- Play and Players: empirical research on play and playful behaviour, players, fandom, and game communities.\n- Game Design, Production and Distribution: reflections on making and research creation, processes of production and design, and the games market.\n- Serious Games and Education: research on games and play for learning, education and therapy, gamification, and other applications beyond game studies.\n\nThere will be several special events associated with the conference, including:\n\n- PhD Consortium: Organized on the pre-conference conference day, this event will allow PhD students to discuss key issues and seek feedback from experienced scholars. It will provide opportunities for further development of research skills that will be of help to emerging scholars in achieving their academic goals.\n\n- Game History Consortium: The consortium brings together game historians and stakeholders such as museum, library, and archive professionals, as well as game company representatives to discuss current topics in game historical research, uses of history, game, gameplay, and game culture preservation, and themes such as local game histories and game industries beyond digital games. The venue is organized in collaboration with the Finnish Museum of Games (opened in January 2017) and the Finnish Game Preservation Roundtable Network.\n\n- Nordic Larp: Theory and Practice: Finland, among other Nordic countries, has a strong tradition of Live action role-playing Games (Larp), both in practice and in research attention. In conjunction with the conference, a half-day event will feature a Larp workshop and a series of talks on Nordic Larps.\n\nMore thematic workshops can be proposed to the organisers (see submission guidelines below).\n\n*Important dates*\n\n- Submission opens: 1 October 2019\n- Full papers, abstracts and panels submission deadline: 29 November 2019\n- Workshop proposals submission deadline 13 December 2019\n- Announcement of review results and workshop acceptance: 20 January 2020\n- Workshop submissions deadline: 14 February 2020\n- Workshop submissions results: 18 February 2020\n- Early bird registration & program deadlines: 13 March 2020\n- Camera-ready papers & abstracts deadline: 3 April 2020\n- Conference dates: 3-6 June 2020\n\nThe submissions will be handled via the EasyChair system (the link to be provided at the website later).\n\nMore information will be updated into the conference website: www.digra2020.org.\n\n*Submission Guidelines*\n\nWe welcome a range of contributions to DiGRA 2020: full papers, extended abstracts, panel and doctoral consortium participation, and workshop proposals.\n\nFull papers and extended abstracts will be peer-reviewed, published on the conference website and published in the conference proceedings available via open-access through the DiGRA Digital Library: http://www.digra.org/digital-library. Panel proposals will be peer-reviewed and published on the conference website, but will not be included in the conference proceedings published through the DiGRA Digital Library. Workshop proposals will be selected by the conference organizers based on non-anonymous submissions.\n\nAll except workshop submissions should be made via EasyChair, which opens on 1st October 2019. Workshop proposals should be sent directly to the conference email.\n\nAuthors are asked to direct questions to the program chairs Sabine Harrer, Tomasz Z. Majkowski and Hanna Wirman.\n\n- Full Paper:\n\nFull papers are expected to be 5000-7000 words plus references, submitted as anonymized pdf on DiGRA Submission Template. Submissions must be original, which means that they have not been published or are under peer review elsewhere.\n\nFull papers are peer-reviewed publications of original game studies research, presenting mature, complete research. Authors must present accepted full papers at the DiGRA conference. Accepted manuscripts will appear in the Proceedings of the 2019 DiGRA International Conference, which is published in the open access DiGRA Digital Library.\n\n- Extended Abstract:\n\nThe suggested length for an extended abstract is 500-800 words, with a maximum of 1000 words, excluding references (only key references should be included), submitted as anonymized pdf using the DiGRA Submission Template. Give a short description in the abstract field of the conference management system, but there is no need for extended abstracts to contain an abstract.\n\nThe purpose of an extended abstract is to demonstrate a contribution interesting to DiGRA audiences. An extended abstract might describe a study or research program that is underway, but might also describe a pending program of research. It might outline findings, or it might establish and discuss a research question. It might describe the study's method or methodology, or it might focus on outcomes and results. It might describe work that is planned, work that is in progress, or work that has been completed.\n\nAccepted extended abstracts will appear in open access DiGRA Digital Library.\n\n- PhD Consortium Submission:\n\nSelection for the PhD consortium will be based on an extended abstract based on ongoing PhD research project, with a maximum of 1000 words, excluding references (see Extended Abstract guidelines, above). They should be submitted to PhD Consortium track, as NON-anonymized pdf, with a short description in the abstract field of the conference management system (there is no need for a doctoral consortium application to have an abstract). Submissions must use the DiGRA 2019 submission template.\n\n- Panel:\n\nA panel session will typically occupy a single conference session and have a duration of 80 to 90 minutes. Panel proposals should have a maximum length of 1000 words, excluding references, plus a 100 word biography of each participant. They should include: the focus or topic of the panel; a description of why the topic will be of interest or relevant to DiGRA attendees; a list of confirmed participants and a description of their background and expertise. Panel proposals will be peer-reviewed.\n\nPanels should be submitted as pdfs on DiGRA Submission Template (optional).\n\n- Workshop:\n\nThe conference workshops are three to six hours long sessions focused on a particular game-related topic. Workshops provide an opportunity for new ideas, theories and trends to be presented and discussed. Workshops can also be practical tutorials.\n\nConcise workshop proposals of no more than 1000 words (excluding bibliography) should include major objectives and expected outcomes of the workshop, the justification for the workshop informed by current trends and research, the format and activities planned for the workshop, the organizers' background, the anticipated number of participants and the way they will be selected.\n\nPlease note that the submission  should not be anonymous as the organizers' background is very important in the decision-making process for workshops.\n\nSubmit workshop proposals directly by email to by 13 December 2019.\n\n- Number of submissions per author:\n\nAuthors cannot submit more than two papers and/or extended abstracts at DiGRA 2020, including PhD Consortium submissions. An individual can be co-authors on as many full papers and extended abstracts as they like, but cannot submit more than two as main author/presenter. If the limit is exceeded, only the two first submissions will be reviewed.\n\nThe limit does not include participation in panels or workshops.\n\nPlease follow the latest news and possible updates to these guidelines at: www.digra2020.org.\n\nWelcome to Tampere!\n\nOn behalf of the organising team;\n-- \n   Frans Myr, Professor, ITC/COMS/TRIM/Gamelab, TUNI.fi\n   Director, Centre of Excellence in Game Culture Studies\n   ** mail: ITC, 33014 Tampere University, Finland **\n   ** frans.mayra@tuni.fi / fransmayra@gmail.com **\n   https://coe-gamecult.org www.fransmayra.fi www.unet.fi\n\n--\nGamesnetwork, discussion list of Digital Games Research Association, www.digra.org\nNote: to unsubscribe, send \"UNSUBSCRIBE GAMESNETWORK\" to LISTSERV@UTA.FI from\nyour subscribed email account. Web interface to subscribe and manage your subscription:\nhttps://listserv.uta.fi/cgi-bin/wa?SUBED1=GAMESNETWORK&A=1 .\nThe list archive is available online at: https://listserv.uta.fi/archives/gamesnetwork.html\n",
    "attachments": []
}