{
    "subject": "[GAMESNETWORK] 7th Games and Literary Theory Conference, Kolkata, 18-20th November",
    "from": "Souvik Mukherjee <prosperosmaze@GMAIL.COM>",
    "to": "Gamesnetwork <gamesnetwork@uta.fi>",
    "cc": null,
    "bcc": null,
    "date": "Thu, 23 May 2019 17:38:06 +0530",
    "body": "Dear All,\n\n\n\nIt is my pleasure to announce the *7th Games and Literary Theory Conference*\n(GamesLit 2019) to be held in Kolkata, India  on *November 18th to 20th*.\nThe venue is Presidency University, Kolkata (formerly Hindoo College and\nPresidency College), which has just celebrated its bicentenary. It is an\nhonour to be able to host the first large games conference in this part of\nAsia and indeed, the so-named Global South.\n\n\n\nKolkata (formerly Calcutta), also known as the 'second city of the British\nEmpire, used to be the capital of the British Raj and is now a vibrant and\ndiverse city with a rich mix of cultures. It is also an appropriate\nlocation for a conference themed* 'Games at the Margin'*. The full call for\npapers is available on the conference website:\nhttps://gameslit2019.wordpress.com and also below.\n\n\n\nWe are looking for *abstracts of at least 300 and no more than. 700 words*;\nmore information is available on the conference website.  Please submit\nyour abstracts via EasyChair at\nhttps://easychair.org/conferences/?conf=gameslit2019 on or before *June\n30th*.\n\n\n\nMore information on the travel, accommodation and other logistical issues\nwill be provided on the website shortly. If you have any queries, please\nemail me at *souvik.eng@presiuniv.ac.in <souvik.eng@presiuniv.ac.in>* or my\ncoorganiser at *debanjana.eng@presiuniv.ac.in\n<debanjana.eng@presiuniv.ac.in>.*\n\n\n\nLooking forward to welcoming you to GamesLit @ Kolkata.\n\nThanks and regards,\n\nSouvik\n\nDr Souvik Mukherjee\nemail: prosperosmaze@gmail.com, Weblog:\nhttp://readinggamesandplayingbooks.blogspot.in/\nVideogames and Storytelling: Reading Games and Playing Books\n<http://www.palgrave.com/page/detail/video-games-and-storytelling-souvik-mukherjee/?isb=9781137525048>\n (Palgrave MacMillan 2015)\nVideogames and Postcolonialism: The Empire Plays Back\n<https://www.amazon.com/Videogames-Post-colonialism-Souvik-Mukherjee/dp/3319548212>\n(Springer\nUK 2017)\n\n---------------------------------------------------------------------------------------------------------------\n\nCall for Papers\n\nVideogames have grown into a global socio-cultural phenomenon and are now a\nprimary concern of Literary and Cultural Studies as well as the Social\nSciences. In a medium that sweeps across geographies (including virtual\nones), however, the discourse usually privileges a certain section  when it\ncomes to the representation of identity. In a medium, where roleplaying and\nplaying in character is of prime importance, such an ignoring of the\nmarginal and the diverse is indeed problematic.\n\nIn one of the first books on the subject, Adrienne Shaw says Teaching\nclasses on minority representation in games, I heard this refrain repeated\nyet again by my students. Video games are a niche medium; they are fantasy\nenvironments; and they are designed for a narrow market. Of course games\nare not diverseso what? [] I realized that I recognized myself in my\nparticipants responses. After all, I too grew up playing a medium for\nwhich I was not the primary market and media in which only certain aspects\nof my identity were ever shown (Shaw 2015). Shaws concern is an urgent\none and recent events related to racism, sexism and other kinds of\ndiscrimination in the videogame industry and in the content of the games,\nhighlights the importance of academic dialogues around gaming at the\nmargins, as it were.\n\nThese concerns, of course, echo much older debates on diversity and\ndifference in Literary and Cultural Studies. Identity and indeed, even the\nbody, are constructs in the Foucauldian framework of biopower and beyond\nthe actual control of individuals. Thinkers such as Judith Butler, Julia\nKristeva and bell hooks point out how the the body is marginalised based on\ngender, race and class. Similarly, the constructedness of the Orient and\nthe Oriental in colonial discourse as shown by Edward Said and also how\nthe colonial system also renders certain groups of people subaltern and\nhow this affects the discourse of diversity as Gayatri Chakravarty Spivak\nand Homi Bhabha make evident. Often, the discourse of diversity and the\nmargins pervades games as well although the connection is not often made\nevident in the older and more traditional disciplines.\n\nRecent games scholarship has started addressing issues of diversity in\ngames through the new Diversity Group that is now part of the Digital Games\nResearch Association (DiGRA), books on gender, race and colonialism (Shaw\n2015; Murray 2018; Mukherjee 2017) as well as edited journal issues and\npanel discussions. As crucial to discussions of both games and literary\ntheory, these issues form the main theme of this years Games and Literary\nTheory Conference, being held in Kolkata (formerly Calcutta), India.\n\nWe welcome papers on but not restricted to the following topics:\n\n   - Representations of diverse games in literature.\n   - Remediating marginality: from non-canonical literature to games.\n   - Studying games with literary theory: from the center to the margins.\n   - Marginalized discourses of gaming culture.\n   - Digital and non-digital games as tools to resist inequality and\n   erasure.\n   - Representations of gender, queerness, race, class and caste in games\n   vis a vis literature.\n   - Colonization,  migration and diasporas in understanding game spaces.\n   - cis-heteropatriarchal gender norms and gaming.\n   - The language of the digital frontier in gaming and tech cultures\n   - Diversity practices and games studies.\n   - Empathy games that engage with racism and the refugee experience.\n   - Decolonizing struggles in the gaming industry around labour and money\n   - Digital Humanities from the margins vis a vis gamer culture in Global\n   North vs. the Global South.\n\nPlease send your questions or comments to: debanjana.eng@presiuniv.ac.in\n\nMore info and updates to be found on the website and on Facebook.\n\n--\nGamesnetwork, discussion list of Digital Games Research Association, www.digra.org\nNote: to unsubscribe, send \"UNSUBSCRIBE GAMESNETWORK\" to LISTSERV@UTA.FI from\nyour subscribed email account. Web interface to subscribe and manage your subscription:\nhttps://listserv.uta.fi/cgi-bin/wa?SUBED1=GAMESNETWORK&A=1 .\nThe list archive is available online at: https://listserv.uta.fi/archives/gamesnetwork.html\n<meta http-equiv=\"Content-Type\" content=\"text/html; charset=utf-8\"><div dir=\"ltr\">\n<p class=\"MsoNormal\">Dear All,</p><div><p class=\"MsoNormal\">&nbsp;</p></div><div><p class=\"MsoNormal\">It is my pleasure to announce the <b>7th Games and Literary Theory Conference</b> (GamesLit 2019) to be held in Kolkata, India &nbsp;on <b>November 18th to 20th</b>.\n The venue is Presidency University, Kolkata (formerly Hindoo College \nand Presidency College), which has just celebrated its bicentenary. It \nis an honour to be able to host the first large games conference in this\n part of Asia and indeed, the so-named Global South.</p></div><div><p class=\"MsoNormal\">&nbsp;</p></div><div><p class=\"MsoNormal\">Kolkata\n (formerly Calcutta), also known as the 'second city of the British \nEmpire, used to be the capital of the British Raj and is now a vibrant \nand diverse city with a rich mix of cultures. It is also an appropriate \nlocation for a conference themed<b> 'Games at the Margin'</b>. The full call for papers is available on the conference website:&nbsp;<a href=\"https://gameslit2019.wordpress.com\" target=\"_blank\">https://gameslit2019.wordpress.com</a>&nbsp;and also below.</p></div><div><p class=\"MsoNormal\">&nbsp;</p></div><div><p class=\"MsoNormal\">We are looking for <b>abstracts of at least 300 and no more than. 700 words</b>; more information is available on the conference website.&nbsp; Please submit your abstracts via EasyChair at&nbsp;<a href=\"https://easychair.org/conferences/?conf=gameslit2019\" target=\"_blank\">https://easychair.org/conferences/?conf=gameslit2019</a>&nbsp;on or before <b>June 30th</b>.&nbsp;</p></div><div><p class=\"MsoNormal\">&nbsp;</p></div><div><p class=\"MsoNormal\">More\n information on the travel, accommodation and other logistical issues \nwill be provided on the website shortly. If you have any queries, please\n email me at <b><a href=\"mailto:souvik.eng@presiuniv.ac.in\" target=\"_blank\">souvik.eng@presiuniv.ac.in</a></b> or my coorganiser at <b><a href=\"mailto:debanjana.eng@presiuniv.ac.in\" target=\"_blank\">debanjana.eng@presiuniv.ac.in</a>.</b></p></div><div><p class=\"MsoNormal\">&nbsp;</p></div><div><p class=\"MsoNormal\">Looking forward to welcoming you to GamesLit @ Kolkata.</p></div><br><div><div dir=\"ltr\" class=\"m_-1555628654782724471gmail_signature\" data-smartmail=\"gmail_signature\"><div dir=\"ltr\"><div dir=\"ltr\"><div dir=\"ltr\"><div dir=\"ltr\"><div dir=\"ltr\"><span style=\"border-collapse:collapse\"><font><div style=\"font-size:13px;font-family:arial,sans-serif\">Thanks and regards,<br><br>Souvik<div><br></div><div><div><font size=\"1\" color=\"#333333\">Dr Souvik Mukherjee</font></div><div style=\"text-align:justify\"><font size=\"1\" color=\"#333333\">email:&nbsp;<a href=\"mailto:prosperosmaze@gmail.com\" target=\"_blank\">prosperosmaze@gmail.com</a>,&nbsp;<span style=\"font-family:tahoma,Arial,Helvetica,sans-serif;line-height:17px\">Weblog:</span><span style=\"font-family:tahoma,Arial,Helvetica,sans-serif;line-height:17px\">&nbsp;&nbsp;</span><a href=\"http://readinggamesandplayingbooks.blogspot.in/\" target=\"_blank\">http://readinggamesandplayingbooks.blogspot.in/</a></font></div></div><div style=\"text-align:justify\"><font size=\"1\"><a href=\"http://www.palgrave.com/page/detail/video-games-and-storytelling-souvik-mukherjee/?isb=9781137525048\" style=\"font-style:italic\" target=\"_blank\">Videogames and Storytelling: Reading Games and Playing Books</a><i>&nbsp;</i>(Palgrave MacMillan 2015)</font></div><div><div style=\"text-align:justify\"><font size=\"1\"><a href=\"https://www.amazon.com/Videogames-Post-colonialism-Souvik-Mukherjee/dp/3319548212\" style=\"color:rgb(17,85,204)\" target=\"_blank\">Videogames and Postcolonialism: The Empire Plays Back</a>&nbsp;(Springer UK 2017)</font></div><div style=\"text-align:justify\"><font size=\"1\"><br></font></div><div style=\"text-align:justify\"><font size=\"1\">---------------------------------------------------------------------------------------------------------------</font></div><div style=\"text-align:justify\"><font size=\"1\"><br></font></div><div style=\"text-align:justify\"><font size=\"1\">\n</font>\n\t\t<h1 class=\"m_-1555628654782724471entry-title\">Call for Papers</h1>\t\n\t\t<div class=\"m_-1555628654782724471entry-content\">\n\t\t\t\n<p>Videogames have grown into a global socio-cultural phenomenon and are\n now a primary concern of Literary and Cultural Studies as well as the \nSocial Sciences. In a medium that sweeps across geographies (including \nvirtual ones), however, the discourse usually privileges a certain \nsection &nbsp;when it comes to the representation of identity. In a medium, \nwhere roleplaying  and playing in character is of prime importance, such\n an ignoring of the marginal and the diverse is indeed problematic.<br></p>\n\n\n\n<p>In one of the first books on the subject, Adrienne Shaw says \nTeaching classes on minority representation in games, I heard this \nrefrain repeated yet again by my students. Video games are a niche \nmedium; they are fantasy environments; and they are designed for a \nnarrow market. Of course games are not diverseso what? [] I realized \nthat I recognized myself in my participants responses. After all, I too\n grew up playing a medium for which I was not the primary market and \nmedia in which only certain aspects of my identity were ever shown \n(Shaw 2015). Shaws concern is an urgent one and recent events related \nto racism, sexism and other kinds of discrimination in the videogame \nindustry and in the content of the games, highlights the importance of \nacademic dialogues around gaming at the margins, as it were.<br></p>\n\n\n\n<p>These concerns, of course, echo much older debates on diversity and \ndifference in Literary and Cultural Studies. Identity and indeed, even \nthe body, are constructs in the Foucauldian framework of biopower and \nbeyond the actual control of individuals. Thinkers such as Judith \nButler, Julia Kristeva and bell hooks point out how the the body is \nmarginalised based on gender, race and class. Similarly, the \nconstructedness of the Orient and the Oriental in colonial discourse\n as shown by Edward Said and also how the colonial system also renders \ncertain groups of people subaltern and how this affects the discourse \nof diversity as Gayatri Chakravarty Spivak and Homi Bhabha make evident.\n Often, the discourse of diversity and the margins pervades games as \nwell although the connection is not often made evident in the older and \nmore traditional disciplines.<br></p>\n\n\n\n<p>Recent games scholarship has started addressing issues of diversity \nin games through the new Diversity Group that is now part of the Digital\n Games Research Association (DiGRA), books on gender, race and \ncolonialism (Shaw 2015; Murray 2018; Mukherjee 2017) as well as edited \njournal issues and panel discussions. As crucial to discussions of both \ngames and literary theory, these issues form the main theme of this \nyears Games and Literary Theory Conference, being held in Kolkata \n(formerly Calcutta), India. <br></p>\n\n\n\n<p>We welcome papers on but not restricted to the following topics:<br></p>\n\n\n\n<ul><li>Representations of diverse games in literature.</li><li>Remediating marginality: from non-canonical literature to games.</li><li>Studying games with literary theory: from the center to the margins.</li><li>Marginalized discourses of gaming culture.</li><li>Digital and non-digital games as tools to resist inequality and erasure.<br></li><li>Representations of gender, queerness, race, class and caste in games vis a vis literature.</li><li>Colonization, &nbsp;migration and diasporas in understanding game spaces.</li><li>cis-heteropatriarchal gender norms and gaming.</li><li>The language of the digital frontier in gaming and tech cultures</li><li>Diversity practices and games studies.</li><li>Empathy games that engage with racism and the refugee experience.</li><li>Decolonizing struggles in the gaming industry around labour and money</li><li>Digital Humanities from the margins vis a vis gamer culture in Global North vs. the Global South.</li></ul>\n\n\n\n<p>Please send your questions or comments to: <a href=\"mailto:debanjana.eng@presiuniv.ac.in\" target=\"_blank\">debanjana.eng@presiuniv.ac.in</a> </p>\n\n\n\n<p>More info and updates to be found on the  website and on Facebook.</p></div>\n\n</div></div><div><font size=\"1\"><br></font></div></div></font></span></div></div></div></div></div></div></div></div>\n--\nGamesnetwork, discussion list of Digital Games Research Association, <a href=\"http://www.digra.org\" target=\"_blank\">www.digra.org</a>\nNote: to unsubscribe, send &quot;UNSUBSCRIBE GAMESNETWORK&quot; to <a href=\"mailto:LISTSERV@UTA.FI\">LISTSERV@UTA.FI</a> from\nyour subscribed email account. Web interface to subscribe and manage your subscription:\n<a href=\"https://listserv.uta.fi/cgi-bin/wa?SUBED1=GAMESNETWORK&amp;A=1\" target=\"_blank\">https://listserv.uta.fi/cgi-bin/wa?SUBED1=GAMESNETWORK&amp;A=1</a> .\nThe list archive is available online at: <a href=\"https://listserv.uta.fi/archives/gamesnetwork.html\" target=\"_blank\">https://listserv.uta.fi/archives/gamesnetwork.html</a>\n",
    "attachments": []
}