{
    "subject": "[GAMESNETWORK] CFP reminder:",
    "from": "Henrik Warpefelt <henrik.warpefelt@SPELDESIGN.UU.SE>",
    "to": "Gamesnetwork <gamesnetwork@uta.fi>",
    "cc": null,
    "bcc": null,
    "date": "Mon, 29 Apr 2019 16:25:46 +0200",
    "body": "Just a quick reminder that the extended deadline for The Workshop on\nUser Experience of Artificial Intelligence in Games is on Friday May\n3rd! See below for CFP and links.\n\nCall for Papers to the 2019 Workshop on User Experience of Artificial\nIntelligence in Games @ FDG\n\nHow do players experience Artificial Intelligence (AI) in games? How do\nthey feel about the AI, and how is what the AI does communicated to the\nplayer? Is there interaction with the AI, and if so, who takes the lead?\nIs this a social experience, a believable one? Is the AI creative, or at\nleast perceived as such? And finally, is the AI making the game\nexperience better?\nAIs fill many roles in games, from companions to antagonists, from\nstorytellers to architects and game testers. With all the recent focus\nand technical advances in AI this is likely to increase, and the recent\npopularity of artificial intelligence is moving AIs to the foreground of\ngames. This raises many questions  and in this workshop, we want to\nlook at those surrounding the player's user experience with artificial\nintelligence in its many forms.\n\nThe 2019 Workshop on User Experience and Artificial Intelligence\nencompasses the intersection between UX and AI as it manifests in games.\nWe wish to act as a point of interaction between researchers specialized\nwithin these fields, in the hope that this will help facilitate research\nthat allows for the creation of more interesting and robust AI-based\ngame experiences.\nThis workshop aims to build a community centered on this by putting\nforward demonstrations of work in the integration of these two areas, as\nwell as models and theories that can be used to create understanding\nwhere the areas intersect. We especially welcome demonstrations of work\nin progress or work showcasing new ideas. We are interested in realized\nprototypes, demons and applications  especially designed created to\nexplore hypotheses. We are also open to philosophical and\nhumanities-based approaches and provocative ideas.\n\nThe workshop is co-located and organized with the 2019 Foundations of\nDigital Games (FDG) conference in San Luis Obispo, California, USA. The\nexact workshop date is TBD, but will take place sometime during the\nconference (August 26-30, 2019).\n\nTopics\nTopics include, but are not limited to:\nthe believability and presentation of non-player characters\nthe UX created by procedurally generated content\nthe narratives woven by director AIs\ntrade-offs between autonomy and control over storylines, dialogue, and\nsimilar\nperception and acceptance of game design assistance tools\nthe presentation of AI in game design\nthe perception of AI in games\nuser-centric examinations of the various technologies that are used to\nconstruct these in-game functions\nof particular interest are studies on how we create interesting game\nexperiences using AI, and how these are interpreted by players\n\nSubmission guidelines\nWe will accept submissions for the following:\nPapers\nDemos\nInteresting artifacts\n\nThe workshop will accept submissions in the form of papers and\ndemos/artifacts. Submissions will be subject to double-blind peer\nreview. Each submission will receive feedback from at least two\nreviewers, as well as a meta-review. Authors of accepted submissions\nwill be invited to give an oral presentation of their submission. We are\nespecially interested in seeing work in progress or discussions of open\nissues within the field.\n\nSubmissions must use the ACM template. Papers must be 5-8 pages long,\nexcluding references. Demo/artifact submissions can be up to 2 pages\nlong and must containing a link where the demo/artifact can be downloaded.\nAccepted papers will be published in the ACM Digital Library along with\nthe conference proceedings of FDG 2019.\n\nSubmission instructions\nAll submissions should be in the PDF format, use the ACM Master\nTemplate, and be submitted through EasyChair.\n\nDates\nMay 3 2019 Submission deadline\nJune 5 2019 Author notification\nJune 20 2019 Camera Ready deadline\n\nContact\nPlease use organizers[at]uxofai.org.\n\nMore info at http://uxofai.org\n\nRegards,\nHenrik Warpefelt, Christoph Salge, Harko Verhagen, Mirjam Palosaari\nEladhari\n\n--\nHenrik Warpefelt\nAssistant Professor\nDepartment of Game Design, Uppsala University\n\n\n\n\n\n\n\n\n\nNr du har kontakt med oss p Uppsala universitet med e-post s innebr det att vi behandlar dina personuppgifter. Fr att lsa mer om hur vi gr det kan du lsa hr: http://www.uu.se/om-uu/dataskydd-personuppgifter/\n\nE-mailing Uppsala University means that we will process your personal data. For more information on how this is performed, please read here: http://www.uu.se/en/about-uu/data-protection-policy\n\n--\nGamesnetwork, discussion list of Digital Games Research Association, www.digra.org\nNote: to unsubscribe, send \"UNSUBSCRIBE GAMESNETWORK\" to LISTSERV@UTA.FI from\nyour subscribed email account. Web interface to subscribe and manage your subscription:\nhttps://listserv.uta.fi/cgi-bin/wa?SUBED1=GAMESNETWORK&A=1 .\nThe list archive is available online at: https://listserv.uta.fi/archives/gamesnetwork.html\n",
    "attachments": []
}