{
    "subject": "[GAMESNETWORK] CFP: The Aesthetics of Computer Games",
    "from": "Feng Zhu <feng.zhu.9@GMAIL.COM>",
    "to": "Gamesnetwork <gamesnetwork@uta.fi>",
    "cc": null,
    "bcc": null,
    "date": "Thu, 06 Jun 2019 12:27:16 +0300",
    "body": "Call for papers \n\n\n\n\nThe 13th International Conference on the Philosophy of Computer Games: The Aesthetics of Computer Games \n\n\n\n\nConference Committee: \n\n\n\nProgram Chair: \n\nFeng Zhu (Kings College London) \n\nfeng.zhu@kcl.ac.uk\n\n\n\nConference Chairs: \n\nAlina Latypova (St Petersburg State University) \n\nlatypova.al@gmail.com\n\nKonstantin Ocheretyany (St Petersburg State University) \n\nkocheretyany@gmail.com\n\n\n\n\n\nWe invite submissions to the \n13th International Conference on the Philosophy of Computer Games, organised by the Game Philosophy Network, together with the Centre for Media Philosophy and Laboratory for Computer Games Research, in St Petersburg, Russia, on October 2124, 2019. \n\n\n \nThe theme of this years conference is \nThe Aesthetics of Computer Games.\n  Playing games yields particular kinds of playful experiences or perceptions through the senses, which can be studied with an aesthetic focus, emphasising asthsis over nosis. Computer games can be regarded as playful media that organise our perceptions and modify our sensibilities. For this conference, we welcome submissions on (but not limited to) the following themes and questions: \n\n\n\n\n1. Aesthetics as aesthesis (asthsis).\n Is there an aesthetics or mode of experience that is specific to computer games? How do their visual, audio, and haptic aspects come together to produce distinctive experiences? How are experience and perception explored in computer games and shaped by them? Can concepts such as affect, atmosphere, and rhythm be productively applied to computer games? What is the role of game interfaces on player experience? \n\n\n\n\n2. Games as art?\n What are the conditions of possibility of games being art? How do computer games fit into established categories or conventions of aesthetics, and how do they contribute to new ones? Do games recognised as having a claim to artistic status differ from mainstream games? How do accounts of art based on necessary and sufficient conditions match up against anti-essentialist accounts in terms of gauging the status of computer games? \n\n\n\n\n3. The aesthetics of gaming practices.\n Are games collaboratively authored? How do different kinds of play, or player-game conjunctions, bring about different kinds of gaming pleasures or aesthetic experiences? How do different bodies encounter computer games and what can be said about the way in which gameplay experience is mediated by our bodies? \n\n \nDo some kinds of gameplay or extra-gamic player practices have an aesthetic orientation? Are computer games performances? \n\n\n\n\n4. The ethical, political, and social dimensions of game aesthetics.\n What is the transformative potential of computer games and how does this compare to the transformative capabilities ascribed to artworks? How do aesthetic issues interconnect with ethical, social, and political ones  what is the autonomy or heteronomy of the aesthetic domain? How are taste, sensibility, and habit acquired with respect to gameplay and what are the social implications of this? \n\n\n\nIn addition to this central theme, the conference also features an open category, for which we invite welcome contributions that do not fit this years theme, but that nonetheless offer a valuable contribution to the philosophy of computer games. \n\n\n\nSubmitted proposals should have a clear focus on philosophy and philosophical (including media philosophical) issues in relation to computer games. They should also refer to specific games rather than invoke them in more general terms. \nSubmissions should be made in the form of extended abstracts of up to 1000 words (excluding bibliography).\n Please indicate if you intend your paper to fit in the open category. \nThe deadline for submissions is 23:59 GMT, Sunday, 11th August, 2019.\n Please submit your abstract through \nreview.gamephilosophy.org.\n All submitted abstracts will be subject to a double-blind peer review process. \n\n\n\nNotification of accepted submissions will be sent out in late August 2019. A full paper draft must then be submitted by Monday, 14th October 2019 and will be made available on the conference website. \n\n\n\n\nWe also invite proposals for themed panels and workshops that will take place on the 20th and 24th October, 2019.\n Please contact the program committee chair if you are interested in organising one. \n\n\n\n\nWe cannot provide grants or subsidies for participants. There will, however, be no conference fee.\n\n\n\nFor more information about the conference please visit \nhttp://gameconference.mediaphilosophy.ru/pcg2019.html\n and \ngamephilosophy.org\n. \n\n\n\n\n\n\nVisa information\n\n\n\nPlease note that you may need to obtain a visa to enter Russia. \n\n\n\nIf you need a visa you should apply for it at the Russian consulate in your country or at the visa service (the most popular is \nVisaGlobal\n). All visa services have an additional fee. \nSt. Petersburg State University provides attendees with an invitation letter, which helps to obtain the humanitarian visa. Normally the costs of the humanitarian visa is less than the tourist or business one (for German and Polish citizens, for instance, the humanitarian visa is free if they apply for it in the consulate). \n\n\n\nThe cost of visas varies from country to country. Here is a \nlist of some countries\n. \n\n\n\nAll the information concerning the visa costs and the processing time (normally it takes from 4 to 20 days, depending on the country) is available here: \nhttps://www.vfsglobal.com\n. If you have any questions concerning visas, do not hesitate to contact Alina Latypova (\nlatypova.al@gmail.com\n).\n\n\n\nAttendees from the following countries do not need to obtain a Russian visa: \n\n\n\n\nAzerbaijan, Armenia, Belarus, Kazakhstan, Kyrgyzstan, Moldova, Tajikistan, Turkmenistan, Uzbekistan, Ukraine.\n\nCitizens of the countries of the CIS (the Commonwealth of Independent States) are permitted to stay in the Russian Federation for up to 90 days without a visa. \n\n\n\n\nArgentina, Brazil, Chile, Colombia, Israel, Nicaragua, Peru, Venezuela.\n\nCitizens of these countries are allowed to stay in the Russian Federation without a visa for up to 90 days in each 180-day period, provided they will not be involved in any commercial or work-related activities during their stay. \n\n\n\n\nCuba, Montenegro, Serbia (with biometric passport), Thailand, Hong Kong SAR (up to 14 days), Macao SAR.\n\nCitizens of the countries in this group can stay in the Russian Federation for up to 30 days without a visa. They are not entitled to work while in Russia. \n\n\n\n\nBosnia and Herzegovina, Macedonia.\n\nCitizens of these Balkan countries can also stay in Russia without a visa for up to 30 days, but must also show tourist documents (tourist confirmation and tourist voucher) or an official invitation to immigration officials. \n\n\n\n\n\n\nAbout\n\n\n\nThe Centre for Media Philosophy at the Institute of Philosophy, St. Petersburg State University, in collaboration with the Game Philosophy Network, have come together to organize a double conference on philosophical issues raised by computer games. \n\n\n\nThe 13th International Philosophy of Computer Games Conference, \n\"The Aesthetics of Computer Games\"\n (Oct 21-24), will explore various philosophical issues in thinking about the aesthetics of games and gameplay, whilst \n\"Computer Games as Interfaces to Media Reality\"\n (Oct 21-25) will address issues that spring from considering computer games to be experience machines for the modification of sensibility, thought, and imagination. Our aim is to provide a meeting place for scholars of media philosophy and game philosophy in order to inspire future investigations into the commonalities and differences between these approaches.\n\n\n\n\n\n\nConference Committee (full)\n\n\n\nProgram Committee: \n\n\n\nAlina Latypova (St Petersburg State University) \n\nAnita Leirfall (University of Bergen) \n\nDarshana Jayemanne (Abertay University) \n\nFeng Zhu (Kings College London)(chair) \n\nGrant Tavinor (Lincoln University) \n\nHans-Joachim Backe (IT University of Copenhagen) \n\nJohn Richard Sageng (Game Philosophy Network) \n\nKonstantin Ocheretyany (St Petersburg State University) \n\nMarc Bonner (University of Cologne) \n\nMargarita Skomorokh (St Petersburg State University) \n\nMathias Fuchs (Leuphana University of Lneburg) \n\nOlli Leino (City University of Hong Kong) \n\nPawel Grabarczyk (IT University of Copenhagen) \n\nSebastian Mring (University of Potsdam) \n\nSonia Fizek (Media Academy Stuttgart) \n\nVeli-Matti Karhulahti (University of Jyvskyl/University of Turku) \n\nWilliam Huber (Abertay University) \n\n\n\nOrganizing Committee: \n\nAlexander Lenkevich (St Petersburg State University) \n\nAlina Latypova (St Petersburg State University)(chair) \n\nKonstantin Ocheretyany (St Petersburg State University)(chair) \n\nMargarita Skomorokh (St Petersburg State University) \n\n\n\n\n\nFor additional queries, do not hesitate to email the organisers using the following email address: \nfeng (dot) zhu (at) kcl (dot) ac (dot) uk\n\n\n\nWarm regards, \n\n\n\nFeng Zhu\n\n\n\n\n\nTeaching Fellow in Digital Media and Culture\n\nDepartment of Digital Humanities\n\nKing's College London\n\nRoom C0.07, Chesham Building \n\nLondon, WC2R 2LS\n\n--\nGamesnetwork, discussion list of Digital Games Research Association, \nwww.digra.org\n\nNote: to unsubscribe, send \"UNSUBSCRIBE GAMESNETWORK\" to \nLISTSERV@UTA.FI\n from\nyour subscribed email account. Web interface to subscribe and manage your subscription:\n\nhttps://listserv.uta.fi/cgi-bin/wa?SUBED1=GAMESNETWORK&A=1\n .\nThe list archive is available online at: \nhttps://listserv.uta.fi/archives/gamesnetwork.html",
    "attachments": []
}