{
    "subject": "[GAMESNETWORK] Call for Chapters: Global Perspectives on Gameful and Playful Teaching and Learning",
    "from": "Matthew Farber <mattfarber1@GMAIL.COM>",
    "to": "Gamesnetwork <gamesnetwork@uta.fi>",
    "cc": null,
    "bcc": null,
    "date": "Fri, 10 May 2019 17:13:45 +0300",
    "body": "Greetings,\n \nI hope this e-mail finds you well! Currently, I am in the process of editing a forthcoming book entitled Global Perspectives on Gameful and Playful Teaching and Learning, to be published by IGI Global, an international publisher of progressive academic research. I would like to take this opportunity to cordially invite you to submit your work for consideration in this publication. \n \nPlease visit https://www.igi-global.com/publish/call-for-papers/call-details/4082 (and see below) for details regarding this publication and to submit your work. You can also find detailed manuscript formatting and submission guidelines at http://www.igi-global.com/publish/contributor-resources/before-you-write/. If you have any questions or concerns, please do not hesitate to contact me. \n \nThank you very much for your consideration of this invitation, and I hope to hear from you by June 10, 2019!\n \nBest wishes,\nMatthew Farber, Ed.D.  \nEditor, Global Perspectives on Gameful and Playful Teaching and Learning\n \n\nCALL FOR CHAPTER PROPOSALS\nProposal Submission Deadline: June 10, 2019\nGlobal Perspectives on Gameful and Playful Teaching and Learning\nEditor, Matthew Farber, Ed.D.\nUniversity of Northern Colorado\n  \nIntroduction\nIn the fast-changing field of game-based learning, there exists a need for an edited collection of enhanced and updated research, alongside original research in this area. The main goals of this book are present summation of enhanced papers from the International Journal of Game-Based Learning (IJGBL), as well as additional original chapters. Chapters should identify, explain, and improve the interaction between learning outcomes and motivation in games (digital and analog), and to promote best practices for the integration of games in instructional settings. It is multidisciplinary and will address cognitive, psychological and emotional aspects of game-based learning.\n \nObjective\nThis book aims to the provide relevant theoretical and empirical understanding of game-based learning. To achieve this aim, the journal publishes theoretical manuscripts, empirical studies, and literature reviews. The journal publishes this multidisciplinary research from fields that explore the cognitive and psychological aspects that underpin successful educational video games. It also will provide students, researchers, instructors, and policymakers with valuable information about game-based learning, with the purpose of increasing understanding of the process of designing, developing and deploying successful educational games.\n \nTarget Audience\nThe target audience of the journal is composed of professionals and researchers working in the fields of educational games development, e-learning, technology-enhanced education, multimedia, educational psychology, and information technology. IJGBL promotes an in-depth understanding of the multiple factors and challenges inherent to the design and integration of game-based learning environments.\n \nRecommended Topics\n•\tAdaptive games design for game-based learning\n•\tDesign of educational games for people with disabilities\n•\tEducational video games and learning management systems\n•\tGame design models and design patterns for game-based learning\n•\tInstructional design for game-based learning\n•\tIntegration and deployment of video games in the classroom\n•\tIntelligent tutoring systems and game-based learning\n•\tLearning by designing and developing video games\n•\tLearning styles, behaviors and personalities in educational video games\n•\tMobile development and augmented reality for game-based learning\n•\tMotivation, audio and emotions in educational video games\n•\tRole of instructors\n•\tVirtual worlds and game-based learning\n \nSubmission Procedure\nResearchers and practitioners are invited to submit on or before June 10, 2019, a chapter proposal of 1,000 to 2,000 words clearly explaining the mission and concerns of his or her proposed chapter. Authors will be notified by June 30, 2019 about the status of their proposals and sent chapter guidelines. Full chapters are expected to be submitted by July 30, 2019, and all interested authors must consult the guidelines for manuscript submissions at http://www.igi-global.com/publish/contributor-resources/before-you-write/ prior to submission. All submitted chapters will be reviewed on a double-blind review basis. Contributors may also be requested to serve as reviewers for this project. \n \nNote: There are no submission or acceptance fees for manuscripts submitted to this book publication. All manuscripts are accepted based on a double-blind peer review editorial process. \n \nAll proposals must be submitted through the eEditorial DiscoveryTM online submission manager: https://www.igi-global.com/publish/call-for-papers/call-details/4082 \n \nPublisher\nThis book is scheduled to be published by IGI Global (formerly Idea Group Inc.), an international academic publisher of the Information Science Reference (formerly Idea Group Reference), Medical Information Science Reference, Business Science Reference, and Engineering Science Reference imprints. IGI Global specializes in publishing reference books, scholarly journals, and electronic databases featuring academic research on a variety of innovative topic areas including, but not limited to, education, social science, medicine and healthcare, business and management, information science and technology, engineering, public administration, library and information science, media and communication studies, and environmental science. For additional information regarding the publisher, please visit www.igi-global.com. This publication is anticipated to be released in late 2019 or early 2020.\n \nImportant Dates\nJune 10, 2019: Proposal deadline \nJuly 30, 2019: Full chapter Submission \nAugust 15, 2019: Reviews returned to Editor \nAugust 30, 2019: Reviews returned to Authors \nSeptember 30, 2019: Revisions due from Authors \nNovember 25, 2019: Final Materials to IGI Global\n \nInquiries\nMatthew Farber, Ed.D.\nUniversity of Northern Colorado\nMatthew.Farber@unco.edu\n\n--\nGamesnetwork, discussion list of Digital Games Research Association, www.digra.org\nNote: to unsubscribe, send \"UNSUBSCRIBE GAMESNETWORK\" to LISTSERV@UTA.FI from\nyour subscribed email account. Web interface to subscribe and manage your subscription:\nhttps://listserv.uta.fi/cgi-bin/wa?SUBED1=GAMESNETWORK&A=1 .\nThe list archive is available online at: https://listserv.uta.fi/archives/gamesnetwork.html\n",
    "attachments": []
}