{
    "subject": "[GAMESNETWORK] CFP: Zip-Scene Conference",
    "from": "Bakk Ágnes <bakkagnes@GMAIL.COM>",
    "to": "Gamesnetwork <gamesnetwork@uta.fi>",
    "cc": null,
    "bcc": null,
    "date": "Thu, 06 Jun 2019 15:27:43 +0200",
    "body": "*Call for Papers for*\n\n*II. Zip-Scene Conference on Analogue and Digital Immersive Spaces*\n*Budapest, 10-12 November, 2019*\nMoholy-Nagy University of Art and Design\n*Application deadline: 17th of June*\n\nNew digital tools provide novel opportunities for interactive digital\nnarratives (IDN) in mixed reality environments, performance art and\nanalogue immersive spaces. But does this mean that we can tell existing\nstories in a better way in these environments? Or should we change our way\nof thinking about how we perceive our world in order to create more\ncomprehensive narrative experiences? In a recent keynote (ICIDS 2018\nconference) Janet H. Murray – author of the groundbreaking volume Hamlet on\nHolodeck – the Future of Narrative in Cyberspace (1997/2016), reminds us\nthat “a kaleidoscopic habit of thinking” can help us “envision a more\nintegrated transformational future” and “open up the possibility of\nexpanding our understanding of the world and our cognitive capacity”\n(Murray, 2018:17). To better grasp the complexity of the world, it is\nimportant to enhance emerging artistic practices in order to create\nopportunities for critical reflection while acknowledging the changed\nrelationship between creators and audiences turned\nparticipants/prosumers/experiencers.\n\nThis conference aims to investigate whether XR/extended reality (VR/AR/MR)\nworks will acquire a status comparable to film, performing arts and video\ngames in the near future. On this basis, we are looking forward to papers\nthat address narrative experiences enabled by XR and especially VR\ntechnologies. Papers should address either one or several of the following\nquestions:\n\nWhat kind of narratives can be used to create possibility spaces in such\nimmersive productions?\nHow much engagement with and control over the narrative path is desirable\nfor the audience turned participants?\nWhat design strategies can guide these participatory experiences: for\nexample, live performers, orchestrators, and set designers using the\nsensorium of New Horror (see Ndalianis, 2012) or somaesthetic design\nconcepts (see Höök, 2018) to create novel forms of immersion in these\nenvironments?\nWhat kind of design strategies can we use to provide a satisfying level of\nagency to participant audiences and provide opportunities for co-creation?\nWhat is the current status of interactive digital narrative experiences,\nhave they completed their evolution from being media of attraction (see\nRouse, 2016) or there is still a long way for them to go in order to find\nthe right direction?\nWhat can we learn from a comparison of site-specific live arts productions\nwith those of VR projects?\nHow can we explore free-form play and rule-based gaming as different types\nof performances within mixed-reality theatre and immersive theatre?\n\nIn addition, we want to challenge established storytelling strategies and\ninstead more thoroughly analyze ways of creating engaging experiences:\n\nWhat kind of principles of video game design do XR productions make use of\n(e.g. puzzle dependency charts and plot-shaped level design - see Short,\n2019)?\nWhat design strategies createed the experience of full immersivity and\npresence for their users-turned-participants (see 2018/4 issue of the\njournal of Performance Arts and Digital Media).\n\nFurther developing Murray’s perspective on the ‘kaleidoscopic habit’, we\nexpect presentations that engage with the practice of transdisciplinary\ncreators to adapt video game mechanics, various sensorium settings and\ninteractive narrative design strategies in order to create fully immersive\nenvironments. Possible analyzes can be on topics such as overall aesthetics\nauthorial affordances, design principles and conventions (Koenitz et al,\n2018) as well as the audience’s experience (especially engagement and\nempowering mechanisms) and, last but not least, as interactive narratives.\nSome possible perspectives include Murray’s affordances and aesthetic\nqualities of the digital medium, Bogost’s procedural rhetoric, Kwastek’s\n“aesthetics of interactivity”, somaesthetic design concepts (Höök), guiding\nstrategies based on New Horror’s sensorium (Ndalianis, 2012) the\ntrajectories offered by them (based on Benford-Giannachi’s concept) and\ninteractive narrative systems (Koenitz, 2015).\n\n*Conference themes:*\nInteractive storytelling methods\nInteractive videos\nVideo games\nLocation-based technology (with augmented reality)\nVirtual reality experiences&movies\nAugmented reality in interactive storytelling\nGames-based performing arts practices using new technology tools\nInteractive Museum\nImmersive environments (media archeology and phenomenological approach)\nTransmedia storytelling\n\nProposals may be for a paper or a panel and should be related to at least\none of the conference themes. *Deadline for submitting the proposals is\nJune 17, 2019. Please send us your abstract (max 350 words) and a short bio\n(max. 300 words) to the address: zipscene@mome.hu <zipscene@mome.hu> and\nplease in CC: bakk@mome.hu <bakk@mome.hu>. The papers will be reviewed by\nthe conference committee. If your proposal will be accepted you will be\ngiven 20 minutes for your presentation.*\n\n\n*Registration fee: EUR 50*\nThe organizers cannot cover travel, accommodation and lodging costs. Upon\nrequest we can provide you invitation letter.\n\n\n*For Whom*\nThe conference addresses scientific researchers, game professionals,\nprogrammers, artists, scholars and professionals from the field of\nperforming arts, game studies, interactive storytellers, experience\ndesigners, narrative designers, VR-professionals and philosophers concerned\nwith the conference topics. The conference aims to bring together emerging\nscholars, professionals and creators in order to create a joint platform\nwhich would later help individuals to understand and to develop these types\nof productions.\n\n*Confirmed keynote speakers:*\nPola Borkiewicz (PL) - Institute of Psychology of the Polish Academy of\nScience&Academy of Fine Art, Warsaw\nRebecca Rouse (USA) - Rensselaer Polytechnic Institute - Troy, NY\nMathieu Triclot (FR) - University of Technology of Belfort-Montbéliard\n\n\n*Organised by:*zip-scene.com\nMoholy-Nagy University of Art and Design Budapest\n\n\n*Strategic partner:*Sapientia Hungarian University of Transylvania,\nDepartment of Film, Photography and Media\nCode and Soda Company/Random Error Studio https://randomerror.studio\nVerzio Human Rights Documentary Film Festival www.verzio.org\n\n\n*Supported by:*National Cultural Fund (NKA), International Visegrad Fund,\nWacław Felczak Foundation\nConsultant on behalf of ARDIN:\nHartmut Koenitz\n\nIf you have any further question, please don't hesitate to write me:\nbakk@mome.hu\nHope to see you here!\nBest wishes,\nÁgnes\n\n-- \n*Zip-Scene Conference on Immersive Storytelling 2019\n<http://zip-scene.mome.hu>, **November 10-12 @Moholy-Nagy University of Art\nand Design, Budapest*\n\n\n\n*Interested in performing arts&game design&new tech? Check out my blog:\nzip-scene.com <http://zip-scene.com> or for random updates follow it on\nFacebook <https://www.facebook.com/zipsceneonline/>.*\nTelefon: +36 70 383 28 47 // Skype: zoldjadviga\n\n--\nGamesnetwork, discussion list of Digital Games Research Association, www.digra.org\nNote: to unsubscribe, send \"UNSUBSCRIBE GAMESNETWORK\" to LISTSERV@UTA.FI from\nyour subscribed email account. Web interface to subscribe and manage your subscription:\nhttps://listserv.uta.fi/cgi-bin/wa?SUBED1=GAMESNETWORK&A=1 .\nThe list archive is available online at: https://listserv.uta.fi/archives/gamesnetwork.html\n<meta http-equiv=\"Content-Type\" content=\"text/html; charset=utf-8\"><div dir=\"ltr\"><div><br></div><div><b>Call for Papers for</b></div><b>II. Zip-Scene Conference on Analogue and Digital Immersive Spaces<br></b><div><b>Budapest, 10-12 November, 2019</b></div><div>Moholy-Nagy University of Art and Design<br><b>Application deadline: 17th of June</b><div><br>New digital tools provide novel opportunities for interactive digital narratives (IDN) in mixed reality environments, performance art and analogue immersive spaces. But does this mean that we can tell existing stories in a better way in these environments? Or should we change our way of thinking about how we perceive our world in order to create more comprehensive narrative experiences? In a recent keynote (ICIDS 2018 conference) Janet H. Murray – author of the groundbreaking volume Hamlet on Holodeck – the Future of Narrative in Cyberspace (1997/2016), reminds us that “a kaleidoscopic habit of thinking” can help us “envision a more integrated transformational future” and “open up the possibility of expanding our understanding of the world and our cognitive capacity” (Murray, 2018:17). To better grasp the complexity of the world, it is important to enhance emerging artistic practices in order to create opportunities for critical reflection while acknowledging the changed relationship between creators and audiences turned participants/prosumers/experiencers.<br><br>This conference aims to investigate whether XR/extended reality (VR/AR/MR) works will acquire a status comparable to film, performing arts and video games in the near future. On this basis, we are looking forward to papers that address narrative experiences enabled by XR and especially VR technologies. Papers should address either one or several of the following questions:<br><br>What kind of narratives can be used to create possibility spaces in such immersive productions?<br>How much engagement with and control over the narrative path is desirable for the audience turned participants?<br>What design strategies can guide these participatory experiences: for example, live performers, orchestrators, and set designers using the sensorium of New Horror (see Ndalianis, 2012) or somaesthetic design concepts (see Höök, 2018) to create novel forms of immersion in these environments?<br>What kind of design strategies can we use to provide a satisfying level of agency to participant audiences and provide opportunities for co-creation?<br>What is the current status of interactive digital narrative experiences, have they completed their evolution from being media of attraction (see Rouse, 2016) or there is still a long way for them to go in order to find the right direction?<br>What can we learn from a comparison of site-specific live arts productions with those of VR projects?<br>How can we explore free-form play and rule-based gaming as different types of performances within mixed-reality theatre and immersive theatre?<br><br>In addition, we want to challenge established storytelling strategies and instead more thoroughly analyze ways of creating engaging experiences:<br><br>What kind of principles of video game design do XR productions make use of (e.g. puzzle dependency charts and plot-shaped level design - see Short, 2019)?<br>What design strategies createed the experience of full immersivity and presence for their users-turned-participants (see 2018/4 issue of the journal of Performance Arts and Digital Media).<br><br>Further developing Murray’s perspective on the ‘kaleidoscopic habit’, we expect presentations that engage with the practice of transdisciplinary creators to adapt video game mechanics, various sensorium settings and interactive narrative design strategies in order to create fully immersive environments. Possible analyzes can be on topics such as overall aesthetics authorial affordances, design principles and conventions (Koenitz et al, 2018) as well as the audience’s experience (especially engagement and empowering mechanisms) and, last but not least, as interactive narratives. Some possible perspectives include Murray’s affordances and aesthetic qualities of the digital medium, Bogost’s procedural rhetoric, Kwastek’s “aesthetics of interactivity”, somaesthetic design concepts (Höök), guiding strategies based on New Horror’s sensorium (Ndalianis, 2012) the trajectories offered by them (based on Benford-Giannachi’s concept) and interactive narrative systems (Koenitz, 2015).<br><br><b>Conference themes:</b><br>Interactive storytelling methods<br>Interactive videos<br>Video games<br>Location-based technology (with augmented reality)<br>Virtual reality experiences&amp;movies<br>Augmented reality in interactive storytelling<br>Games-based performing arts practices using new technology tools<br>Interactive Museum<br>Immersive environments (media archeology and phenomenological approach)<br>Transmedia storytelling<br><br>Proposals may be for a paper or a panel and should be related to at least one of the conference themes. <b>Deadline for submitting the proposals is June 17, 2019. Please send us your abstract (max 350 words) and a short bio (max. 300 words) to the address: <a href=\"mailto:zipscene@mome.hu\">zipscene@mome.hu</a> and please in CC: <a href=\"mailto:bakk@mome.hu\">bakk@mome.hu</a>. The papers will be reviewed by the conference committee. If your proposal will be accepted you will be given 20 minutes for your presentation.</b><br><br><b>Registration fee: EUR 50<br></b><br>The organizers cannot cover travel, accommodation and lodging costs. Upon request we can provide you invitation letter.<br><br><b><br>For Whom</b><br>The conference addresses scientific researchers, game professionals, programmers, artists, scholars and professionals from the field of performing arts, game studies, interactive storytellers, experience designers, narrative designers, VR-professionals and philosophers concerned with the conference topics. The conference aims to bring together emerging scholars, professionals and creators in order to create a joint platform which would later help individuals to understand and to develop these types of productions.<br><br><b>Confirmed keynote speakers:</b><br>Pola Borkiewicz (PL) - Institute of Psychology of the Polish Academy of Science&amp;Academy of Fine Art, Warsaw<br>Rebecca Rouse (USA) - Rensselaer Polytechnic Institute - Troy, NY<br>Mathieu Triclot (FR) - University of Technology of Belfort-Montbéliard<br><br><b>Organised by:<br></b><a href=\"http://zip-scene.com\">zip-scene.com</a>&nbsp;&nbsp;<br>Moholy-Nagy University of Art and Design Budapest<br><br><b>Strategic partner:<br></b>Sapientia Hungarian University of Transylvania, Department of Film, Photography and Media<br>Code and Soda Company/Random Error Studio <a href=\"https://randomerror.studio\">https://randomerror.studio</a><br>Verzio Human Rights Documentary Film Festival <a href=\"http://www.verzio.org\">www.verzio.org</a><br><br><b>Supported by:<br></b>National Cultural Fund (NKA), International Visegrad Fund, Wacław Felczak Foundation<br>Consultant on behalf of ARDIN:<br>Hartmut Koenitz</div><div><br></div><div>If you have any further question, please don't hesitate to write me: <a href=\"mailto:bakk@mome.hu\">bakk@mome.hu</a></div><div>Hope to see you here!</div><div>Best wishes,</div><div>Ágnes<br><div><br></div>-- <br><div dir=\"ltr\" class=\"gmail_signature\" data-smartmail=\"gmail_signature\"><div dir=\"ltr\"><div><div dir=\"ltr\"><div><div dir=\"ltr\"><div dir=\"ltr\"><div dir=\"ltr\"><div dir=\"ltr\"><div><font size=\"1\"><b><a href=\"http://zip-scene.mome.hu\" target=\"_blank\"><span style=\"font-family:&quot;Times New Roman&quot;\"></span>Zip-Scene Conference on Immersive Storytelling 2019</a>,&nbsp;</b></font><b style=\"font-size:x-small\">November 10-12 @Moholy-Nagy University of Art and Design, Budapest</b></div><div><br><font size=\"1\"><b>Interested in performing arts&amp;game design&amp;new tech? Check out my blog: <a href=\"http://zip-scene.com\" target=\"_blank\">zip-scene.com</a>&nbsp;or for random updates follow it on <a href=\"https://www.facebook.com/zipsceneonline/\" target=\"_blank\">Facebook</a>.<br><br></b></font></div><div><font size=\"1\">Telefon: &#43;36 70 383 28 47 // Skype: zoldjadviga<b><br></b></font></div></div></div></div></div></div></div></div></div></div></div></div></div>\n--\nGamesnetwork, discussion list of Digital Games Research Association, <a href=\"http://www.digra.org\" target=\"_blank\">www.digra.org</a>\nNote: to unsubscribe, send &quot;UNSUBSCRIBE GAMESNETWORK&quot; to <a href=\"mailto:LISTSERV@UTA.FI\">LISTSERV@UTA.FI</a> from\nyour subscribed email account. Web interface to subscribe and manage your subscription:\n<a href=\"https://listserv.uta.fi/cgi-bin/wa?SUBED1=GAMESNETWORK&amp;A=1\" target=\"_blank\">https://listserv.uta.fi/cgi-bin/wa?SUBED1=GAMESNETWORK&amp;A=1</a> .\nThe list archive is available online at: <a href=\"https://listserv.uta.fi/archives/gamesnetwork.html\" target=\"_blank\">https://listserv.uta.fi/archives/gamesnetwork.html</a>\n",
    "attachments": []
}