{
    "subject": "[GAMESNETWORK] Call for Papers: Media Industries 2020: Global Currents and Contradictions, 16-18 April 2020, Kings College London",
    "from": "Paul McDonald <00000099c4f6f8d7-dmarc-request@uta.fi>",
    "to": "Gamesnetwork <gamesnetwork@uta.fi>",
    "cc": null,
    "bcc": null,
    "date": "Fri, 05 Jul 2019 18:18:38 +0300",
    "body": "Apologies for cross posting\n\nMedia Industries 2020: Global Currents and Contradictions\n16-18 April 2020   Kings College London\n\nFor full details including submissions, visit https://media-industries.org/\n\nSecond international Media Industries conference, hosted by the Department of Culture, Media and Creative Industries, Kings College London. \n\nFollowing the success of Media Industries: Current Debates and Future Directions (2018) we are pleased to announce the next Media Industries conference will take place in April 2020. \n\nMedia Industries 2020 (MI2020) maintains an open intellectual agenda, inviting papers, panels or workshops exploring the full breadth of media industries, in contemporary and historical contexts, and from all traditions of media industries scholarship. MI2020 will therefore provide a meeting ground for all forms of media industries research.\n\nAs a specialized focus, the 2020 conference takes Global Currents and Contradictions as its coordinating theme. In media industries scholarship, repeated attention to a few key territories, frequently but not exclusively located in the Global North, has concentrated but also limited the scope of the field. In choosing the theme Global Currents and Contradictions, we are therefore particularly interested in receiving submissions engaging with industries, contexts and bodies of research that represent, extend or challenge the geographic reach of the field. To headline this theme, a programme of keynote speakers will be announced in due course.\n\nPARTNERS\nA core aim of the Media Industries conference is to bring together scholars researching media industries from across multiple professional associations and their relevant sub-groups or sections. \n\nThe Department of Culture, Media and Creative Industries at Kings College London is therefore very pleased to be organizing MI2020 in partnership with:\n\tBritish Association of Film, Television and Screen Studies (BAFTSS) - Screen Industries Special Interest Group\n\tEuropean Communication Research and Education Association (ECREA) - Media Industries and Cultural Production Section\n\tEuropean Media Management Association (EMMA)\n\tEuropean Network for Cinema and Media Studies (NECS) - Screen Industries Work Group\n\tGesellschaft fr Medienwissenschaft (GFM) - AG Medienindustrien\n\tGlobal Media and China journal\n\tInternational Association for the Study of Popular Music (IASPM)\n\tInternational Association of Mass Communication Research (IAMCR) - Media Production Analysis Working Group\n\tInternational Communication Association (ICA) - Media Industry Studies Interest Group\n\tMedia Industries journal\n\tSociety for Cinema and Media Studies (SCMS) - Media Industries Scholarly Interest Group\n\tSouth Asia Communication Association (SACA)\n\nHOST COMMITTEE\nFor Kings College London: Sarah Atkinson, Bridget Conor, Virginia Crisp, Sonal Kantaria (conference administrator), Wing-Fai Leung, Paul McDonald (conference chair), Jeanette Steemers and Jaap Verheul\n\nADVISORY COMMITTEE\nDeb Aikat, Courtney Brannon Donoghue, Hanne Bruun , Evan Elkins, Elizabeth Evans, Tom Evens, Franco Fabbri, Anthony Fung, David Hesmondhalgh, Catherine Johnson, Derek Johnson, Ramon Lobato, Skadi Loist, Amanda Lotz, Alfred Martin, Jack Newsinger, Sora Park, Alisa Perren, Steve Presence, Roel Puijk, Willemien Sanders, Kevin Sanson, Fawad Shah, Andrew Spicer, Petr Szczepanik, Harsh Taneja, Patrick Vonderau\n\nREGISTRATION\nRegistration for the conference will go live in mid-November 2019. Fees will be published then and will be tiered according to the delegates country of residence using the World Banks country classifications by Gross National Income per capita.\n\nSUBMISSIONS\n\nDeadline\nSubmissions will be accepted up to 23.00hrs British Summer Time (BST) 16 September 2019 (please note: BST is Coordinated Universal Time (UTC) + 1 hour)\n\nSubmission Categories\nSubmissions are welcomed in three categories.\n\ni.\tOpen Call Papers\nFormat: solo or co-presented research paper lasting no more than 20mins.\n\nii.\tPre-constituted Panels\nFormat: 90mins panel of 3 x 20mins OR 4 x 15mins thematically linked solo or co-presented research papers followed by questions.\n\niii.\tPre-constituted Workshops\nFormat: 90mins interactive forum led by 4 to 6 x 6mins thematically linked informal presentations. Led by a chair or co-chairs, workshops adopt a roundtable format bringing together 4 to 6 speakers to offer short (up to 6 minute) position statements or interventions designed to trigger discussions around a central theme, issue, or problem. As such, the workshop does not involve the presentation of formal research papers, but rather is designed to create a forum for the speakers and the audience to engage in a shared discussion. The workshop format is flexible and can be adapted to allow the chair or co-chairs to introduce exercises or other activities where appropriate. \n\nDelegates can make TWO contributions to the conference but only ONE in any category, i.e. presenting an open call paper and participating in a workshop will be permitted but presenting two open call papers will not be. Chairing a panel or organizing a workshop will NOT count as a contribution.\n\nTo submit, please go to https://media-industries.org/2020-call-for-papers\n\n--\nGamesnetwork, discussion list of Digital Games Research Association, www.digra.org\nNote: to unsubscribe, send \"UNSUBSCRIBE GAMESNETWORK\" to LISTSERV@UTA.FI from\nyour subscribed email account. Web interface to subscribe and manage your subscription:\nhttps://listserv.uta.fi/cgi-bin/wa?SUBED1=GAMESNETWORK&A=1 .\nThe list archive is available online at: https://listserv.uta.fi/archives/gamesnetwork.html\n",
    "attachments": []
}