{
    "subject": "[GAMESNETWORK] Call for Papers - Audio Mostly 2019 - DEADLINE EXTENDED 24th of June (final)",
    "from": "Konstantinos Papangelis <0000008fb7a34d9f-dmarc-request@uta.fi>",
    "to": "Gamesnetwork <gamesnetwork@uta.fi>",
    "cc": null,
    "bcc": null,
    "date": "Tue, 18 Jun 2019 04:39:31 +0300",
    "body": "Call for Papers - Audio Mostly 2019 - DEADLINE EXTENDED 24th of June (final)\n\nThe Audio Mostly (www.audiomostly.com) conference series is interested in sound Interaction Design & Human-Computer Interaction (HCI) in general. Audio Mostly will take place from the 18th to 20th of September 2019 at the University of Nottingham in the city of Nottingham in the UK. The conference provides a space to reflect on the role of sound/music in our lives and how to understand, develop and design systems which relate to sound and music. The special theme for the conference this year is ‘A Journey in Sound’. This year the theme of the conference is open to interpretation, but people might think about the following, in relation to the theme:\n\n•             Gamic sonic experiences\n•             Sonic aspects of digital stories, documentaries and archives\n•             The soundtrack to our lives. Archiving and sharing sound\n•             The emotional potential of a sound, how might this be used to support interaction\n•             The different uses of sound and music across different settings\n•             The re-use of recollections and memories by composers and sound designers\n•             The development of musical tools that can let us express our experiences over time\n•             Socio-technical uses of AI create highly personalised soundtracks that respond to one’s context\n•             Adaptive sound and music use in journeys, time and the creative use of data\n\nWe encourage original regular papers (oral/poster presentation) addressing the conference theme or other topics from the list provided below. We welcome multidisciplinary approaches involving fields such as music informatics, information and communication technologies, sound design, music performance, visualisation, composition, perception/cognition and aesthetics.\n\n•             Accessibility\n•             Aesthetics\n•             Affective computing applied to sound/music\n•             AI, HCI and Music\n•             Acoustics and Psychoacoustics\n•             Auditory display and sonification\n•             Augmented and virtual reality with or for sound and music\n•             Computational musicology\n•             Critical approaches to interaction, design and sound\n•             Digital augmentation (e.g. musical instruments, stage, studio, audiences, performers, objects)\n•             Digital music libraries\n•             Ethnographic studies\n\nFor more information and other topics please see: https://audiomostly.com/2019/call/cfp/\nThe Audio Mostly 2019 proceedings will be published by the Association for Computing Machinery (ACM) (awaiting approval) and made available through their digital library. Regular papers, posters and demos/installations will be double-blind peer reviewed. It is envisaged that there will be a special issue of a journal relating to the conference, as with previous years.\n\nDates \n\n•             Submission Deadline: 24th of June (final)\n•             Acceptance: Mid to Late July 2019\n•             Camera Ready: Mid  August 2019\n•             Conference: 18th to 20th of September at the University of Nottingham in the city of Nottingham in the UK\n\nSubmission Site\n\n•             https://easychair.org/conferences/?conf=am2019\n\nContact\n\nFor more information or questions, please contact either Konstantinos Papangelis at k.papangelis@liverpool.ac.uk or the Paper and Poster Chairs: Adrian Hazzard – adrian.hazzard@nottingham.ac.uk Elizabeth Kelly –elizabeth.kelly@nottingham.ac.uk\n\n--\nGamesnetwork, discussion list of Digital Games Research Association, www.digra.org\nNote: to unsubscribe, send \"UNSUBSCRIBE GAMESNETWORK\" to LISTSERV@UTA.FI from\nyour subscribed email account. Web interface to subscribe and manage your subscription:\nhttps://listserv.uta.fi/cgi-bin/wa?SUBED1=GAMESNETWORK&A=1 .\nThe list archive is available online at: https://listserv.uta.fi/archives/gamesnetwork.html\n",
    "attachments": []
}