{
    "subject": "[GAMESNETWORK] Deadline for \"Play, Games, Mental Health\" -- The Young Academics Workshop at the Clash of Realities 2019 coming up",
    "from": "Federico Alvarez <fedealvarezi@GMAIL.COM>",
    "to": "Gamesnetwork <gamesnetwork@uta.fi>",
    "cc": null,
    "bcc": null,
    "date": "Sun, 28 Jul 2019 11:39:40 +0200",
    "body": "Dear all,\n\nThe deadline for submitting papers to the Young Academics Workshop at the\nClash of Realities 2019 is approaching. There is time until Wednesday, July\n31.\n\nThis year's workshop will focus on \"Play, Games, Mental Health\" and will\ncount with the presence of Isabela Granic as guest scholar. You can find\nthe CfP with more details below.\n\nWe look forward to your submissions!\nThe YAW team\n\n--\n\nCall For Papers\n\n\n*PLAY, GAMES, MENTAL HEALTH*The Young Academics Workshop at the Clash of\nRealities Conference\n\nTuesday, November 19, 2019\n\n*Guest Scholar:* Isabela Granic (Radboud University, GEMH lab)\n*Committee:* Su-Jin Song (CGL), Michael S. Debus (ITU), Curtis Maughan\n(Vanderbilt), Federico Alvarez Igarzbal (IGPP)\n\nOrganized by the Cologne Game Lab, TH Kln  University of Applied Sciences\n(Germany) in cooperation with IT University of Copenhagen (Denmark),\nVanderbilt University (USA), and the Institute for Frontier Areas of\nPsychology and Mental Health (IGPP, Germany).\n\nThis year, the Young Academics Workshop will explore the connection between\nmental health and the act of play, whether it is free or structured by\nrules. We want to discuss claims that play and games, or a lack thereof,\ncan have a significant impact on our psychological well-being; the\npotential of play to treat psychopathologies; and the numerous technical\nand artistic ways in which play can represent or reflect a spectrum of\npsychological states, among other topics.\n\nVideo games tend to be a matter of social concern, especially among parents\nand educators who often pose questions like: Are kids gaming too much? How\nmuch is too much? What consequences can excessive gaming have on an\nindividuals development? Current claims about video game addiction and\nrelated disorders notwithstanding, research on the effects of video games\non mental health is still inconclusive. Despite this persisting gap in our\nknowledge, the medium is often blamed for making players antisocial,\naddicted, or depressed. At the same time, arguments for the possible\nbenefits of gaming are put forward with lesser frequency. This might come\nas a surprise when we consider that many contemporary titles deal directly\nwith mental health issues, such as depression (*Depression Quest*),\ngrief (*That\nDragon, Cancer*), and psychosis (*Hellblade: Senuas Sacrifice*).\n\nThe Young Academics Workshops aim in 2019 is to discuss mental health and\nplay from a wide range of perspectives. Since video games are not an\nisolated phenomenon, the workshop will frame the issue broadlyincluding\nfree play, and both analog and digital gameswhile paying attention to the\nways in which these activities, or an absence thereof, might impact mental\nhealth.\n\nWe are happy to announce that Isabela GranicProfessor and Chair of the\nDevelopmental Psychopathology department at Radboud University (the\nNetherlands) and director of the GEMH (Games for Emotion and Mental Health)\nLabwill be joining this years workshop. Granics groundbreaking work\nintegrates psychological research with game design to create games to treat\nand study psychopathologies such as depression and anxiety. With her unique\nexpertise, Granic will accompany us in a day of stimulating discussion and\nclose the workshop with a talk.\n\nPossible submission topics *might include*, but are *not limited to*:\n\n- The impact of play in child and adolescent development\n- Video games and addiction\n- Gamification of mental health treatments\n- Digital and analog games as therapy\n- Representations of mental disorders in games and play\n- Game design as a way to cope with mental or emotional strain\n\nWe welcome contributions from scholars from all academic fields and\ndisciplines (psychology, media studies, art history, philosophy,\nneuroscience, play and game studies, etc.) and from game developers and\ngame development students (future game artists, game designers, game\nprogrammers, and all other students learning to make games). As this is a\nYoung Academics Workshop, we invite all those who have recently entered the\nacademic world, including Bachelor, Master, and PhD students, as well as\nPostdocs.\n\nApplicants should focus on the relationship between play, games, and mental\nhealth from the unique perspective of their home discipline.\n\nParticipants will hold 15-minute presentations followed by 15 minutes of\ndiscussion.\n\nApplicants should submit abstracts (no longer than 300 words) along with a\nbibliography/ludography to youngacademics@clashofrealities.com\n\nAll submissions will be assessed by a peer-review committee.\n\n*IMPORTANT DATES*\nDeadline for submissions: July 31\nNotification of acceptance/rejection: September 7\nYoung Academics Workshop: November 19\nClash of Realities Conference: November 19-21\n\n*CONTACT*\nyoungacademics@clashofrealities.com\n\nFor more information on the Clash of Realities Conference visit\nhttp://www.colognegamelab.de/research/clash-of-realities-conference/\n\n--\nGamesnetwork, discussion list of Digital Games Research Association, www.digra.org\nNote: to unsubscribe, send \"UNSUBSCRIBE GAMESNETWORK\" to LISTSERV@UTA.FI from\nyour subscribed email account. Web interface to subscribe and manage your subscription:\nhttps://listserv.uta.fi/cgi-bin/wa?SUBED1=GAMESNETWORK&A=1 .\nThe list archive is available online at: https://listserv.uta.fi/archives/gamesnetwork.html\n<meta http-equiv=\"Content-Type\" content=\"text/html; charset=utf-8\"><div dir=\"ltr\">Dear all,<div><br></div><div>The deadline for submitting papers to the Young Academics Workshop at the Clash of Realities 2019 is approaching. There is time until Wednesday, July 31.&nbsp;</div><div><br></div><div>This year's workshop will focus on &quot;Play, Games, Mental Health&quot; and will count with the presence of Isabela Granic as guest scholar. You can find the CfP with more details below.</div><div><br></div><div>We look forward to your submissions!</div><div>The YAW team<br></div><div><br></div><div>--</div><div><br></div><div><div><div>Call For Papers</div><div><br></div><div><b>PLAY, GAMES, MENTAL HEALTH<br></b>The Young Academics Workshop at the Clash of Realities Conference<br></div><div><br></div><div>Tuesday, November 19, 2019<br><br></div><div><b>Guest Scholar:</b>&nbsp;Isabela Granic (Radboud University, GEMH lab)<br><b>Committee:</b>&nbsp;Su-Jin Song (CGL), Michael S. Debus (ITU), Curtis Maughan (Vanderbilt), Federico Alvarez Igarzbal (IGPP)<br><br></div><div>Organized by the Cologne Game Lab, TH Kln  University of Applied Sciences (Germany) in&nbsp;cooperation with IT University of Copenhagen (Denmark), Vanderbilt University (USA), and the Institute for Frontier Areas of Psychology and Mental Health (IGPP, Germany).&nbsp;&nbsp;<br></div><div><br>This year, the Young Academics Workshop will explore the connection between mental health and the act of play, whether it is free or structured by rules. We want to discuss claims that play and games, or a lack thereof, can have a significant impact on our psychological well-being; the potential of play to treat psychopathologies; and the numerous technical and artistic ways in which play can represent or reflect a spectrum of psychological states, among other topics.</div><div><br>Video games tend to be a matter of social concern, especially among parents and educators who often pose questions like: Are kids gaming too much? How much is too much? What consequences can excessive gaming have on an individuals development?&nbsp;Current claims about video game addiction and related disorders notwithstanding, research on the effects of video games on mental health is still inconclusive. Despite this persisting gap in our knowledge, the medium is often blamed for making players antisocial, addicted, or depressed. At the same time, arguments for the possible benefits of gaming are put forward with lesser frequency. This might come as a surprise when we consider that many contemporary titles deal directly with mental health issues, such as depression (<i>Depression Quest</i>), grief (<i>That Dragon, Cancer</i>), and psychosis (<i>Hellblade: Senuas Sacrifice</i>).</div><div><br>The Young Academics Workshops aim in 2019 is to discuss mental health and play from a wide range of perspectives. Since video games are not an isolated phenomenon, the workshop will frame the issue broadlyincluding free play, and both analog and digital gameswhile paying attention to the ways in which these activities, or an absence thereof, might impact mental health.</div><div><br>We are happy to announce that Isabela GranicProfessor and Chair of the Developmental Psychopathology department at Radboud University (the Netherlands) and director of the GEMH (Games for Emotion and Mental Health) Labwill be joining this years workshop. Granics groundbreaking work integrates psychological research with game design to create games to treat and study psychopathologies such as depression and anxiety. With her unique expertise, Granic will accompany us in a day of stimulating discussion and close the workshop with a talk.</div><div><br>Possible submission topics&nbsp;<b>might include</b>, but are&nbsp;<b>not limited to</b>:</div><div><br>- The impact of play in child and adolescent development<br>- Video games and addiction<br>- Gamification of mental health treatments<br>- Digital and analog games as therapy<br>- Representations of mental disorders in games and play<br>- Game design as a way to cope with mental or emotional strain</div><div><br>We welcome contributions from scholars from all academic fields and disciplines (psychology, media studies, art history, philosophy, neuroscience, play and game studies, etc.) and from game developers and game development students (future game artists, game designers, game programmers, and all other students learning to make games). As&nbsp;this is a Young Academics Workshop, we invite all those who have recently entered the academic world, including Bachelor, Master, and PhD students, as well as Postdocs.</div><div><br>Applicants should focus on the relationship between play, games, and mental health from the unique perspective of their home discipline.</div><div><br>Participants will hold 15-minute presentations followed by 15 minutes of discussion.<br><br></div><div>Applicants should submit abstracts (no longer than 300 words) along with a bibliography/ludography to&nbsp;<a href=\"mailto:youngacademics@clashofrealities.com\" target=\"_blank\">youngacademics@clashofrealities.com</a></div><div><br>All submissions will be assessed by a peer-review committee.<br><br></div><div><b>IMPORTANT DATES</b></div><div>Deadline for submissions: July 31<br>Notification of acceptance/rejection: September 7<br>Young Academics Workshop: November 19<br>Clash of Realities Conference: November 19-21</div><div><br><b>CONTACT</b><br><a href=\"mailto:youngacademics@clashofrealities.com\" target=\"_blank\">youngacademics@clashofrealities.com</a>&nbsp;<br></div></div><div><br></div><div>For more information on the Clash of Realities Conference visit&nbsp;<a href=\"http://www.colognegamelab.de/research/clash-of-realities-conference/\" target=\"_blank\">http://www.colognegamelab.de/research/clash-of-realities-conference/</a></div><div class=\"gmail-yj6qo\"></div><div class=\"gmail-adL\"><br></div><div class=\"gmail-adL\"><br></div></div></div>\n--\nGamesnetwork, discussion list of Digital Games Research Association, <a href=\"http://www.digra.org\" target=\"_blank\">www.digra.org</a>\nNote: to unsubscribe, send &quot;UNSUBSCRIBE GAMESNETWORK&quot; to <a href=\"mailto:LISTSERV@UTA.FI\">LISTSERV@UTA.FI</a> from\nyour subscribed email account. Web interface to subscribe and manage your subscription:\n<a href=\"https://listserv.uta.fi/cgi-bin/wa?SUBED1=GAMESNETWORK&amp;A=1\" target=\"_blank\">https://listserv.uta.fi/cgi-bin/wa?SUBED1=GAMESNETWORK&amp;A=1</a> .\nThe list archive is available online at: <a href=\"https://listserv.uta.fi/archives/gamesnetwork.html\" target=\"_blank\">https://listserv.uta.fi/archives/gamesnetwork.html</a>\n",
    "attachments": []
}