{
    "subject": "[GAMESNETWORK] G|A|M|E - Call For Papers N.8 - Would you kindly?: Claiming Video Game Agency as Interdisciplinary Concept - DEADLINE 19 Jul 2019",
    "from": "Ivan Girina <ivan.girina@BRUNEL.AC.UK>",
    "to": "Gamesnetwork <gamesnetwork@uta.fi>",
    "cc": null,
    "bcc": null,
    "date": "Thu, 30 May 2019 19:23:11 +0300",
    "body": "Dear all, \n\nPlease find below the new Call For Papers for G|A|M|E - Games as Art, Media, Entertainment\n\nExtended Abstract deadline: 19th of July 2019\n\nWould you kindly?: Claiming Video Game Agency as Interdisciplinary Concept\n(https://www.gamejournal.it/n-8-2019-would-you-kindly-claiming-video-game-agency-as-interdisciplinary-concept/)\n\nThe new issue of G|A|M|E proposes a re-examination of the concept of agency in games. We welcome contributions that address the idea of agency from a variety of academic perspectives, taking into account its interdisciplinary history and application, in order to expand our critical understanding of the concept more broadly. We therefore invite scholars from all fields to reflect on different notions of agency, not only in relation to physical and digital games, but also to other media and art forms as they impact on games and game studies. At the end of the influential first-person shooter Bioshock (2K Games, 2007), its critique of the rhetoric of choice and freedom emerges from the dialogue between the protagonist Jack and the visionary despot of Rapture, Andrew Rayan. Rayan's seemingly innocent question Would You Kindly? conceals a cognitive trigger that casts a shadow over the protagonist's actions. By shattering the illusion of free will for both character and play!\n er, the game breaks the fourth wall and confronts the user with the question: who is being/has been controlled?\n\nAlready central to the fields of Human-Computer Interaction as well as that of design (e.g. Sherry Turkle, 1984; Brenda Laurel, 1991), agency was redefined more than twenty years ago in Janet Murray's seminal volume Hamlet on the Holodeck (1996, p. 123) as the satisfying power to take meaningful action and see the results of our decisions and choices. To this day, the concept of agency is still prominent in scholarly debates on video game and game design: to describe a key ontological category that delineates the multiplicity of paths as well as the breadth of choices made available by interactive texts; and also closer to Murrays acceptation to define a primary category of video game aesthetics, a textual effect attached to the pleasure of taking meaningful decisions within virtual environments.\n\nOn one level, agency informs media objects, texts and devices. Agency can be observed in relation to old and new game genres (adventure games with branching narratives, interactive movies, sandbox and open-world games); degrees of agency are provided by the affordances of VR/AR and mixed reality technologies (Oculus, PlayStationVR, HoloLens etc.); forms of agency are conceptualised across diverse media and art forms (interactive design, experimental film, on- demand TV, experiential theatre, museum installations) as well as in physical and digital hypertexts (Choose You Own Adventure books); agency is reallocated through new modes of distribution and fruition (VoD, streaming platforms and digital piracy); and agency is also embedded in sub-cultural practices and products (machinima, fan-fiction etc.).\n\nOn another level, agency is crucial to debating conceptual categories relevant to interactive digital media. Digital artefacts are immersed in a cross- and trans-media landscape, in which the interface constantly brings into question the relationship between objects, developers and users, blurring the boundaries between authors and audiences and questioning the sovereignty over these objects on multiple fronts. Here, agency provides an opening to explore aesthetic, social and political tensions (gender, race, class), and can be used to analyse discourses that challenge the role of the spectator/reader/player in relation to media object and their creators (art and exhibition, authorship, fandom, prosumer culture).\n\nWith its eighth issue, G|A|M|E wants to investigate the agency afforded by games, software and interfaces, as well as the agency claimed by players, users and spectators. Exceeding Murrays original aesthetic understanding of the term, we intend to expand our examination of agency within and beyond the virtual borders of game studies. Agency is, in fact, a pivotal concept in philosophy, adopted to address relations of intentionality and causality between actors and actions (e.g. Anscombe, 1957; Davidson, 1963); as well as in social sciences, which locate agency within material and immaterial networks between human and non-human agents (Latour, 2005). In light of the vast interdisciplinary history of this concept, we seek contributions that can productively inform and renew our understandings of agency in gaming and play, while also using game agency to inform larger political, philosophical and cultural issues, developing current critical debates in game studies and in oth!\n er disciplines.\n\nTopics may include:\n\n\tagency in game studies\n\tagency and gaming technologies (VR, AR, mixed reality)\n\tagency and interactivity\n\tagency in video game criticism\n\tclose textual analysis of games in relation to agency\n\tplayer reception and agency: modding, fandom etc.\n\tagency in traditional games: board games, sports etc.\n\tvideo game agency and issues of authorship\n\tagency as interdisciplinary concept, from games to: arts, social sciences, law and philosophy\n\tgame agency in relation to other cultural forms (experimental film, cinema, art, architecture, design)\n\tagency and non-linear textuality\n\tpolitics (race, class, sexuality, gender, geopolitics) and video game agency\n\tagency and media ecologies\n\nScholars are invited to submit an extended abstract (between 500-1,000 words excluding references) or full papers by Friday the 19th of July, 2019 to editors@gamejournal.it \n\nExtended Abstract deadline: 19th of July 2019; Notification of acceptance: 25th of July 2019 \n\nAll accepted authors will be asked to submit the full paper by the 15th of October 2019. We expect to release this issue in Winter 2019\n\nEditors: Ivan Girina (Brunel University London), Berenike Jung (University of Tbingen)\n\n                      \nDr. Ivan Girina\nLecturer in Game Studies\nBrunel University London\nUxbridge,Middlesex\nUB8 3PH\nemail: ivan.girina@brunel.ac.uk\n\n--\nGamesnetwork, discussion list of Digital Games Research Association, www.digra.org\nNote: to unsubscribe, send \"UNSUBSCRIBE GAMESNETWORK\" to LISTSERV@UTA.FI from\nyour subscribed email account. Web interface to subscribe and manage your subscription:\nhttps://listserv.uta.fi/cgi-bin/wa?SUBED1=GAMESNETWORK&A=1 .\nThe list archive is available online at: https://listserv.uta.fi/archives/gamesnetwork.html\n",
    "attachments": []
}