{
    "subject": "[GAMESNETWORK] ICIDS Doctoral Consortium Submission Deadline Extended",
    "from": "Benjamin Michael Samuel <bsamuel@CS.UNO.EDU>",
    "to": "Gamesnetwork <gamesnetwork@uta.fi>",
    "cc": null,
    "bcc": null,
    "date": "Fri, 02 Aug 2019 19:20:08 +0000",
    "body": "ICIDS Doctoral Consortium Submission Deadline Extended to August 16th\n\nAre you a PhD student interested in interactive digital storytelling? Are you looking to receive guidance or feedback on your dissertation topic from the interactive storytelling community-at-large? Consider submitting to the ICIDS Doctoral Consortium!\n\nICIDS is the premier conference for researchers and practitioners concerned with studying digital interactive forms of narrative from a variety of perspectives, including theoretical, technological, and applied design lenses. The annual conference is an interdisciplinary gathering that combines technology-focused approaches with humanities-inspired theoretical inquiry, empirical research and artistic expression.\n\nThe Doctoral Consortium is an opportunity for PhD students in areas related with the topics of ICIDS to present their research work, at a stage where feedback from the community might be beneficial. Students will discuss the work with experts in the area and with peers in a friendly atmosphere where discussion and contributions will be encouraged. Students should have defined their research plan, and can be in intermediate or advanced stages of their research. Regardless of how far along the students are in their research, the work should still be in-progress and malleable enough to take advantage of the feedback from the Doctoral Consortium.\n\nThe deadline for DC submissions has been extended to August 16th. The ICIDS website https://icids.eae.utah.edu/ will reflect this change soon.\n\nSubmission\n\nDC Submissions can be completed through EasyChair at the following link:  easychair.org/conferences/?conf=icids2019\n\nLog in to EasyChair (or create an account if you havent yet), and then create a new submission under the Doctoral Consortium track. Youll then be prompted to upload the following the files:\n\n1.) A short paper (max 4 pages in the Lecture Notes in Computer Science (LNCS) Format) describing the research work, results, status and next steps. The paper will be published in the proceedings. LNCS templates can be downloaded here under the section Templates, Sample Files, and Useful Links https://www.springer.com/us/computer-science/lncs/conference-proceedings-guidelines\n\n2.) A CV of the PhD candidate (1-2 pages)\n\n3.) A letter from the supervisor addressing the benefits of participating in the Doctoral Consortium at this stage of the research work (1 page). If supervisors prefer, these may be submitted independently from the rest of the submission. Please e-mail to bsamuel (at) cs.uno.edu, making sure to include the name of the student and ICIDS 2019 DC supervisor letter in the subject line.\n\n4.) You will also be asked to answer a number of questions to help us pair you with a mentor relevant to your interests and aspirations.\n\nAccepted submissions will be distributed to all participants in order to prepare for the discussions during the Doctoral Consortium sessions. Additional information about how to prepare for the Doctoral Consortium will be provided following acceptance.\n\n\nImportant Dates\n\n*Doctoral consortium submission deadline *extended*: August 1st, August 16th, 2019\n*Notification of acceptance: August 27th, 2019.\n*Camera ready: September 13th, 2019.\n*Doctoral Consortium: Throughout the conference (November 19th - November 23rd)\n\nDoctoral Consortium Chair\nBen Samuel (University of New Orleans, US)\n\nContact Information\nIf you have further questions, please contact: bsamuel (at) cs.uno.edu\n\n\n\n\nBen Samuel, Ph.D.\n\nAssistant Professor of Computer Science\n\nDept. of Computer Science\nMathematics Building, Room 339\n2000 Lakeshore Drive\nNew Orleans, LA 70148\n\nOffice 504.280.4435\n\nNOTICE: This message, including all attachments transmitted with it, is intended solely for the use of the Addressee(s) and may contain information that is PRIVILEGED, CONFIDENTIAL, and/or EXEMPT FROM DISCLOSURE under applicable law. If you are not the intended recipient, you are hereby notified that any disclosure, copying, distribution, or use of the information contained herein is STRICTLY PROHIBITED. If you received this communication in error, please destroy all copies of the message, whether in electronic or hard copy format, as well as attachments and immediately contact the sender by replying to this email or contact the sender at the telephone numbers listed above. Thank you!\n\n--\nGamesnetwork, discussion list of Digital Games Research Association, www.digra.org\nNote: to unsubscribe, send \"UNSUBSCRIBE GAMESNETWORK\" to LISTSERV@UTA.FI from\nyour subscribed email account. Web interface to subscribe and manage your subscription:\nhttps://listserv.uta.fi/cgi-bin/wa?SUBED1=GAMESNETWORK&A=1 .\nThe list archive is available online at: https://listserv.uta.fi/archives/gamesnetwork.html\n\n\n\n\n\n\n\n\nICIDS Doctoral Consortium Submission Deadline Extended to August 16th\n\n\n\n\nAre you a PhD student interested in interactive digital storytelling? Are you looking to receive guidance or feedback on your dissertation topic from the interactive storytelling community-at-large? Consider submitting to the ICIDS Doctoral Consortium! \n\n\n\n\nICIDS is the premier conference for researchers and practitioners concerned with studying digital interactive forms of narrative from a variety of perspectives, including theoretical, technological, and applied design lenses. The annual conference is an interdisciplinary\n gathering that combines technology-focused approaches with humanities-inspired theoretical inquiry, empirical research and artistic expression.  \n\n\n\n\nThe Doctoral Consortium is an opportunity for PhD students in areas related with the topics of ICIDS to present their research work, at a stage where feedback from the community might be beneficial. Students will discuss the work with experts in the area and\n with peers in a friendly atmosphere where discussion and contributions will be encouraged. Students should have defined their research plan, and can be in intermediate or advanced stages of their research. Regardless of how far along the students are in their\n research, the work should still be in-progress and malleable enough to take advantage of the feedback from the Doctoral Consortium.\n\n\n\n\nThe deadline for DC submissions has been extended to August 16th. The ICIDS website\nhttps://icids.eae.utah.edu/ will reflect this change soon.\n\n\n\n\nSubmission\n\n\n\n\nDC Submissions can be completed through EasyChair at the following link: easychair.org/conferences/?conf=icids2019\n\n\n\n\nLog in to EasyChair (or create an account if you havent yet), and then create a new submission under the Doctoral Consortium track. Youll then be prompted to upload the following the files:\n\n\n\n\n1.) A short paper (max 4 pages in the Lecture Notes in Computer Science (LNCS) Format) describing the research work, results, status and next steps. The paper will be published in the proceedings. LNCS templates can be downloaded here under the section Templates,\n Sample Files, and Useful Links https://www.springer.com/us/computer-science/lncs/conference-proceedings-guidelines\n\n\n\n\n2.) A CV of the PhD candidate (1-2 pages)\n\n\n\n\n3.) A letter from the supervisor addressing the benefits of participating in the Doctoral Consortium at this stage of the research work (1 page). If supervisors prefer, these may be submitted independently from the rest of the submission. Please e-mail to bsamuel\n (at) cs.uno.edu, making sure to include the name of the student and ICIDS 2019 DC supervisor letter in the subject line.\n\n\n\n\n4.) You will also be asked to answer a number of questions to help us pair you with a mentor relevant to your interests and aspirations.\n\n\n\n\nAccepted submissions will be distributed to all participants in order to prepare for the discussions during the Doctoral Consortium sessions. Additional information about how to prepare for the Doctoral Consortium will be provided following acceptance. \n\n\n\n\n\n\n\nImportant Dates\n\n\n\n\n*Doctoral consortium submission deadline *extended*: August 1st, August 16th, 2019\n\n*Notification of acceptance: August 27th, 2019.\n\n*Camera ready: September 13th, 2019.\n\n*Doctoral Consortium: Throughout the conference (November 19th - November 23rd)\n\n\n\n\nDoctoral Consortium Chair\n\nBen Samuel (University of New Orleans, US)  \n\n\n\n\nContact Information\n\nIf you have further questions, please contact: bsamuel (at) cs.uno.edu\n\n\n\n\n\n\n\n\nBen Samuel, Ph.D.\n\nAssistant Professor of Computer Science\n\nDept. of Computer Science\nMathematics Building, Room\n 339\n2000 Lakeshore Drive\nNew Orleans, LA 70148\n\nOffice 504.280.4435 \n\n\n\n\n\nNOTICE: This message, including all attachments transmitted with it, is intended solely for the use of the Addressee(s) and may contain information that is PRIVILEGED, CONFIDENTIAL, and/or EXEMPT FROM DISCLOSURE under applicable law. If you are not the intended\n recipient, you are hereby notified that any disclosure, copying, distribution, or use of the information contained herein is STRICTLY PROHIBITED. If you received this communication in error, please destroy all copies of the message, whether in electronic or\n hard copy format, as well as attachments and immediately contact the sender by replying to this email or contact the sender at the telephone numbers listed above. Thank you!\n\n\n--\nGamesnetwork, discussion list of Digital Games Research Association, www.digra.org\nNote: to unsubscribe, send \"UNSUBSCRIBE GAMESNETWORK\" to LISTSERV@UTA.FI from\nyour subscribed email account. Web interface to subscribe and manage your subscription:\nhttps://listserv.uta.fi/cgi-bin/wa?SUBED1=GAMESNETWORK&A=1 .\nThe list archive is available online at: https://listserv.uta.fi/archives/gamesnetwork.html\n",
    "attachments": []
}