{
    "subject": "[GAMESNETWORK] [Call for Paper] ACM Symposium on Applied Perception 2019",
    "from": "Ludovic Hoyet <ludovic.hoyet@INRIA.FR>",
    "to": "Gamesnetwork <gamesnetwork@uta.fi>",
    "cc": null,
    "bcc": null,
    "date": "Tue, 30 Apr 2019 12:23:04 +0200",
    "body": "\n\nACM Symposium on Applied Perception \n\n Call for papers and posters  \n\n\n\n\nReminder: paper submission deadline on May 21st \n\n\n\n\nThe ACM Symposium on Applied Perception (ACM SAP) provides an intimate , immersive forum for researchers who combine knowledge, methods, and insights from perception research andcomputer science disciplines. This explicitly includes such disciplines as cognitive psychology, perceptual psychology, psychophysics, behavior-analysis, and neuroscience on the perceptual side and computer graphics, computer vision, visualization, and human-computer interfaces on the visual computing side to name just a few! The interdisciplinary focus of this conference explicitly acknowledges that the various scientific disciplines in perception research and computer science research use different but complementary methods to address fundamentally similar questions. As such, combinations of knowledge, methods, and/or insights from the different fields can help to advance all of the applied perception fields. \n\n\n\n\nACM SAP 2019 will be held in Barcelona, Spain on the 19th and 20th of September, 2019. We invite submissions of original work in all areas of applied perception, regardless of sensory modality (vision, haptics, acoustics, proprioception, etc.). The focus of the work can be either perceptual or computational, but each submission must  as always  include elements of both perception and visual computing.Relevant approaches include: \n\n\n\n\n application of perceptual research to any area of computer science , including: \n\n    * modeling, rendering, animation; \n    * virtual environments, characters; \n    * processing information from artificial sensors; \n    * representation of data, communication of data; \n\n\n\n applications of computer science to any area of perception , such as: \n\n    * modeling natural perceptual systems; \n    * simulating natural perceptual systems; \n    * systematic study of natural perceptual systems. \n\n\n\n\n\nPapers \n\nResearch can be submitted as long paper (up to 8 pages) or as a short paper (up to 4 pages). In all cases the page limit is EXCLUSIVE of the pages devoted to bibliographic references and appendices. Authors are explicitly encouraged to include a full citation list. All submissions should follow the general [ http://www.siggraph.org/learn/instructions-authors | SIGGRAPH formatting guidelines ] Please submit all papers formatted for a double blind review . Diagrams and images should be in color where appropriate. At least one author of an accepted paper must register for and attend the conference. Research that is not accepted as a paper will automatically be considered for the poster session. Authors can, of course, decline to have their work be considered as a poster. \n\n\n\nPosters \n\nThe posters program at SAP provides an informal venue for authors to share their research achievements and further discuss them with others. In that spirit, we encourage all types of scholarly submissions that fit the scope of ACM SAP. In particular, we explicitly welcome poster submissions on work-in-progress and on work that may have been previously published elsewhere but for which additional dissemination and discussion is desired. The poster session is an integral part of SAP and the SAP program will include a dedicated time slot for poster viewing and discussion. All poster presenters will also have the opportunity to give a one-minute presentation on their work during a poster fast-forward session. \n\nNOTE: SAP poster abstracts are NOT considered to be publications, and as such will NOT appear in the ACM Digital Library. Poster abstracts WILL be included in the conference USB drive. Poster extended abstracts may include figures and should follow the general [ http://www.siggraph.org/learn/instructions-authors | SIGGRAPH formatting guidelines ] , except that they should be 1 page long. Note that you do not need to submit the actual poster. \n\n\n\n***New Reviewing Process*** \n\nStarting this year, we have adopted a new reviewing process. Each submitted paper will be assigned to the two members of the International Program Committee (IPC) whose expertise most closely matches the topic(s) of the paper. Each IPC member will find two external, independent experts to perform the actual reviews. Subsequently, the four reviewers and two IPC members will engage in a discussion about the paper and the reviews, working towards a consensus recommendation for the paper. This discussion will occur on a paper-by-paper basis. No reviewer or IPC member will have access to the discussion or reviews for a paper to which they were not assigned. The two program chairs will, as usual, consider the recommendation(s), the contents of the reviews, as well as the papers themselves to reach a final decision on each paper. \n\n\n\nPossibility for Journal Publication \n\nUnder an agreement with the ACM Transactions on Applied Perception (TAP) and the ACM Publications Board, the strongest accepted papers will be offered publication as full papers in the ACM journal TAP (instead of appearing in the proceedings). Authors of such special issue papers must agree to present the paper at ACM SAP. As has always been the case, authors of regular ACM SAP papers can still submit to TAP regular issues with appropriate additions. Papers that have been recommended for acceptance in the ACM TAP journal will undergo a second review cycle, during which the authors will revise the paper to address reviewer concerns (similar to conditional acceptances at ACM SIGGRAPH). Please note that TAP referrals are conditional. The TAP reviewers may recommend bringing the paper back to the SAP proceedings if the quality of the revision is inadequate. Therefore, it is very important to incorporate as many reviewer comments as possible into the revision. \n\nThe revised paper has to be submitted in TAP format to [ https://mc.manuscriptcentral.com/acm | Manuscript Central ] and must include a cover letter stating that the submission is for the SAP special issue. The cover letter should also document the list of changes made to the paper to address the reviewer concerns. Please note that TAP has a 20 page limit INCLUDING references. Reformatting, a paper from the SAP format to the TAP format typically adds a few pages. Complete TAP author guidelines and templates are available at [ http://tap.acm.org/authors.cfm | http://tap.acm.org/authors.cfm ] \n\n\n\nDeadlines \n\nEach deadline is 23:59:59 AoE (Anywhere on Earth) ==> GMT/UTC-12:00 on the stated day, no matter where the submitter is located. \n\nPapers: \n\n    * Tuesday, May 14th: Abstract submission \n    * Tuesday, May 21st: Paper submission \n    * Tuesday, June 25th: Paper re-submission \n    * Tuesday, July 2nd: Decisions announced \n    * Tuesday, July 14th: Final papers due \n\n\n\nPosters: \n\n    * Tuesday, July 9th: Poster submission \n    * Tuesday, July 16th: Decisions announced \n    * Tuesday, July 23rd: Camera ready version of 1-page abstract due \n\n\n\nOur [ https://sap.acm.org/2019/authors.php | Information for Authors ] page includes deadlines and other important information for authors planning on submitting papers or posters \n\n\n\n\n\n\n\nOrganization \n\nProgram Chairs \n\n\n    * [ https://www.b-tu.de/en/graphic-systems | Douglas W. Cunningham ] , Brandenburg University of Technology \n    * [ https://people.rennes.inria.fr/Ludovic.Hoyet/ | Ludovic Hoyet ] , INRIA \n\nConference Chairs \n\n\n    * Solne Neyret , University of Barcelona \n    * Elena Kokkinara , Inflight VR \n    * [ https://www.microsoft.com/en-us/research/people/margon/ | Mar Gonzalez Franco ] , Microsoft Research \n\nPoster Chair \n\n\n    * [ http://psych.pan.pl/pl/pracownia-psychologii-spolecznej/2170-2/ | Justyna widrak ] , IDIBAPS & Institute of Psychology, Polish Academy of Sciences \n\n\n\n\n\n\n\n\n--\nGamesnetwork, discussion list of Digital Games Research Association, www.digra.org\nNote: to unsubscribe, send \"UNSUBSCRIBE GAMESNETWORK\" to LISTSERV@UTA.FI from\nyour subscribed email account. Web interface to subscribe and manage your subscription:\nhttps://listserv.uta.fi/cgi-bin/wa?SUBED1=GAMESNETWORK&A=1 .\nThe list archive is available online at: https://listserv.uta.fi/archives/gamesnetwork.html\n\n\n\n ACM Symposium on Applied Perception Call for papers and posters Reminder: paper submission deadline on May 21stThe ACM Symposium on Applied Perception (ACM SAP) provides an intimate, immersive forum for researchers who combine knowledge, methods, and insights from perception research andcomputer science disciplines. This explicitly includes such disciplines as cognitive psychology, perceptual psychology, psychophysics, behavior-analysis, and neuroscience on the perceptual side and computer graphics, computer vision, visualization, and human-computer interfaces on the visual computing side to name just a few! The interdisciplinary focus of this conference explicitly acknowledges that the various scientific disciplines in perception research and computer science research use different but complementary methods to address fundamentally similar questions. As such, combinations of knowledge, methods, and/or insights from the different fields can help to advance all of the applied perception fields.ACM SAP 2019 will be held in Barcelona, Spain on the 19th and 20th of September, 2019. We invite submissions of original work in all areas of applied perception, regardless of sensory modality (vision, haptics, acoustics, proprioception, etc.). The focus of the work can be either perceptual or computational, but each submission must  as always  include elements of both perception and visual computing.Relevant approaches include: application of perceptual research to any area of computer science, including:modeling, rendering, animation;virtual environments, characters;processing information from artificial sensors;representation of data, communication of data; applications of computer science to any area of perception, such as:modeling natural perceptual systems;simulating natural perceptual systems;systematic study of natural perceptual systems.PapersResearch can be submitted as long paper (up to 8 pages) or as a short paper (up to 4 pages). In all cases the page limit is EXCLUSIVE of the pages devoted to bibliographic references and appendices. Authors are explicitly encouraged to include a full citation list. All submissions should follow the general SIGGRAPH formatting guidelines Please submit all papers formatted for a double blind review. Diagrams and images should be in color where appropriate. At least one author of an accepted paper must register for and attend the conference. Research that is not accepted as a paper will automatically be considered for the poster session. Authors can, of course, decline to have their work be considered as a poster. PostersThe posters program at SAP provides an informal venue for authors to share their research achievements and further discuss them with others. In that spirit, we encourage all types of scholarly submissions that fit the scope of ACM SAP. In particular, we explicitly welcome poster submissions on work-in-progress and on work that may have been previously published elsewhere but for which additional dissemination and discussion is desired. The poster session is an integral part of SAP and the SAP program will include a dedicated time slot for poster viewing and discussion. All poster presenters will also have the opportunity to give a one-minute presentation on their work during a poster fast-forward session.NOTE: SAP poster abstracts are NOT considered to be publications, and as such will NOT appear in the ACM Digital Library. Poster abstracts WILL be included in the conference USB drive. Poster extended abstracts may include figures and should follow the general SIGGRAPH formatting guidelines, except that they should be 1 page long. Note that you do not need to submit the actual poster. ***New Reviewing Process***Starting this year, we have adopted a new reviewing process. Each submitted paper will be assigned to the two members of the International Program Committee (IPC) whose expertise most closely matches the topic(s) of the paper. Each IPC member will find two external, independent experts to perform the actual reviews. Subsequently, the four reviewers and two IPC members will engage in a discussion about the paper and the reviews, working towards a consensus recommendation for the paper. This discussion will occur on a paper-by-paper basis. No reviewer or IPC member will have access to the discussion or reviews for a paper to which they were not assigned. The two program chairs will, as usual, consider the recommendation(s), the contents of the reviews, as well as the papers themselves to reach a final decision on each paper. Possibility for Journal PublicationUnder an agreement with the ACM Transactions on Applied Perception (TAP) and the ACM Publications Board, the strongest accepted papers will be offered publication as full papers in the ACM journal TAP (instead of appearing in the proceedings). Authors of such special issue papers must agree to present the paper at ACM SAP. As has always been the case, authors of regular ACM SAP papers can still submit to TAP regular issues with appropriate additions. Papers that have been recommended for acceptance in the ACM TAP journal will undergo a second review cycle, during which the authors will revise the paper to address reviewer concerns (similar to conditional acceptances at ACM SIGGRAPH). Please note that TAP referrals are conditional. The TAP reviewers may recommend bringing the paper back to the SAP proceedings if the quality of the revision is inadequate. Therefore, it is very important to incorporate as many reviewer comments as possible into the revision.The revised paper has to be submitted in TAP format to Manuscript Central and must include a cover letter stating that the submission is for the SAP special issue. The cover letter should also document the list of changes made to the paper to address the reviewer concerns. Please note that TAP has a 20 page limit INCLUDING references. Reformatting, a paper from the SAP format to the TAP format typically adds a few pages. Complete TAP author guidelines and templates are available at http://tap.acm.org/authors.cfm DeadlinesEach deadline is 23:59:59 AoE (Anywhere on Earth) ==> GMT/UTC-12:00 on the stated day, no matter where the submitter is located.Papers:Tuesday, May 14th: Abstract submissionTuesday, May 21st: Paper submissionTuesday, June 25th: Paper re-submissionTuesday, July 2nd: Decisions announcedTuesday, July 14th: Final papers duePosters:Tuesday, July 9th: Poster submissionTuesday, July 16th: Decisions announcedTuesday, July 23rd: Camera ready version of 1-page abstract dueOur Information for Authors page includes deadlines and other important information for authors planning on submitting papers or postersOrganization Program ChairsDouglas W. Cunningham, Brandenburg University of TechnologyLudovic Hoyet, INRIAConference ChairsSolne Neyret, University of BarcelonaElena Kokkinara, Inflight VRMar Gonzalez Franco, Microsoft ResearchPoster ChairJustyna widrak, IDIBAPS & Institute of Psychology, Polish Academy of Sciences   \n--\nGamesnetwork, discussion list of Digital Games Research Association, www.digra.org\nNote: to unsubscribe, send \"UNSUBSCRIBE GAMESNETWORK\" to LISTSERV@UTA.FI from\nyour subscribed email account. Web interface to subscribe and manage your subscription:\nhttps://listserv.uta.fi/cgi-bin/wa?SUBED1=GAMESNETWORK&A=1 .\nThe list archive is available online at: https://listserv.uta.fi/archives/gamesnetwork.html",
    "attachments": []
}