{
    "subject": "[Gamesnetwork] CfP: Spectator Experience in Gaming and eSports - A\tCHI 2020 Workshop",
    "from": "Günter Wallner <wallner.guenter@uni-ak.ac.at>",
    "to": "gamesnetwork@lists.tuni.fi",
    "cc": null,
    "bcc": null,
    "date": "Fri, 13 Dec 2019 07:44:49 +0100",
    "body": "==============================================================\nCall for Papers (CHI 2020 Workshop)\nBe Part Of It: Spectator Experience in Gaming and eSports\n<https://seegamesws.wordpress.com/>\nSubmission Deadline: 11 February 2020\n==============================================================\n\nThis one-day workshop aims to bring researchers and industry \nprofessionals from different disciplines together to promote \ninterdisciplinary exchange, to increase awareness, and to establish a \ncommunity and collaborations how technology and Human-Computer \nInteraction can help to transform the act of spectating games and \nparticularly esports from a merely passive (watching) to a more active – \nand engaging – experience. Submissions are invited on, but not limited \nto, the following topics.\n\n==============================================================\n  Topics\n==============================================================\nSubmissions are invited on, but not limited to, the following topics:\n\n- User requirement analysis for improving spectator experiences\n- Design concepts to increase audience participation\n- Use cases that describe spectator experiences in practice\n- Evaluation methods for assessing spectator experience\n- User studies on spectatorship\n  - Studies on streamer-audience interaction dynamics, toxic behaviour, \nor harassment\n- Data visualizations and dashboards that support spectatorship\n- Spectator analytics\n- Social and community aspects of streaming\n  - Technological solutions for empowering viewers (AR, VR, wearables, etc.)\n- Solutions that aid shoutcasters in commenting live broadcasts\n- Prediction of in-game events and outcomes\n\n==============================================================\n  Submissions\n==============================================================\nAuthors are invited to submit a 2- to 4-page position paper in the CHI \nExtended Abstract format or a slide deck consisting of 5 slides (only \nrecommended for industry participants) on or before February 11th, 2020 \nvia https://easychair.org/conferences/?conf=seegames20. Each submission \nwill be peer-reviewed by at least two of the workshop organizers (and, \nif required, additional experts) and will be selected based on quality \nand relevance to the workshop themes.\n\nAt least one author must attend the workshop and all participants must \nregister for both the workshop and for at least one day of the conference.\n\nFurther details about the workshop can be found at\nhttps://seegamesws.wordpress.com/\nGamesnetwork@lists.tuni.fi is discussion list of DiGRA, the Digital Games Research Association. You can unsubscribe, edit your subscription address, etc. at the web interface:\nhttps://lists.tuni.fi/mailman/listinfo/gamesnetwork",
    "attachments": []
}