{
    "subject": "[Gamesnetwork] Call for papers: ECREA main conference, Digital Games Research Section (deadline January 15, 2020)",
    "from": "\"Siitonen, Marko\" <marko.siitonen@jyu.fi>",
    "to": "Gamesnetwork <gamesnetwork@uta.fi>",
    "cc": null,
    "bcc": null,
    "date": "Mon, 02 Dec 2019 07:58:46 +0000",
    "body": "Call for papers: \r\n\r\nThe European Communication Research and Education Association (ECREA) in partnership with the University of Minho call for papers to be presented at the 8th European Communication Conference, to be held in Braga, Portugal, from 2 October to 5 October 2020.\r\n\r\nThe Conference has chosen the key theme ‘Communication and trust: building safe, sustainable and promising futures’\r\n\r\nThe Digital Games Research Section wants to extend the call to all scholars working in game studies. The section invites contributions dealing with digital games as cultural objects, digital gaming as a social practice, digital games as media for communication and related topics. Particular interest goes to understanding the cultural, psychological and sociological implications of digital gaming and of digital games as cultural objects and mass-market products, as well as serious applications of digital games. The section offers an interdisciplinary platform for exploring the impact and meaning of game culture(s). We welcome contributions dealing with topics traditionally associated with specific fields such as communication, but also humanities, media psychology, education science, economics and others. We deliberately aim for both qualitative and quantitative work in the belief that both deserve equal attention and are able to reinforce one another. We employ an inclusive definition of digital games as any game played on any digital device and explicitly do not limit the scope for submissions in this regard. The call is open for works dealing with both more traditional forms of digital gaming, ranging from nostalgia and retro gaming to newer innovations such as virtual reality, augmented reality, or location-based games.\r\n\r\nSee the full call at http://www.ecrea2020braga.eu/2019/10/09/http-www-ecrea2020braga-eu-call-for-papers/\r\n\r\nDeadline for abstracts is January 15, 2020.\r\n\r\nOn the behalf of the Digital Games Research Section,\r\n\r\nMarko Siitonen\r\n\r\n\r\n***\r\nMarko Siitonen\r\nAssociate Professor, PhD\r\nIntercultural and Digital Communication\r\nDeparment of Language and Communication Studies\r\nUniversity of Jyväskylä, Finland\r\n\r\np: +358 40 576 7861\r\ne: marko.siitonen@jyu.fi\r\nt: markosiitonen\r\nw: https://markosiitonen.wordpress.com/\r\n",
    "attachments": []
}