{
    "subject": "[Invitation__ for_- Research__Paper__open__access__journal!!!]",
    "from": "IJO Journal <rahul@ijojournal50.club>",
    "to": "undisclosed-recipients:;",
    "cc": null,
    "bcc": null,
    "date": "Fri, 11 Oct 2019 08:21:36 +0530",
    "body": "DEAR RESPECTED COLLEAGUE, \n\nI wish to inform you that IJO Journal is still accepting research\npapers, theses, commentaries, dissertations and write-ups for\nproofreading. Our major aim is to help researchers publish quality\nresearch works devoid of grammatical errors. We are therefore requesting\nauthors to send their research works for thorough grammatical editing.\nIf interested, kindly submit paper or direct your colleague (s) to any\nof the following email addresses: \neditor@ijojournal.com \n\nOUR JOURNALS:- [1]\nPayment for proofread research paper is via any of the following ways\nbelow: \n*    Bank Transfer \n*    PayPal \n*    Western Union Money Transfer \n\nOur effective editing board makes sure that each paper you send to us\ngets back to you within 96 hours (4 days) upon receipt of payment\nconfirmation. Our services include: \n*    Proofreading \n*    Editing grammatical errors \n*    Proper punctuation \n*    Paraphrasing and editing of sentences, aligning of articles \nand any other errors \n\n_WHATSAPP CONTACT NO.: +91 9991551673 (CONTACT FOR RAPID ASSISTANCE FOR\nYOUR ARTICLE.)_\nWITH REGARDS\n\nIJO JOURNAL \n\nhttp://ijojournal.com \n\nIJO JOURNAL \n\nNOTE: \n\nIN CASE YOU ARE RECEIVING OUR E-MAIL IN YOUR JUNK-MAIL/SPAM, MARK THIS\nE-MAIL AS NOT JUNK/SPAM OR ADD IT TO YOUR SAFE SENDER'S LIST. \n\nIf you think this mail is not related to your field please reply\nUNSUBSCRIBE. You will no longer receive emails from us. Thanks:\ninfo@ijojournal.com \n\n  \n\nLinks:\n------\n[1] http://ijojournal.com\n\nDear Respected Colleague,   I wish to inform you that IJO Journal is still accepting research papers, theses, commentaries, dissertations and write-ups for proofreading. Our major aim is to help researchers publish quality research works devoid of grammatical errors. We are therefore requesting authors to send their research works for thorough grammatical editing. If interested, kindly submit paper or direct your colleague (s) to any of the following email addresses:  editor@ijojournal.com\nOur Journals:- Payment for proofread research paper is via any of the following ways below:      Bank Transfer      PayPal      Western Union Money Transfer   Our effective editing board makes sure that each paper you send to us gets back to you within 96 hours (4 days) upon receipt of payment confirmation. Our services include:      Proofreading      Editing grammatical errors      Proper punctuation      Paraphrasing and editing of sentences, aligning of articles  and any other errors \nWhatsApp Contact No.: +91 9991551673 (Contact for rapid assistance for your article.) With Regards  IJO JOURNAL\nhttp://ijojournal.com\nIJO Journal\nNote:\nIn case you are receiving our e-mail in your Junk-mail/Spam, mark this e-mail as Not Junk/Spam or add it to your Safe Sender's list.\nIf you think this mail is not related to your field please reply Unsubscribe. You will no longer receive emails from us. Thanks: info@ijojournal.com\n \n \n\n",
    "attachments": []
}