{
    "subject": "[game_edu] VS Games 2015: First Call for papers",
    "from": "Christos Gatzidis <cgatzidis@bournemouth.ac.uk>",
    "to": "Games Research Network <GAMESNETWORK@uta.fi>, \"eguk-members@eg.org\" <eguk-members@eg.org>",
    "cc": "\"fliarokapis@gmail.com\" <fliarokapis@gmail.com>, \"game_edu@igda.org\" <game_edu@igda.org>, \"icec@listserver.tue.nl\" <icec@listserver.tue.nl>, \"3DUI@LISTSERV.VT.EDU\" <3DUI@LISTSERV.VT.EDU>",
    "bcc": null,
    "date": "Tue, 28 Oct 2014 21:26:35 +0000",
    "body": "The Seventh International Conference on Virtual Worlds and Games for Serious Applications: VS-Games 2015 will be held in Skövde, Sweden between September 16th and 18th.\n\nVS-Games 2015 aims to meet the challenges of the cross-disciplinary community that work around non-leisure applications of games and game technologies by bringing the community together to share knowledge and experiences. In 2015 we will also aim to bridge the gap between so called serious games and entertainment games. The reason we chose to do this in Skövde in 2015 is the strong interest of University of Skövde and Sweden Game Arena in both areas and we sincerely believe that we can learn from each other.\n\nThe conference will explore games and virtual worlds in relation to:\n\n\n *   Applications (e.g. case studies, exemplars, practice examples) illustrating the practical usefulness and impact of serious games and virtual worlds\n *   Applications of entertainment games technologies and solutions in non-leisure contexts\n *   Methodologies, theories and frameworks (e.g. participatory design methods, mixed methodologies for data collection and analysis, cross-disciplinary methods)\n *   Evaluation approaches and studies\nFull call for papers and other information available from: http://www.his.se/vsgames2015/\n\nImportant dates and submission:\n\n\n *   Full Paper submission (8 pages): 31st March 2015\n *   Short Paper submission (4 pages): 31st March 2015\n *   Poster Paper submission (2 pages) 31st March 2015\n *   Notification of review results: 5th June, 2015\n *   Camera ready due: 30th June, 2015\nApologies for any cross postings.\n\nThanks,\n\nChristos\n\n--\nDr Christos Gatzidis\nBSc(Hon's), MA, PhD, PGCert, MIET\nAcademic Grade 9\nActing Framework Leader for Creative Technology\n\nBournemouth University\nRoom P211\nFaculty of Science and Technology\nPoole House\nTalbot Campus, Poole, BH12 5BB, Dorset\nUK\n\nPhone No: +44 (0) 1202 965135\nFax No: +44 (0) 1202 965314\n\nPersonal Profile at Bournemouth University: http://onlineservices.bournemouth.ac.uk/academicstaff/Profile.aspx?staff=cgatzidis\nPersonal Website at City University London: http://vega.soi.city.ac.uk/~abbp171/\nPersonal Blog: http://christosgatzidis.blogspot.com/\n\nDoran, J. and Gatzidis, C., 2012. UDK iOS Game Development Beginner's Guide. Birmingham: Packt Publishing.: http://link.packtpub.com/bbexNT\n\nVS-Games 2013 (the 5th International Conference on Games and Virtual Worlds for Serious Applications), 11-13 September 2013, Bournemouth: http://www.vsgames2013.org/\n\n\n\n[http://www.bournemouth.ac.uk/Images/QueensAwardLogo.jpg]\n\nBU is a Disability Two Ticks Employer and has signed up to the Mindful Employer charter. Information about the accessibility of University buildings can be found on the BU DisabledGo webpages<http://www.disabledgo.com/en/org/bournemouth-university>\n\nThis email is intended only for the person to whom it is addressed and may contain confidential information. If you have received this email in error, please notify the sender and delete this email, which must not be copied, distributed or disclosed to any other person.\n\nAny views or opinions presented are solely those of the author and do not necessarily represent those of Bournemouth University or its subsidiary companies. Nor can any contract be formed on behalf of the University or its subsidiary companies via email.\n_______________________________________________\ngame_edu mailing list\ngame_edu@igda.org\nhttps://pairlist7.pair.net/mailman/listinfo/game_edu\n",
    "attachments": []
}